[{"id":"10740582","name":"South West Strings Badminton Club","link":"https://www.meetup.com/southweststringsbadmintonclub","description":"**Welcome to South West Strings Badminton Club**\n**If you are looking for a purely FUN CLUB to enjoy good games of badminton with and to meet like-minded individuals, look no further as this club is EXACTLY THAT AND MORE!!. We are truly a social club. I set up this club purely to have fun and enjoy the sport of badminton and other fun social activities. We welcome everyone but there has to be a minimum levels ( Advance Beginner and Above ) that we expect if you are unsure of this please call me 07837 440 947 to discuss this.**\n**The games are organized by the organizer/s and are supervised. All session list the fees and all players have agreed to the rules and price of the session when RSVPed a session. There are not many rules here but I do expect everyone to be courteous and respectful to each other and show good sportsmanship. If there are any problems, please refer them to me. If you are joining to prove to everyone how good you are seeking to benefit from the club by taking advantage of its members in any unethical way or have negative intents, this is not the club for you!!**\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n**Session fee is:**\n**2hrs session is £10 per person**\n**3hrs session is £15 per person**\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*** \n**Our Club Venues Locations and Club Days & Session time & skill level requirements;** \n**Elephant & Castle / Balham-Clapham South / Streatham Vale - Norbury / East Dulwich / Southfields**\n\n**All Level Sessions:**\n**Wednesday at 8pm to 10pm in Streatham Vale - Norbury -SW16**\n**Sunday at 5.30pm-7.30pm Clapham South -SW12**\n\n**Advance Beginners and improver:** \n**Sundays at 2.30pm to 5.30pm in Balham / Clapham South -SW12**\n\n**Lower Intermediate and above:**\n**Tuesdays: 7.30pm to 9.30pm in East Dulwich, SW22**\n**Wednesday at 7pm to 10pm in Balham / Clapham South -SW12** \n**Thursdays at 7pm to 9pm in Balham / Clapham South -SW12**\n**Sundays: 2.15pm to 5.15pm in Balham / Clapham South, SW12**\n\n**Intermediate and above**\n**Mondays at 8pm to 10pm in Elephant & Castle, SE1**\n**Wednesday at 8pm to 10pm in Elephant & Castle, SE1**\n**Thursdays: 8pm to 10pm in Southfield -SW18**\n\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n**For all advance beginners please attend our Sunday advance beginner and Improver session or ALL level session so you can be assessed before attending our other sessions.**\n**RSVP Policy: Our cancellation period is the lowest in meetup badminton community we don't expect a player to give 24hrs notice as this is unrealistic so with this in mind we have a 12hrs cancellation period before any session. anyone canceling after this time will be charged at session fee/rate no matter whether your space/spot was taken up by someone else. A No shows will result in a ban from this club. If you miss a session, please repay your organizer.**\n**Please note, we are an informal meet-up group, and are NOT covered by insurance. If you wish to have personal insurance in case of any injuries, please arrange this yourself prior to playing. Please make sure you warm up before playing.**\n**RSVP Cancellation Policy: If an event is full, members will have the option of adding themselves to the waitlist. When spots open up, members will be automatically RSVPed in the order in which they joined the waitlist. Cancellation policy still applies so please ensure you remove your RSVP if you do not wish to attend a session.**\n**1 X Late Cancellation :12hrs before session = Session Cost / fee**\n**2 X Late Cancellation =Permanent Ban**\n**1 X No Show = Permanent Ban**\n**Call me if you have question 07837 440 947** \n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n**We now provide a Stringing service:** \n**Please be aware that I will do my utmost to string your racket and will check for racket head damages before any work is done on the racket.**\n**South West Strings Badminton Club or I will not be responsible for any damages occurred while/after the stringing work.**\n**Please be aware you leave your racket with me at your own risk and work won't proceed until you confirm you accept the risk.**\n**Price cost of Stringing:**\n**Yonex Aerobite £21**\n**Yonex BG 85 £21**\n**Yonex Aerosonic £20**\n**Yonex BG 66 Ultimax £20**\n**Yonex BG 80 Power £19**\n**With own String - £13**\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n**This is an adult only club. The organizers reserves the right to refuse entry where they see fit.**","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"35912446","name":"20-30's London Community - Make New Friends","link":"https://www.meetup.com/20-30s-london-community-make-new-friends","description":"Welcome to our new community designed for 20s and 30s in London to meet, connect and hopefully build life-long friendships.\n\nTo help make this happen, we also host all kinds of events from free social walks, games evenings, day trips, social events, activity nights to picnics.\n\nYou can bring a friend to our events or come alone, our events will give you an opportunity to make new friends and have a ton of fun while you're at it.\n\nTo join our new Facebook Community, please click here: [https://www.facebook.com/groups/2285620851573182/?ref=share](https://www.facebook.com/groups/2285620851573182/?ref=share)\n\nMeanwhile, to follow our new Instagram page, please click here: [https://www.instagram.com/london20_30s](https://www.instagram.com/london20_30s)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"10455592","name":"The London Warhammer Gaming Guild","link":"https://www.meetup.com/the-london-warhammer-gaming-guild","description":"A Central London based group dedicated to all thing wargaming including: Warhammer 40K, Necromunda, Kill Teams, Fantasy, Horus Heresy, Age of Sigmar, Shadespire, Bloodbowl, and many more besides. \nFrom newbies to experts, those who just love the craft and painting, or having a social with fellow minds this group is for you.\n\nWe meet regularly in central London for gaming sessions across the Wargaming range, with a lot of popularity in the Warhammer range of games, Dungeons & Dragons. We arrange socials, throw events, and generally have a great time while doing it!\nIn short; there's something to keep every type of wargamer / role player happy.\n\nWe're dedicated to keeping it friendly, fun, and honourable. The club moto is '**Victis Honor!'** meaning \"Honour to the vanquished!\". With that, we instill a strong sense of fair play and friendly competition in all our members.  We will aim to match members fairly with people of similar skill and ability.\nSo, if you think your ready, sign up and come to our War Meet.  \n\nPeter Davies\nClub Founder","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"25541354","name":"Central London Badminton Club","link":"https://www.meetup.com/central-london-badminton-club","description":"<p><strong>Central London Badminton Club</strong></p><p><br /></p><p>We are a group of players looking for new members to join us for Sunday morning and Thursday evening badminton at Euston/ Kings Cross location. We play doubles badminton.</p><p><br /></p><p>We usually play at Somers Town Community Sports Centre ( address: 134 Chalton Street, London NW1 1RX between 10am-12 noon (sometimes till 1pm) on Sundays and usually go for a quick lunch afterwards. We like to play early so that we can still enjoy the weekend with friends and family.</p><p>We also play during the week on Thursday evening - session (7:30pm - 9:30pm) at the same venue.</p><p><br /></p><p>We are looking for new players whose standard is intermediate (mid) and above to join us (sorry no beginners and improvers or lower intermediate players). We like to play for fun; we have great games but not looking for those who play too serious - so no Lee Chong Wei's and Lin Dan's!</p><p><br /></p><p>We want to ensure the quality of play while controlling the standard of the club, this means that players who are not quite up to the standard may be asked politely to leave.</p><p><br /></p><p>We play with quality feathers; cost for two hours is £10, (if we play for three hours the cost will be between £12-£15 depending on number of players participating).</p><p><br /></p><p><strong>IMPORTANT BITS</strong></p><p>• You will need to bring your own racket, if you need to borrow please message one of the organisers privately.</p><p>• You will need correct shoes and clothing</p><p>• Please ensure that you stretch and warm up before and after sessions to prevent injury.</p><p>• Your are responsible for your own well-being and we and the sports facility representatives will not be responsible for any injury, stolen or damaged property or any other occurrences during our sessions.</p><p><br /></p><p><strong>BOOKING SYSTEM &amp; CANCELLATIONS </strong></p><p>• If you want to attend the games, you must RSVP for yourself and any friend that you may wish to bring that is not a member.</p><p>• If you do not RSVP and attend, you will be turned away (as there is a limit to amount of players and we want to avoid overcrowding)</p><p>• If you RSVP and DO NOT attend (e.g. Late cancellations / no shows/ friend cannot attend) then you will be fined for the relevant session, unless you remove (or adjust in terms of friends) your RSVP at least 24hrs before the session start time. This will ensure fair access for everyone. The penalty still applies whether or not the spaces vacated were taken by other members. Penalty will be £10.</p><p>• If an event is full, members will have the option of adding themselves to the waitlist. When spots open up, members will be automatically RSVPed in the order in which they joined the waitlist. The cancellation policy still applies so please ensure you remove your RSVP if you do not wish to attend a session thus providing others a chance.</p><p>• People who abuse the system may have their membership revoked and banned from rejoining.</p><p>• Our decisions are final.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"10096402","name":"The BCS British Chinese Society","link":"https://www.meetup.com/the-bcs","description":"We are the BCS British Chinese Society. Our meetup group aims to bring together Chinese and Asian professionals with social events, sports and cultural activities to network and make new friends.\n我們是中英會。我們旨在將年輕的中國和亞洲專業人士結合在一起，結交新朋友，社交，體育和文化活動。\n\nOur meetup events include:\n\\- Social networking drinks \\(Chinese/Asian/UK\\)\n\\- Meals \\(Chinese\\, Japanese\\, Korean\\, Taiwanese\\, Vietnamese\\, Malaysian\\, Singaporean\\, Thai etc\\.\\)\n\\- Outdoor and indoor activities: hiking\\, bouldering\\, cycling\\, etc\\.  \n\\- Tours: museums\\, sightseeing\n\\- Board games\n\\- and your suggestions\\!\n\nYoutube\n[https://www.youtube.com/watch?v=QSJuPtTKeBs](https://www.youtube.com/watch?v=QSJuPtTKeBs)\n\nInstagram\nhttps://www.instagram.com/bcsbritishchinesesociety/\n\nJoin our Facebook Group\n[https://www.facebook.com/groups/britishchinese](https://www.facebook.com/groups/bcslondon/)\n\nLike our Facebook page\n[https://www.facebook.com/bcs.messenger/](https://www.facebook.com/bcs.messenger/)\n\nClubhouse \n[https://www.joinclubhouse.com/club/bcs-british-chinese-soc](https://www.joinclubhouse.com/club/bcs-british-chinese-soc)\n\nBCS Online Magazine - Shared Horizon \nhttps://sharedhorizon.wordpress.com/about-us/\n\nBCS is not funded by any bodies and staffed by unpaid volunteers who are in full time jobs. We would love members and everyone who loves attending to our events to voluntarily make a donation to the below link\n[https://www.justgiving.com/crowdfunding/bcs2](https://www.justgiving.com/crowdfunding/bcs2)\nTo avoid confusion and for the safety of our members, new members will require an actual photo of themselves and real name (shorten is fine) or their membership will be revoked. Furthermore any malicious or offensive comments in the Meetup page or advertising of other groups (unless agreed with the Organisers' team) will also result in the members removal.\n\nIf you receive any private message from members you have never met before from Meetup or from any other social media medium or Whatsup and feel uncomfortable from them.  Please contact one of the BCS Organiser and we will have the offender banned.  \n\nFinally for events that there is a requirement to pay for entry for our event (as a result of extra costs for the hire and services that needs to pay to suppliers in advance), unless otherwise stated, a request for refund 1 week before the start of the event without any prior notice will NOT be refunded. It is not acceptable for Organisers who are volunteers to pay upfront cost out of their own monies and then expect an Organiser to find a replacement in the last minute to pay for a refund from a confirmee of an event. \n\nThank you for your co-operation.","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"32845603","name":"London Powershuttlers Badminton Club","link":"https://www.meetup.com/london-powershuttlers-badminton-club","description":"<p>We are badminton enthusiasts playing at Clapham Junction area. We aim to play socially to stay active and fit. We play friendly but competive games during the sessions. We occassionally participate into interclub games and compete to some social club tournaments.</p> \n<p>We welcome everyone who shares the same love with badminton. You should at least have the ability and skills more than just basic badminton. If you are a complete beginner kindly contact organizers for the schedules of the sessions with those level so you may enjoy the game session.</p> \n<p>We are generally super fun and friendly group and would love to hang around for snacks and drinks after the game.</p> \n<p>We play with good quality feather shuttlecocks. Game venues will be announced per session booking.</p> \n<p>Feel free to send inquiries at: londonpopwershuttlersclub@gmail.com</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"35500757","name":"Sportas - the best way to play sports with others in London!","link":"https://www.meetup.com/sportas","description":"Follow us on Instagram! [@sportas.uk](https://www.instagram.com/sportas.uk/)\n\nSportas exists to make it as easy as possible for you to play the sports you love or even try new ones. We organise a range of social sports games -come and join in for some fun and meet some great people! All abilities are welcome 🙏\n\nTo secure your space you must book on: **[www.sportas.co.uk](www.sportas.co.uk)**\nYou will be able to instantly find a game of sports to play at a location & time that suits you.\n\nWe want to bring the fun of social sports back to the world 🌎\n\nPlaying sports is a great way to have fun, meet new people, whilst also keeping fit at the same time 🏃‍♂️","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34622426","name":"London Kannadiga Meetup Group","link":"https://www.meetup.com/london-kannadiga-meetup-group","description":"The London Kannadiga group is open to anyone who speaks Kannada or is interested in learning the language - we will be speaking in Kannada at the meet-ups. Zero restrictions on religion/caste/sexuality/background etc.\n\nMeetup ideas (COVID permitting):\n\n\\- Dose of Dose: trying a new South Indian restaurant every month\\.\n\n\\- Food that isn't Dose: Let's not forget this other half of the Venn diagram\\.\n\n\\- Badminton/Table\\-tennis\\.\n\n\\- Board Games night\\.\n\n\\- Cinema night: Whatever's out\\, but ಕನ್ನಡ ಚಲನಚಿತ್ರಗಳು ಬಿಡುಗಡೆಯಾದರೆ\\, ಖಂಡಿತವಾಗಿ ನೋಡೊಣ\\!\n\n\\- ಕಾಫಿ\\.\n\nSounds busy, but ultimately, this is a place to meet other Kannadigas, relax, and feel at home.\n\nThanks!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"4537272","name":"East London Lesbians","link":"https://www.meetup.com/east-london-lesbians","description":"<p><span>Hi and welcome to East London Lesbians Meetup group! This is a friendly and welcoming Meetup group that is supportive of diversity, including bi, trans and nonbinary identities. </span></p>\n<p><span>We organise regular and one off events to suit all social &amp; cultural tastes. If you fancy a trip to an art gallery, a walk in the woods, or a chat over dinner where you can connect with more people, you have come to the right place.&nbsp;</span></p>\n<p><span>Our regular Monthly Meet ups include:</span></p>\n<p><span>A monthly Supper Club that tours the eateries of East London. Hosted by Róisín and Mel.</span></p>\n<p>A monthly gathering to see the drag show 'Drag Out the Weekend' at the Northcote pub in Leyton/Leytonstone.&nbsp; A space to catch up with other ELL members, enjoy great gastro pub food and watch a different drag act each month. Hosted by Hebba. <a href=\"https://thenorthcotee11.com/\">https://thenorthcotee11.com/</a></p>\n<p>A monthly Book Club held at the Castle Pub in Walthamstow Village. Hosted by Róisín and Nic. <br></p>\n<p>A monthly low key Board Games Evening at a cosy pub in Walthamstow Village with craft beer and a lovely garden nook. Held on the 1st Monday every month. Hosted by Maria. <br></p>\n<p>A monthly gathering at the Red Lion pub in Leytonstone. Hosted by Kirsten. <a href=\"https://theredlionleytonstone.com/\" class=\"linkified\">https://theredlionleytonstone.com/</a> <br></p>\n<p>There are also many other one-off cultural and social events scheduled on our calendar.&nbsp; <br></p>\n<p><span>We offer some events that are unlimited in numbers and some that are smaller with a fixed number attending plus a wait list. Smaller groups are arranged</span><span> for people who prefer a more intimate event and also on occasions where we are limited by numbers e.g. restaurant table sizes. You will always be expected to book your own &nbsp;tickets for events but we try and make arrangements so we can sit together.</span></p>\n<p><span>Please RSVP YES only if you wish to join us. We ask that members treat RSVPing to a meet up with the same level of commitment they would an arrangement to meet a friend. You would not just fail to turn up unless it was a major emergency. It's horrible and disheartening to be stood up and it may mean others on the wait list who want to come are prevented from doing so. Organisers and Event Hosts organise the group in their own time and the monthly website subscription fees are paid by the organiser.&nbsp;</span></p>\n<p><span>On this basis, if you do not attend a meet up without changing your rsvp to \"no\" &nbsp;and cancel at the last minute on two occasions your membership will be cancelled. Obviously, this excludes emergencies. We just ask you let us know in good time that you can't come.&nbsp;</span></p>\n<p><span>We encourage members to host events that they are interested in and we would be delighted to support you if you wish to host an event that interests you in an area/venue you're familiar with. Examples of events that members have run include cinema visits, basketball, art walks and walks in Epping Forest.&nbsp;</span></p>\n<p><span>We strongly advise that members do not advertise their phone numbers, or any other personal details</span><span>, in the comments section which is available on every meet up organised. You can email other members within the group or swap numbers when you meet.&nbsp;</span></p>\n<p><span>Join us on our private commuity group on Facebook: <a href=\"https://www.facebook.com/groups/620533788798717/\">https://www.facebook.com/groups/620533788798717/</a><br></span></p>\n<p><span>for news, reviews and international commentary. <br></span></p>\n<p><span>Best wishes,</span></p>\n<p><span>Róisín</span></p>\n<p> <br></p>\n<p> <br></p>\n<p> <br></p>\n<p> <br></p>\n<p> <br></p>\n<p> <br></p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"35928178","name":"💕MuslimLoveMatch","link":"https://www.meetup.com/muslimlovematch","description":"***WE CONNECT LIKE-MINDED SINGLE MUSLIM PROFESSIONALS!***\n\n***MuslimLoveMatch.co.uk*** is a fun, friendly and easy way to meet new like-minded single muslim professionals. Our events are held in sophisticated and stylish venues and are full of fun, vibrant and interesting single muslim professionals. Our events bring together single muslim professionals who are interested in expanding their social circle. Like a friend's party, our events create a casual and friendly atmosphere and we strive to make socialising fun and easy.\n\nWhether you're looking to make new connections, find love for yourself or a family member, come along and enjoy relaxed Single Muslim Professionals  events and matchmaking services.\n\nMeeting new single Muslim people can be intimidating. Our goal is to make it as fun and easy as possible. We host social mixers, speed dating events, matchmaking services, game nights and other fun activities in a fun & no-pressure environment.\n\n***MuslimLoveMatch.co.uk*** is also a personalised dating service and matchmaking agency in London. We provide personalised dating service for single Muslim professionals who would like an alternative to online dating. If you're fed up with online dating sites and apps, you're too busy for swiping or online dating just isn't for you; then a matchmaking service may be what you need.\n\nIf you have any queries about meet-up events, speed dating or matchmaking services, please contact us via WhatsApp on ***07984958462***\n\n***WWW.MUSLIMLOVEMATCH.CO.UK***\n\n💖💖💖💖💖","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36012326","name":"Esher Socials","link":"https://www.meetup.com/esher-socials","description":"Esher and the surrounding areas have so many bars, restaurants and parks to enjoy but all the meet up groups are in other areas. So I set up this group to bring together people that would like to meet other people in the surrounding area in a social setting.\n\nThe group is for all ages.\n\nI do require a photo of the member when joining to ensure the security of other members.\n\nWhat group members can enjoy are: short walks in local parks, coffee/tea/cakes, evening meals, pub lunches, movie nights and board games etc.\n\nUnfortunately the fees for Meetup mean there is a 50p fee to book onto an event. Numbers may be limited for indoor events.\n\nWhile I appreciate that sometimes circumstances may change and you may not always be able to make a booked event. I would kindly ask that you change your RSVP status to allow people on waiting lists to attend. Three No Shows and no attempt to communicate inability to make the event may result in cancellation of your membership of the group.","city":"Esher","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36428425","name":"Dulwich Board Games","link":"https://www.meetup.com/dulwich-board-games","description":"We are a board game group meeting every Tuesday at The Plough. Open to all from beginners to experts.\n\nIf you're interested in playing modern board games over a drink or two then please come along.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":true},{"id":"16145532","name":"London Fairplay Football","link":"https://www.meetup.com/londonfairplayfootball","description":"**Welcome to London Fairplay Football (LFF), Founded 2014.**\n\nWe pride ourselves on having the best combination on Meetup.com of competitive, quality matches along with great camaraderie and a friendly attitude.\n\nWe play football matches between 8 and 10-a-side.\n\nWe are completely inclusive: all ages from 18yo upwards, all genders/identities and all abilities are welcome.\n\nOur games are action packed and competitive, without the arguments and bad attitudes you sometimes find elsewhere. This is our mantra: **good vibes only**.\n\nWe play on 1/2 of a full size pitch with 8-a-side at Brunel or 9 to 10-a-side at Gunnersbury. This is significantly more enjoyable than playing 5/7 a side at Goals, for example.\n\nThe team sheets are managed to ensure the teams are balanced and an entertaining game is played.\n\nYou do not need to commit for every game; just come when it suites you. Simply RSVP the night before the game (please see the specific details of the event).\n\nDon't be disheartened if you can only get on the wait list. There are usually a few shuffles before match day and you always have a good chance of getting into a game.\n\nBibs and balls are provided, just bring yourself along with some shoes/boots that are suitable for AstroTurf.\n\nThere is plenty of free parking at both.\n\nFor game price, see individual game listings.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36138320","name":"West London Dungeons & Dragons","link":"https://www.meetup.com/west-london-dungeons-dragons-meetup-group","description":"Welcome to the West London Dungeons & Dragons Group!\n\n#LOCATION\n\n* We meet every Tuesday from 19:00 to around 23:00 at The George IV Pub in Chiswick.\n* Please be respectful of the pub's spaces and patrons, and please enjoy their services as much as you are able to.\n* We have two areas in the pub reserved for us, the game room on the mezzanine and the space under it (from the entrance, go to the right end side and you'll find us, or inquire with the staff about the Meetup group).\n* Please RSVP to the events as much in advance as you can and be sure to cancel your attendance if you are not able join.\n\n#TIPS FOR NEW PLAYERS/MEMBERS\n\n* If you have never played before, do not worry: several of the other members of the group are new to the hobby as well, and your GMs (Game Masters) are there specifically to help out with rules, character ideas, etc.\n* Bring dice if you have them, otherwise we can share.\n* We recommend both new and experienced players to setup a free account on DnD Beyond (dndbeyond.com), which gives you access to the Basic Rules for D&D 5th Edition and speeds up the character creation process when you will join your game.\n\n#BE A LEGENDARY PARTY MEMBER: HELP THE GROUP\n\n* WE NEED GMs! More GMs means more players, more games, and a chance for the resident/forever GMs to take a break if needed.\n* Everyone can GM, even if you have never done it before. If you want to give it a try, this is your chance to do so in a safe space and with the additional benefit of having several GMs around who can provide assistance if needed.\n* Any new GM can run One-Shots, short adventures, long campaigns or anything else in between, there is no restrictions on that, as long as all the players are having fun and feel comfortable.\n* If you are interested in taking up the proverbial mantle of the GM, please send a PM on Meetup to one of the organisers, so that we can get you setup properly and notify the rest of the group.\n\nIf you have any question, request or inquiry, please feel free to drop a comment here or to message one of the organisers.\n\nSee you at the next event and, until then, may you roll a streak of Nat20s!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36439096","name":"North Greenwich Riichi Mahjong","link":"https://www.meetup.com/north-greenwich-riichi-mahjong","description":"A game of probability and strategy. Riichi Mahjong aims to develop your skill in assessing calculated risk and reward in this 14 tile thriller of a game. If you'd like to just play the game or would like to pick it up from scratch, join us and ye shall learn the old ways of this age old game. We aim to meet weekly to play some games during the weekdays but weekends will be considered as we grow as a group. Beginner and veterens alike are welcome.\n\nRiichi Mah Jong Basics (Simple - Video) \nhttps://www.google.com/url?sa=t&source=web&rct=j&url=https://m.youtube.com/watch%3Fv%3DPpgcQ3A3PVE&ved=2ahUKEwj4rO2-s-r4AhWKT8AKHauYDMkQjjh6BAgkEAI&usg=AOvVaw38h03pailtIeTrY_jvsD4q\nRiichi Mah Jong Basics (Detailed) \nhttps://mahjong.guide/a-beginners-guide-to-riichi-mahjong/\n\nRiichi Yaku Cheatsheet\nhttps://worldriichi.org/downloads","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":true},{"id":"8216832","name":"Croydon Board Gamers","link":"https://www.meetup.com/croydon-board-gamers","description":"<p>This group is for anyone interested in tabletop board games and card games. We normally play at the Ludoquist board game café in central Croydon.</p><p><br /></p><p>Here are some of the games we play:&nbsp;Codenames, Wingspan, Terraforming MARS, Settlers of Catan, Everdell, Azul, Gaia Project, Eclipse, Clans of Caledonia, Viticulture, Brass, Avalon, Century Spice, Architects of the Western Kingdom, 7 Wonders, Istanbul.</p><p><br /></p><p>Read our FAQ for more info:&nbsp;<a href=\"https://www.meetup.com/Croydon-Board-Gamers/pages/14838742/Club_FAQ/\" target=\"_blank\">https://www.meetup.com/Croydon-Board-Gamers/pages/14838742/Club_FAQ/</a></p><p><br /></p><p>If you're interested in campaign-style card games such as Arkham Horror or Marvel Champions, tabletop role playing games (TTRPGs) and special tabletop gaming events, you may also want to join Ludoquist Meetups https://www.meetup.com/ludoquist-meetups/</p>","city":"Croydon","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18094372","name":"Hemel Hempstead Social","link":"https://www.meetup.com/hemel-hempstead-social","description":"Hemel Hempstead Social Meetup welcomes all, to meet new people, socialise, have fun, try new things and make new friends.\nOur social activities could include meeting for coffee or a drink, eating out, pub nights, live music, dancing, theme nights, cinema, theatre, comedy, arts & crafts, day trips, race days, bowling, quiz nights, games, book club, walks, picnics, afternoon tea, escape rooms, footgolf, bike rides, skating, trampolining, snowboarding or any other sports & leisure activities, museums, galleries and much more. We welcome all ideas. Events can be daytime, evening, midweek or weekends. Members are also encouraged to host events. The more event hosts we have the more events there will be for you to attend. Contact one of the organisers if you are interested & want help with this. All members are required to keep their RSVP's up to date.\nJust get involved, give ideas and organise your own events as well. Don't just sit at home on your own, come out, have some fun & start making new friends.\nPam, Karen & Steve","city":"Hemel Hempstead","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36070712","name":"The Inn Between","link":"https://www.meetup.com/the-inn-between-london","description":"PLEASE NOTE: We pride ourselves in cultivating a healthy active membership base. To do this, we encourage members to RSVP to every event, even if you cannot make it. That way we know you are still interested.\n\n‘A place in between worlds for travellers from distant realities to meet and leave their ails behind’\n\nWhat is the club for? It operates as a board game and table top role playing game meet up for fellow nerds and members of the LGBTQ. We have two dungeons and dragons groups, that meet up on alternating Tuesdays, that are unfortunately now full. If you fancy running your own campaign we are currently looking for DMs. We run board game nights every week on Thursday, with new games being added to our library at each meet up.\n\nA little about me, Aidan, the organiser and founder of this club. My introduction to board games and TTRPGs began with Advanced Dungeons and Dragons, and Talisman. My journey as a nerd continued with games on the original PlayStation, Diablo, Final Fantasy, and Tomb Raider. Then my brother introduced me to novels by Terry Pratchett, the Redwall series, and the Earthsea Quartet by Ursual K. Le Guin. I also dabbled with Warhammer. Safe to say that sealed my identity, and the course of my own personal interests for life. Now I have a space to share and enjoy these interests with others.","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"2042272","name":"Chinese / Korean / Japanese Society Meetup Group","link":"https://www.meetup.com/chinese-korean-japanese-society-meetup-group","description":"<p>We are the biggest Far East Asian meetup group in London.&nbsp; This group is for those who want to experience everything that life has to offer to the fullest, whilst at the same time have fun and make new friends. Perhaps most importantly, the aim of the group is to enjoy ourselves! All are welcome to join provided you share the same ethos!</p>\n<p>Planned activities will include: Dim Sum / Yum Cha | Sushi | Language Exchange (Mandarin, Cantonese, Korean, Japanese, Taiwanese, English) | Cinema | Badminton | Sports (Exercise) | Picnics / BBQ / Dinner Nights / Movie Nights | |Day Trips | Holidays Abroad | Camping | Hiking | Sight Seeing | Parties / Clubbing / Drinks | Business Networking | Investment/Finance | Computer Games | Board Games | Anything Else That Members Suggest!</p>\n<p>Depending on the number of volunteer organisers and numbers that join, we can have more than one event going on at the same time. Events and activities will be organised once every 1 -&nbsp;3 weeks and will be based around the themes of food, culture (movies and music), language exchange, keeping fit and healthy, exploring new places and sharing/developing new ideas.</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"34222952","name":"Hit & Run Badminton club","link":"https://www.meetup.com/meetup-group-twmqxbbs","description":"Hi everyone... We are social badminton club... Opening our door for new players that would llke to join us... We play every week THURSDAY 3 HR & SUNDAY 3 HOUR, we have regular members that join in session... We been running this Club for Few years.. playing in Hammersmith & Middlesex League .. So if you would like to try out social and some challenging game you can give us a try sometime..\n\n\n\n\nFYI... I am sad to say... It might not be suitable for beginners or lower level players... Club sessions is always Intermediate to higher intermediate players.. So it might not to fair or suitable..","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"34921556","name":"Sapphists Hertfordshire","link":"https://www.meetup.com/meetup-group-vmefrdsa","description":"This is a social group to bring Women Who Love Women together,  build a friendly, active over 18s WLW network in Hertfordshire and have fun!\n\n\n\n\nMeet-ups are a great way to meet new people and connect so come along to one of the social events and say hi. We are a really friendly, welcoming bunch!\n\n\n\n\nWe have a great group of organisers, of varying ages, all of whom bring very different life experiences and perspectives to the mix.  In 2022 we are combining Sapphists Hertfordshire with Hitchin Sapphic Socials, and have added a mid Herts event organiser, so we hope you can find something for you not too far from home.  During the last couple of years, spurred on by the desire to address social isolation amongst our Herts LGBTQ+ community, we have enjoyed pub and meal nights, picnics, beach volleyball, book groups, walks, theatre trip, Hertfordshire Pride, North Herts Pride picnic etc.  Some great friendships have developed between some members, and we have been supportive just by being there for each other.\n\n\n\n\nWe hope that the group will grow and develop over time so please do chat to us about your ideas. If there is something you would like to see as part of this group then let us know.\n\n\n\n\nWe look forward to meeting you soon!\n\nEvent Organiser Jacqui - Living in Brighton for almost 15 years I always felt part of a community as LGBTQ+ is part of the fabric of the city. It felt different when I moved to Hitchin so I started a local group to help people feel connected to a wider community and have fun!\n\n\n\n\nGroup Organiser Gillian - After discovering I am lesbian in my 40s/50s, I met and married a woman and moved to another county.  Returning alone to Watford a few years ago, I began to realise I had absolutely no connection with women who love women here!  I joined Meetup and Facebook groups, have enjoyed some great events, and have made many valuable new friends.\n\n\n\n\nEvent Organiser Sharon - I joined the group to socialise with like minded people and have made some lovely new friends.  I’ve enjoyed various nights out with the Sapphists ladies, from meals out, karaoke, book clubs, music to Prides.  Lots of fun and laughter to be had.\n\n\n\n\nEvent Organiser Jenny - I realised I was gay later than most people my age and then felt like I was the only gay in the village.  It seemed like all Lesbian/Bi events were in London and there was nothing in the countryside.  Going to my first LGBTQ+ Meetup was a game changer for me and this group has played a wonderful part in my journey.  So for me helping organise events is my way of paying it forward.  You couldn’t ask for a nicer group of people.","city":"Watford","state":"F8","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36411937","name":"Central London Spanish English Conversation Group","link":"https://www.meetup.com/central-london-spanish-english-conversation-group","description":"Central London Spanish/English Conversation Group is a regular social gathering for people looking to improve (and help other people improve) their Spanish and/or English language skills.\n\nThe group is conversational and has a focus on relaxed communication. We are not grammar teachers, there are no text books, and you will not be tested!\n\nCentral London Spanish/English Conversation Group is open to all levels of Spanish and English proficiencies. Beginners are welcome, although the basics of each language should be known before attending. As mentioned above, we aren't teachers or educators. We are just friendly people who want to communicate with others.\n\nThese events will be mostly focussed around simple conversations, so please come prepared with some interesting topics to mention. We will also have basic table games (Connect 4, cards, etc) to help break the ice and allow for opportunities to practise speaking in a fun environment.\n\nThe current venue is The Old Crown pub at 33 New Oxford Street, just minutes from Tottenham Court Road and Holborn Underground stations. The venue is vegan-friendly and LGBT-friendly. Your hosts are both LGBT community members and everyone is welcome to attend.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35989275","name":"Singles United (40-60) - Activities/Random Events/Adventure","link":"https://www.meetup.com/singles-united-40-60","description":"<p>It has always been a challenge to find fun things to do for the more matured singles, as most socials focus on the under 40s. It feels as if people in their 40s to 60s are seen as… not the fun bunch!</p><p>However, along the way I have met a lot of fun and adventuresome individuals in their 40s and 50s who share the same concern. So I have started a group for singles between 40s to 60s who share similar interest to come together and enjoy life making new friends along the way.</p><p>If you like walking, playing board games, dancing, Immersive experience eg. Escape Room, Murder Mystery, etc and are adventurous; then this group is for you!</p><p>Only London and South East based for now.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35670307","name":"Bacon's College Badminton Group - Canada Water","link":"https://www.meetup.com/badminton-at-bacons-college-canada-water","description":"<p>A friendly sociable badminton club for intermediate and above players looking for fun challenging games!</p> \n<p>Feather Shuttles provided so just bring a racket &amp; water!!</p> \n<p>************************************************</p> \n<p>Cost per person: £10.00 (payment via bank transfer to host) - NO CASH ACCEPTED ON THE DAY</p> \n<p>Courts per session : 4</p> \n<p>Time: 7-10pm</p> \n<p>Days: Every Thursday/Friday - (however once the venue is fully reopened we will revert back to Fridays only)</p> \n<p>Location: Canada Water</p> \n<p>Address: Bacon's College, Timber Pond Road, London, SE16 6AT</p> \n<p>Nearest Stations: Canada Water (Jubliee Line/Overground Line) or Rotherhithe (Overground Line)</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"32396347","name":"Young Londoners (20s&30s)","link":"https://www.meetup.com/ldn-20s-30s","description":"Hi Guys , hope life is treating you good. Welcome to Young & Social LDN (20s and 30s) . We are a social group dedicated to Young Londoners who are keen on exploring this great city and making new friends along the way . Our events will be completely FREE and we will be hosting all kinds of events from , Bar Socials , pub crawls to sporting activites, cultural visits, day trips and games nights.\nYou can bring a friend to our events or come alone , our events will give you an opportunity to make new friends and have a ton of fun while you at it .\nHope to see you soon \\","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36332724","name":"London Board Games","link":"https://www.meetup.com/london-board-games","description":"Welcome to London Board Games\n\nThe purpose of this group could not be easier... To help bring people together to play board games across London.\n\nThe main difference between this Meetup and some others is that you are very much encouraged to come with your own suggestions for venues, dates and times for game sessions. This Meetup will then allow you to host and organise it. If you'd like to host an event, simply write that in the discussion and you will be made an event organiser.\n\nThere are no rules on which games you can or cannot play. This is simply up to the group to decide, perhaps in advance by making the event a game-specific event, or by mutual agreement.\n\nPlease do join and let's start organising more board game sessions all across London!\n\nFor example, perhaps you have a local gaming cafe but no-one to play with, then simply post a date and time and a limit of how many players the game(s) you want to play suits and see if anyone signs up. The more we do that, the bigger this group will grow.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"21075569","name":"Marianna's Events : London Nightlife Social 20s, 30s, 40s","link":"https://www.meetup.com/mariannas-events-london-nightlife-social-20s-30s-40s","description":"<p>We are inviting you to join Marianna's events in London! Having an extended experience of organising events, we started organising events on 2010, we are promising to create fun social experiences to help you explore London nightlife and connect with people/ make new friends in a fun and relaxing way/ atmosphere. Events that we are planning to organise include, but are not limited to, social nights out, live music, cabaret, comedy, games nights (ping pong, beer pong, card and board games), clubbing and business networking events. Our events are hosted by friendly hosts, which are there to welcome you, and make introductions, so there is nothing to worry about coming alone, most of the people come alone to meet new people. Of course friends are always welcome. The more- the merrier! Our social adventures are mainly targeting people in their 20s, 30s and 40s. We hope to see you soon, in one of our events!&nbsp;</p>\n<p>For more events feel free to join our facebook group:&nbsp;<a href=\"https://www.facebook.com/groups/453202104877514/\">https://www.facebook.com/groups/453202104877514/</a></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18395841","name":"London RPG Community","link":"https://www.meetup.com/londonrpgcommunity","description":"<p><span>We are amazing adventurers, brave bards, dungeon delvers, rotten rebels, and smouldering scoundrels. We are a group of roleplayers who meet weekly to play tabletop RPGs. Whether it’s high fantasy Dungeons &amp; Dragons, or science fiction Star Wars, or Coriolis, or perhaps contemporary horror such as Call of Cthulhu, we like playing RPGs!</span></p>\n<p>🗺 We have an open [D&amp;D 5e] campaign that anyone can join. It’s unique setting uses principles of a West Marches campaign, and story arcs similar to television seasons. Enjoy playing a long-form campaign without the regular schedule commitments! You can join a game directly through Meetup, though you’ll have a better chance of reserving a space by signing up to the campaign forum.</p>\n<p>📖 Check out our ‘Player’s guide to the Kantas Expanse’</p>\n<p><a href=\"https://www.gmbinder.com/share/-Ldsqp8yIayVUy0q9glm\">https://link.london-rpg.com/kantasplayerguide</a></p>\n<p>🔦 We also have seasonal RPG highlights, [Systems Check], which are organised on our Discord: highlighting games and genres through a series of one shot adventures such as Call of Cthulhu, or sci-fi games like Coriolis, Nibiru, DCC/MCC, Tales From The Loop, and Star Wars.</p>\n<p>Are you interested in setting up your own campaign? We have opportunities for you! Message any of the event organisers and we’ll see what we can do to accommodate your campaign and find you some players.</p>\n<p>London RPG Community’s Code of Conduct</p>\n<p><a href=\"https://drive.google.com/drive/folders/1KiM31md6SnSiU9DIqtRagimpwvPd_GgI\">Code of Conduct</a></p>\n<p>Find us on…</p>\n<p>🐦Twitter <a href=\"https://twitter.com/RPGCommunityLDN\" class=\"linkified\">https://twitter.com/RPGCommunityLDN</a></p>\n<p>👤Facebook <a href=\"https://www.facebook.com/RPGCommunityLDN\" class=\"linkified\">https://www.facebook.com/RPGCommunityLDN</a></p>\n<p>📸Instagram <a href=\"https://www.instagram.com/rpgcommunityldn\" class=\"linkified\">https://www.instagram.com/rpgcommunityldn</a></p>\n<br>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"34654603","name":"Get Gaming Online","link":"https://www.meetup.com/get-gaming-online","description":"A group for some friendly online gaming like Werewolf on zoom, quizzes or Among Us.  \n\nThis group has spun out of a few of book clubs who've been playing Werewolf online during lockdown to try stay sane. We'll start with Werewolf but will look at other games we can play online. \nWe may do some quizzes and video games like Among Us are also likely candidates.  We're open to ideas!\nThe main rule we have is be excellent to each other (insert air guitar).  This group is all about having a bit of fun while we're restricted in what we can do so being friendly and welcoming is of paramount importance!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"3490342","name":"Playtest UK Games Meetup Group","link":"https://www.meetup.com/playtest","description":"We are a friendly group of board/card game designers and playtesters set up in London in 2009. We meet to play games and each other's design prototypes.\nEveryone is welcome to join us and bring along their own designs or settle down to play and give their opinion. Ever designed a game and wanted to see how it plays? Enjoy playing games and being creative? Do you know what makes a game fun? Don't leave your game ideas sitting on the shelf gathering dust; show them off at the next Playtest meetup and get feedback direct from the players. We look forward to welcoming you at the next meetup!\nWe have regular playtesting meetups across the country in London, Cambridge, Newcastle, Brighton, Cardiff, Leeds, Enfield, Bath, Norwich, Edinburgh, Sheffield, Birmingham, Bristol, Cornwall, Oxford, Dundee, Oxford, Southampton and SE London.\nWe host public playtesting at UK Games Expo, Dragonmeet, Essen, London Toy Fair and a few other events during the year. We also run game jams and designer/publisher speed dating events throughout the year.\n\nPlease see our listings for details of dates and times. There is a monthly group newsletter.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35465601","name":"London Magic The Gathering Meetup Group","link":"https://www.meetup.com/london-magic-the-gathering-meetup-group","description":"Hi everyone!\nThis meetup group is for meeting up in person and playing the Magic the gathering table-top card game. Attendance is free, no fee is required.\n\nIt will run every Monday from 7pm till 10pm roughly.\nWe alternate between constructed play (commander, modern, standard) one Monday and then Draft the following Monday.\n\nExperienced players and newcomers to the game are both welcome.\nOur group currently is a very friendly, welcoming group, with more experienced players offering support and guidance to those with less experience.\n\nDecks will be provided during the session to play with for anyone who doesn't own one.\n\nThe atmosphere will be casual and fun, and a friendly attitude towards other players is all that we ask for.\n\nI'm a casual player and started playing FNM events in my teenage years but have only just recently got back into the game.\nWe look forward to seeing you at a future event!\n\nKind regards,\nJames","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"18326262","name":"The Library Pot - London Games Club","link":"https://www.meetup.com/gamescafe","description":"<p>Have fun with games - face to face. We meet at The Library Pot for food and games, there is usually a £5 cover charge which allows you to play games until the end of a session, and a minimum spend of £10 on food and drink.</p><p>The minimum age for all our events is 18 years old.</p><p>You can meet up with like-minded people to play all sorts of games:</p><p>newer games such as Settlers of Catan, Carcassonne, Mysterium, Dixit, Avalon, Kamisado;</p><p>ancient strategy board games like Go! / iGo, Mahjong, Yahtzee, chess (Shogi Japanese chess, XianChi Chinese chess and even 3-player chess), backgammon and ludo;</p><p>traditional board games such as Monopoly (with discussion about rule variations) and Scrabble are still very popular;</p><p>louder board games like Cards Against Humanity (17 years age minimum), Trivial Pursuit (various editions), Pictionary, Operation and Jenga; and</p><p>less well known board games such as Keyword, Scoop! and Portobello Market.</p><p>You can even bring along your own games. There will always be a pack (or two) of cards handy for Canasta or even Snap! Join up and let us know which games you prefer and RSVP for events that take your fancy.</p><p>Games sessions at The Library Pot:</p><p>Friday noon till 5pm; 6pm to 11pm; Saturday noon to 5pm and 6pm to 11pm; Sunday noon to 4.30pm and 5pm to 9:30pm.</p>","city":"Richmond","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"13978002","name":"The Dolly Mixtures - Medway Kent","link":"https://www.meetup.com/the-dolly-mixtures-from-medway-kent","description":"<p><em>Please note</em>: &lt;br&gt;</p><p>Please provide a full photo - when requesting to join the group. This is a ladies only group.</p><p>New members wanting to join The Dolly Mixtures, please be aware that some commitment is required - as I only hold occasional meetups within the month and they are mostly all held at a <em>Fixed Venu</em>e; within the Medway area. It is especially important that members try and come along and give the Dolly Mixtures a go, The group is a made up of very friendly and welcoming ladies; all waiting to meet you!!</p><p>The Group is aimed for ladies ages 40 and upwards, I am reaching out to members who preferably live in the Medway area- ie: Strood/Rochester/Higham or any surrounding Medway Towns- but I do have members that come from Gravesend/Dartford/Sittingbourne and sometimes a little further afield so if you are willing to commute the distance, then I have no problem with you joining the Dolly Mixtures. &lt;br&gt;</p><p>My main purpose is to bring together \"<em>like minded individuals</em>\" from a variety of backgrounds and cultures- to \"<em>form friendships be supportive of each other </em>\" and \"<em>have a laugh</em>\" and this year we are starting to get fit together! &lt;br&gt;</p><p>As my group is a small setting, I only have limited places for members at each meet-up so my intention is to take on members who \"are genuine and actively want to particpate with the Dolly Mixtures Group\" if you are an individual who is finding it hard to make friends through work or hobbies, or maybe you are on the \"quieter side\" then this group might be for you, who knows what new friends you might make! &lt;br&gt;</p><p>Meetups will include: &lt;br&gt;</p><p><strong>•</strong> Having a drink together, and optional food is available; having a chat and a laugh along the way!</p><p>• Occasional \"Sunday Roasts\" will try and coincide those with farmers market days</p><p>• Coffee shop catch ups mid week and some weekends</p><p>• Card games including\"Uno\" and \"Chase the Queen\" &lt;br&gt;</p><p>• Occasional day trips, cinema and walks</p><p>• Gym and swimming. &lt;br&gt;</p><p>&lt;br&gt;</p><p>'Remember their are no strangers just friends whom have never met'</p><p>&lt;br&gt;</p><p>&lt;br&gt;</p><p><strong>*** Please note: I now charge an annual £6 non refundable membership fee and this will be payable on the first meet up or via bank transfer - starting from April each year. This cost covers my expenses, and re-coups my costs of running and arranging meetups every month. </strong></p><p><br /></p><p><strong>What I ask from my members - note: this is a small group so any non attendance obviously impacts on the group greater, please therefore consider this before responding as spaces are limited and if you can no longer attend please let us know as soon as possible so the space can be filled by another. If you find you have failed to attend I would expect an explanation for this for the event leader.  Please note that 3 non attendances can constitute removal from the group and  this is at the discretion of the event leader and myself  Note that guests are welcome at some events if there is space available. Do doublecheck that you can bring a guest to avoid disappointment as of course members take priority. </strong></p><p><strong>Also to note, we have become a very jolly, harmonious,close, kind group and we welcome wholeheartedly new friends to join us so don't worry we were all new girls once, hope to see you soon ***</strong></p><p>&lt;br&gt;</p><p>&lt;br&gt; &lt;br&gt;</p>","city":"Rochester","state":"G5","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"19588716","name":"Greenwich & Blackheath Board Games and Beer Club","link":"https://www.meetup.com/greenwich-blackheath-gaming","description":"<p>A group for gamers living and working around the South-East London area. We host a number of weekly events across each month at The Bugle Horn, 6 The Village, Greenwich, London SE7 8UG.</p><p><br /></p><p>Weekday Evening Gaming @ The Bugle Horn - alternating Tuesday/Wednesday evenings (19:00 – 22:30).</p><p><br /></p><p>Saturday Afternoon Gaming @ Hustlers Sports bar (Woolwich) - final Saturday in the month (13:00 – 23:30). Sunday Afternoon Gaming @ Meantime Brewery (Greenwich) - 2 weekends after each Saturday event. These Meetups gives us a chance to meet &amp; play games across an extended period, and perhaps bring out some of the more in-depth titles that may not be suited to a weekday evening.</p><p><br /></p><p>-----</p><p><br /></p><p>So what games do we tend to play? As a group, we have a vast array of board &amp; card games. These are kindly brought along by our group members to each of our organised events. People are free to pick and choose what they prefer to play on the night or talk in advance via the message board.</p><p><br /></p><p>Our scope is quite varied in that we play, anything from the 'lighter' games/classics like 'Ticket to Ride', 'Carcassonne', 'Settlers of Catan', 'Dominion'; on to the 'heavier' end of the spectrum such as 'Battlestar Galactica', 'Dead of Winter', 'Viticulture', 'Orléans'... To fill the time, we also like to crack open a few lighter/party games such as 'Codenames', 'Love Letter', 'Sushi Go!' to name but a few.</p><p><br /></p><p>We are a friendly bunch, who recognise that with any growing hobby, there are plenty of people out there that want to take part, and are of differing levels of experience. Why not sign up and drop by to one, or as many evenings as you can attend.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"5639712","name":"West London Tabletop Gaming and Good Food.","link":"https://www.meetup.com/west-london-tabletop","description":"<p>Welcome to Tabletop Gaming!</p> \n<p>Here you can indulge in good food and board games of all sorts and also make new friends.</p> \n<p>RSVP and come to our events! Please let others know what time you plan on arriving and what games you are going to bring if any. You are welcome to bring your own games but not food and drink.</p> \n<p>For meetups at the games club, The Library Pot, there is usually a £5 fee or £10 minimum spend per person per session, unless stated otherwise on the event. Check each event to see what is going on. There is a minimum age of 8 and all children must be accompanied by a responsible adult.</p> \n<p>There are over 700 games at The Library Pot and a large menu of food and drink where almost every item on it has been requested by our meetup members. There are vegetarian, vegan and gluten free dishes available.</p> \n<p>The meetups at the pub are held on Saturdays and they are usually free to get in but we need to bring our own games to play. Please buy something at the pub venue we rely on the pubs’ good will to secure spaces for free and in return they hope to make some money from our custom at the bar.</p> \n<p>It is worth mentioning please be nice to each other and look after the games. Remember to be welcoming when players turn up. If you are in the middle of the game invite them to sit next to you and watch while they are waiting for a new game to start. Be inclusive and polite.</p> \n<p>It's in West London.</p> \n<p>It's about all your table-top gaming.</p> \n<p>It's an inclusive, friendly group.</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36245641","name":"Immersive Tabletop Games in London with Alchemy Gaming Café!","link":"https://www.meetup.com/tabletop-gaming-london-by-alchemy-gaming-cafe","description":"Alchemy is looking to become London's first immersive gaming cafe, and the premier destination for tabletop gaming in the capital! Here on Meetup, you can find updates on all our future events and happenings... \n\nWe're still currently setting up the cafe, but will be running pop-ups throughout the year- with a focus on Tabletop Roleplaying, Wargaming, as well as classic Board and Card Games. \n\n*We'd love to use these events to meet as many of you as possible, sling some dice together, and to share our vision! 🖤*","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"17638522","name":"Reading Board Gamers","link":"https://www.meetup.com/reading-board-gamers","description":"<p><b>Reading Board Gamers</b> (this meetup group) is an umbrella group run for the benefit of the Reading board gaming community as a whole, bringing together the events organised by the board gaming groups in the area in one place.</p>\n<p><span>I formed The Reading Boardgames Social over 6 years ago now, and all of the group's events will be listed here - Just watch out for any events labelled \"RBGS presents...\" - as well as on our dedicated Facebook group (<a href=\"https://www.facebook.com/groups/Boardgamessocial/\">https://www.facebook.com/groups/Boardgamessocial/</a>).<br> <br>If you have a group and wish to promote your events here, or if you are interested in becoming involved in the RBGS as an organiser, event host or in any other capacity then drop me a line.</span> <br></p>\n<blockquote> \n <p>The RBGS is a relaxed and social group. No previous experience is necessary and you don't need to own any board games as there are always plenty brought along. Just come along to one of the events and join in with the fun. <br> <br>If you have any questions about any of the events, please post in the event or message the named host.</p> \n</blockquote>\n<p>Any questions about the overall group are probably best directed at me. <br> <br>We have also set up a board game trading group for any gamers in the Reading area&nbsp;<a href=\"https://www.facebook.com/groups/ReadingBoardGames.Buyandsell/\">https://www.facebook.com/groups/ReadingBoardGames.Buyandsell/</a><br>All are welcome, so please join and spread the word.<br><br>Hope to meet you over a boardgame soon... <br>Happy gaming : )</p>\n<p>Daryl</p>\n<p> <br> </p>","city":"Reading","state":"03","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34082060","name":"Bracknell and Maidenhead Board Gaming","link":"https://www.meetup.com/bracknell-and-maidenhead-board-gaming","description":"<p>Hi, and welcome to Bracknell and Maidenhead Board Games!&nbsp;</p>\n<p><br>This group has been founded by a group of avid board gamers who started playing together in Maidenhead until people started to drift off into the wilds of Bracknell and the deeper depths of Berkshire.</p>\n<p><br>We mainly play tabletop games for 3-6 players, but card games and other types and player counts are welcome to add some variety. This group has been founded to easily organise sessions for serious board gamers, not so much the more casual and lighter social side.<br></p>\n<p><span>Most of us are members other groups in the area, but wanted to use this group to organise some sessions for smaller numbers of people who want to play some of the longer and more strategic games.&nbsp;</span><br></p>\n<p>If you don't know your dice tower from your deck builder yet we suggest you try out a more casual gaming group and then if something like this is for you!</p>","city":"Bracknell","state":"03","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"122955","name":"London Poker Meetup","link":"https://www.meetup.com/londonpokermeetup","description":"<p>\"Playing bad cards out of position since 2003...\"</p>\n<p>* Looking for a home poker game in London? &lt;br&gt; * Having problems filling your own home game? &lt;br&gt; * New to the game and looking to learn the ropes? &lt;br&gt; * Play online and looking to sit down and play LIVE poker?</p>\n<p>London Poker Meetup (LPM) is the largest poker group on Meetup, Worldwide. We’re a friendly, welcoming group of poker enthusiasts and amateur players based in and around London who meet up regularly to discuss poker, arrange friendly home poker games and play small stakes tournaments in pubs, clubs, public cardrooms and (occasionally) casinos. We also neck a few frosty ones together from time to time, play online poker together (badly) at a variety of sites and badmouth each other on the LPM forum.</p>\n<p>We play ALL sorts of games, from Texas Holdem to PLO, Omaha 8 to Razz, H.O.R.S.E., Triple Draw, Irish, Stud, Badugi, Courcheval - you name it we play it, so if you've ever wanted to learn OTHER games (as well as Holdem) and learn them cheaply then London Poker Meetup is the place!</p>\n<p>With weekly games to suit all comfort and experience levels and buyins ranging from £5 - £50 there should be something to suit everyone. Join us (it's free!) and find out why we're the friendliest people to play poker with in London!</p>\n<p><br></p>\n<p>Facebook:&nbsp;<a href=\"https://www.facebook.com/groups/londonpokermeetup/\">https://www.facebook.com/groups/londonpokermeetup/</a></p>\n<p>Twitter: @meetuppoker</p>\n<p>Instagram:&nbsp;@londonpokermeetup</p>\n<p>Phone: + 44 7973 333 555&nbsp;</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18583880","name":"Sapphire Backgammon Fortnightly Meetup in London","link":"https://www.meetup.com/sapphire-backgammon-in-london","description":"<p>Sapphire Backgammon Reviews&nbsp;<em>\"backgammon for all levels - many good players, and those with patience and willing to show new players how to play.\"</em></p><p><em>\" the greatest company that one can wish for. A handful of us remained at the Club til nearly 11pm!\"</em></p><p>\"what a lovely group and welcoming host...\"</p><p>\"thanks Chris.&nbsp;had a good time with you and other players.&nbsp;The grub [food] at VQ was delicious.&nbsp;See ya next time\"</p><p><em>\"Once upon a time, we sat across the table from our opponent with a real backgammon board and real dice sitting between us to play with. Fun and laughter followed along with the scrambling and spinning of dice with the occasional grumble of how lucky your opponent was at throwing their lucky dice rolls.&nbsp;&nbsp;Nowadays, people don't always find the time to play face to face and the unfortunate result is playing backgammon online in from of a screen and questioning whether the dice rolls are rigged or not.&nbsp;Sapphire Backgammon changes this, so why not come along to a warm and welcoming environment and play real people?\"</em> Chris S.</p><p><br /></p><p>Hello,</p><p><strong><em>Meetup fortnightly on Sundays at 3pm</em></strong></p><p>A very warm welcome to Backgammon Lovers and those inspiring to learn and improve their game in a social and friendly environment.</p><p><br /></p><p>Hope that our members are all keeping safe during these difficult times.</p><p>.&nbsp;&nbsp;&nbsp;</p><p>Sapphire Backgammon Social Group is six years old - we held our first Meetup in June 2015 and we are coming up to our 150th Meetup. Our membership is fast approaching 750 and rising. Given the current Covid climate, on average between 8 and 12 members attend our fortnightly meetups and our largest turnout ever was a busy and fun 29 backgammon lovers turning up to one of our events.</p><p>This is an established and friendly group for backgammon players of all standards - from beginners to champions, it really doesn't matter what level you are or how competitive or not that you choose to be - we have quite a selection of players, both men and women, from diverse backgrounds from across the globe. My aim is to have a laid back sociable afternoon that drifts into the evening with people who want to play backgammon in a friendly and welcoming environment.&nbsp;We sometimes have fun tournaments with small prizes for those with a slight competitive edge. Through this group some of us have learnt to play with the doubling cube - that mysterious cube-like object with 2,4,8 etc that sits on the side of some boards. We have recently returned to the Civil Service Club after a nearly four year break, but might try out other venues nearby.</p><p><em>Please bring your own&nbsp;backgammon board</em>, however, both I and others should have our own, and I do sometimes carry a spare or two -&nbsp;we simply need one board between two players.&nbsp;We are always delighted to play on different boards that are different in size, style, feel and price and to meet the players behind their boards.</p><p>I will ask for a 2 or £3 contribution that helps me pay Meetup (yes Meetup sadly isn't free for Organisers and I pay a handsome six-monthly subscription fee of around a hundred pounds, including during lockdown when no events were held) and this covers other admin costs.&nbsp;</p><p>We look forward to meeting and playing this enjoyable game with you soon.</p><p>Kind Regards,</p><p>Christopher&nbsp;:-)</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18933826","name":"Dragons Keep Roleplay Club","link":"https://www.meetup.com/dragons-keep","description":"<p>This is a gaming group based in South East London for people with a love for RPG's, board games and all tabletop gaming. We are within easy reach of Bexley, Bromley, Dartford, Greenwich and Lewisham.</p> \n<p>&lt;br&gt; Meeting weekly every Friday with a friendly group of gamers to take part in role playing games and campaigns. We love all different systems whether it be fantasy (Dungeons &amp; Dragons, Pathfinder, Castles &amp; Crusades), horror (Call of Cthulhu, World of Darkness) sci-fi (Alternity, Judge Dredd) or a homegrown game.</p> \n<p>&lt;br&gt; We'll play just about anything as long as it’s fun. Come along and join in!</p> \n<p>&lt;br&gt; Click <a href=\"https://www.dragonskeep.co.uk/games\">HERE</a> for a current list of our games running. To join, please visit <a href=\"https://www.dragonskeep.co.uk/join-us\">HERE</a></p> \n<p>.</p> \n<p>&lt;br&gt;</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"29797501","name":"Friday Night Smites","link":"https://www.meetup.com/fridaynightsmites","description":"We run weekly tabletop RPGs, including a campaign every two weeks. You can join in as we play games online via discord and Roll20, the current campaign is TITAN BONES, a 5e campaign set in a world where enormous creatures have been terrorising the mortal races! Until recently...\nGames are once a week but I'm always looking for new GMs to run their own games, let me know and I can organise sessions for you to run.\nThat's all and happy gaming!\n\\- Tim","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35749789","name":"North London Boardgames","link":"https://www.meetup.com/north-london-boardgames","description":"Let's get together and play boardgames around North London! We meet at the Rogue's Quarter dedicated board games café. This is a social group with social events. The idea is to meet new people and play games. A bit of competition is welcomed, antisocial or offensive behaviour is not. We play casual, social (a la Secret Hitler) and sometimes more technically challenging ones. The venue has dozens and dozens of games. We usually play as one group rather than separate tables and are friendly and welcoming, we'll explain anything you need.","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"5913982","name":"Board2Death","link":"https://www.meetup.com/board2death","description":"<p><br /></p><p>We're a friendly gaming group in the Surrey/Hampshire Borders.&nbsp;We meet regularly to play games in the Aldershot, Ash, Guildford and Godalming area.</p><p>We love playing 'Modern Boardgames' and hanging out with nice people and having some fun.</p><p>If you're not familiar with the term 'Modern Boardgames' please take&nbsp;a look on <a href=\"http://www.boardgamegeek.com\" target=\"_blank\">BoardGameGeek</a>&nbsp;and see if it's something you're interested in.</p><p>We play games for all tastes and interests, so if you have a game you think we'd like,&nbsp;let the group know what it is, and we can get it onto a table somewhere and play it!</p><p>Find us online:</p><p><a href=\"http://www.board2death.uk\" target=\"_blank\">http://www.board2death.uk</a></p><p><a href=\"https://www.facebook.com/Board2DeathUK/\" target=\"_blank\">https://www.facebook.com/Board2DeathUK/</a></p><p><a href=\"https://www.facebook.com/groups/board2deathUK/\" target=\"_blank\">https://www.facebook.com/groups/board2death...</a></p><p><a href=\"https://www.boardgamegeek.com/guild/1566\" target=\"_blank\">https://www.boardgamegeek.com/guild/1566</a></p>","city":"Aldershot","state":"F2","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36384560","name":"Shy Gaming Group","link":"https://www.meetup.com/shy-gaming-group","description":"This group is for shy gamers to chat and play some games.\nThe plan is to start with online get togethers and get to know other shy people but it is ok to stay quiet during the initial nervous start.\nOnline chat will be taking place on Discord and the games taking place on Board Game Arena (can sign up for free account). Starting with quick and easy games like Stella, Fake artist goes to New York, LLama, going to longer ones such as Parks, Lost ruins of Arnak and Tapestry.\nThere will be a small group size to make it easier for people who are shy or socially anxious, as large groups can be overwhelming or make it hard to speak up.\nThis meetup group will be a short run trial of a month so if your interested in talking to like minded shy people join up or ask any questions you may have.","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"252197","name":"The London Dungeons & Dragons Meetup Group","link":"https://www.meetup.com/london-dnd","description":"<p>D&amp;D and other role-playing games!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35705163","name":"Board Gaming Afternoons","link":"https://www.meetup.com/board-games-meetup-group","description":"If you like playing board games but you don't have or big table or extra player you are more than welcome for weekly board game meeting. We will meet every Sunday in Four Thieves near Clapham Junction station.\nI've created a WhatsApp group for better communication:\nhttps://chat.whatsapp.com/E6irXmKxkMq5gw98ZHRfu0","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35748215","name":"Poker At The Plough","link":"https://www.meetup.com/poker-at-the-plough","description":"<p>Friendly, low stakes, weekly poker games starting at 7 o’clock.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35639383","name":"Ludoquist  Meetups","link":"https://www.meetup.com/ludoquist-meetups","description":"<p>This group is to help arrange meetups for regular groups for specific games and special events at The Ludoquist in Croydon (South London - Croydon in Yorkshire is lovely too, but a looong journey for an evening game). If you are interested in general board game meetups, we recommend you join Croydon Board Gamers.</p><p>This group will be primarily for organising games such as Arkham Horror the Card Game, Marvel Champions, and Role-Playing Games.</p>","city":"Croydon","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36159333","name":"🎲 Gaymers @ The Board Room 🏳️‍🌈","link":"https://www.meetup.com/gaymers-at-the-boardroom","description":"A group for those who identify as gay men or LGBT+🌈 and also like to play board games , whether you're a beginner, have never played before or a well-seasoned expert , whatever your flavour is, all welcome.\n\nThis group is based in South London, please RSVP accordingly if you cannot make it for any reason , as often games require certain number of players to be played.\n\nA few things to keep in mind if you wish to join the group:\n\nPeople bringing their own games along is highly encouraged as long as they are willing to teach to anyone.\n\nPlease refrain yourself from bringing games such as Monopoly, Scrabble or the like as these are designed for a different crowd.\n\nBe considerate and careful when using game components, cards, melees etc , remember these are someone else's property and should be treated as such.\n\nAlso last but not least joining this group is free of charge and we will never ask for any payment or \"donation\" however you are encouraged to consider buying a drink or two or consume at the chosen venue for the event to support the space booked.\n\nThank you all, I hope to see your faces soon\nAlex","city":"Croydon","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"274386","name":"London On Board","link":"https://www.meetup.com/londononboard","description":"Welcome to London on Board!\n\nWe are a group of friendly and diverse modern board gaming enthusiasts that meet up several times a week in Central London. We enjoy a wide variety of board games that include euros, deck builders, dungeon crawlers, area control, cooperatives, 18xx, legacy and even dexterity and social games on occasion. There are a wide range of complexities and game lengths and it is common for us to play 2-3 hour games or even longer especially on weekends with shorter games in between.\nThere are some games that we don’t allow - please see our [rules page](https://www.londononboard.com/rules-regulations) for details.\n\nOur events are very much dependent on attendees bringing the games that they’d like to play and/or are happy to share with the group. It’s certainly not mandatory for you to bring games nor to allow others to use those that you do bring as we understand that it’s not always practical, but it would be wonderful if you can bring and teach games whenever possible.\n\nLondon is a beautiful city with many pubs and hotels with private spaces that are available for hire typically with minimum spends or a deposit. As we are passionate about keeping our club free to attend, we make mutually beneficial agreements with the venues. This provides us with a dedicated space and in return, we make it worth their while by being respectful and spending on food & drink. Without this symbiotic relationship, London on Board would not be possible so we would very much like to encourage attendees to remember to visit the bar regularly throughout the event. Under no circumstances should food or drink from outside be brought into the venue.\n\nLondon on Board is not-for-profit and organised by a small group of volunteers. When we have spare time, you will often find us looking for new venues, wrangling with the quirks of meetup.com and making improvements to the website!\n\n**Links**\nRules: [https://www.londononboard.com/rules-regulations](https://www.londononboard.com/rules-regulations)\nNewbie Guide: [https://www.londononboard.com/the-lob-newbie-guide](https://www.londononboard.com/the-lob-newbie-guide)\nWebsite: [https://www.londononboard.com/](https://www.londononboard.com/)\nBGG guild: [https://boardgamegeek.com/guild/586](https://boardgamegeek.com/guild/586)\n\n\n\n\n\n\n\nYour Organisers\nEsme, Felix & Rachel","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35910747","name":"West London Games Club","link":"https://www.meetup.com/westlondonboardgames","description":"www.westlondongamesclub.co.uk\nPlay Games - Make Friends - Create Memories\nBoard Games across West London.\nWe meet regularly at various venues across West and South West London.\nAll are welcome!","city":"Twickenham","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18734331","name":"The Golden Axe","link":"https://www.meetup.com/the-golden-axe","description":"<p><img src=\"https://secure.meetupstatic.com/photos/event/a/7/b/0/600_479982928.jpeg\"></p>\n<p><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; PLEASE READ THE FOLLOWING BEFORE SENDING A JOINING REQUEST!</b></p>\n<p> <br></p>\n<p>•&nbsp;<b>WHAT ARE WE?</b> We are a small Central London based war party (i.e. bunch of mates) of like minded individuals interested in tabletop gaming, entertainment and adventuring, looking to socialise and roll dice in pleasant company with good humour over casual conversation. Away from the burn of every day work/life. <br></p>\n<p>• <b>WHAT DO WE PLAY?</b> We play a vast eclectic assortment of card, miniatures and boardgames from casual ameritrash to deep thinking euros; Agricola to Zombicide, Avalon to Werewolf, Age Of Empires to Scythe etc. Alongside gaming we also participate in cinema, escape rooms, eating out, outdoor events &amp; activities. We're also known for play-testing new game mechanics and prototypes for gaming companies and independent designers. In fact, several of our members are in the gaming industry. <br></p>\n<p>•&nbsp;<b>WHAT ARE WE LOOKING FOR?</b> We are seeking other like minded adventurers who are reliable, sensible &amp; amicable and looking to join a social circle as well as a gaming group. Membership is free, there are no costs or joining fees. All we ask in return is for you to leave your 'troubles' at the doorstep and de-stress from a long days work over a boardgame without drama or maintenance. We all have our 'hang-ups', lets not bring it to the table, folks :) <br></p>\n<p>• <b>DO I NEED ANY BOARDGAMING EXPERIENCE?</b> Not at all. All we ask is for the ability to learn &amp; pick up new games esp advanced and modern games with the right attitude and respect to other members. We do not play simple commercial games such as Snakes &amp; Ladders, Monopoly, Cluedo etc. <br></p>\n<p>•&nbsp;<b>HOW DO I JOIN?</b> Please message an organiser or send us a joining request for a 2 month trial membership as we often play at private residences and not just public houses/locations. We will not take any offence if you find our group not suitable for you at the end of the trial as we understand not everyone will be suitable for our group. Please, do consider if you can actually attend before joining. <br></p>\n<p>• <b>ANY REGULAR LOCATIONS?</b> We have regular weekly public gaming venues in Central London as well as private residences around the local area. We find Central the best mutual common ground for members to travel in from as we live all over London. <br></p>\n<p>• <b>COOL, SOUNDS GOOD. ANYTHING ELSE I NEED TO KNOW?</b> We are a PRIVATE group of mates, not an open forum or a public service. As such we're aiming to remain small and retain the circle-of-friends atmosphere as opposed to a crowded sweaty room filled with bad mannered strangers arguing over dice rolls. All members must display a true, genuine photo of themselves on Meetup so we know who to expect and look for when they attend. Fake names/photos/profiles will be automatically dismissed. If you think we are for you then get in touch, we're always on the look out for the right individuals with the right attitude. The password to apply for a trial membership is 'DeathAdder'. <br></p>\n<p><b>If you would like to find out more, please scroll down.</b> <br></p>\n<p><b>**WARNING: TROUBLE MAKERS AND DRAMA SEEKERS WILL BE EXPELLED AND BANNED. DO NOT APPLY IF THIS IS YOU</b><b>. POOR BEHAVIOUR AND INAPPROPRIATENESS WILL NOT BE TOLERATED. THERE ARE PLENTY OF OTHER MEETUPS FOR THAT. WE ARE NOT A SUPPORT GROUP FOR YOUR PERSONAL ISSUES &amp; MACHINATIONS**</b></p>\n<p><img src=\"https://secure.meetupstatic.com/photos/event/7/1/4/2/600_448888994.jpeg\"></p>\n<p><b> Additional Info (you don't need to read any further, but if you insist :)</b><b> <br> <br>• WHAT ARE THE EVENTS LIKE?</b> Being a private members group everyone knows each other and it is a very warm fun atmosphere in an enjoyable safe environment. It is more like a social circle of friends sharing similar interests, humour and hobbies than a random gaming club where you don't know the person you're rolling dice with. Something to bear in mind if you are interested in our group :)<b> <br> <br>• WHY ARE YOUR EVENT LOCATIONS AND MEMBERS HIDDEN?</b> We often host events at our own homes. Would you want the world to know where you live?<b> <br> <br>• SECURITY IS IMPORTANT, HEY?</b> Absolutely. We have had disruptive members in the past (you know who you are) and would like to avoid these types of trouble makers in the future. As a meetup group we function more like a collective of friends so if you're manipulative, ill/short tempered or inappropriate then you may want to reconsider. <b> <br> <br>• WHO CAN JOIN?</b> We have a very diverse demographic ranging from age, gender, profession and ethnicity. We do attract a lot of females, professionals and academics due to our safeguarded environment and security attitudes, but absolutely anyone can register interest so long as you are of the right persuasion and character. Please message an organiser if you have any further questions.<b> <br></b></p>\n<p><img src=\"https://secure.meetupstatic.com/photos/event/7/1/5/7/600_448889015.jpeg\"></p>\n<p><b> <br></b></p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36323547","name":"Uxbridge Dungeons and Dragons Meetup Group","link":"https://www.meetup.com/meetup-group-ndteewir","description":"Your friendly neighbourhood adventurers are looking for new members. If you've played d&d before, or if you are completely new to the game, we have a spot for you.\n\nWeekly games, a fun and welcoming atmosphere, and plenty of dice. We play every Wednesday at the Malt Shovel, Iver Lane, Cowley, UB8 2JE.\n\nCome along and roll initiative.","city":"Uxbridge","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36113271","name":"Games Night at the Drill (Dungeons and dragons)","link":"https://www.meetup.com/dnd-drill","description":"We are a small group of like-minded nerds who meet up weekly at the Drill pub. Our main (dungeons and dragons) event happens every two weeks where we share a huge group storytelling experience set in the town of pridewharf. Quests, adventures and... Pesto? You'll have to come visit to see what it is all about!\n\nOn our \"off-weeks\" we welcome anyone and everyone to come on down for any sort of hobbies you like to share or do with some company. We often host board games, more TTRPGs and currently looking into getting a switch set up! You name it and we'll arrange it","city":"Romford","state":"E4","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36403348","name":"Lionsheart Events Club Woking","link":"https://www.meetup.com/woking-strategy-board-games-meetup-group","description":"Here at Lionsheart Bookshop, we are all about having an amazing community where people can meet up, play all sorts of Board Games, Magic the Gathering, Pokémon, and Warhammer!\n\nWe accept players of all ages and all skill level. Never played a board game? Now is a perfect time to start! Pokémon World Champion? Come teach us a few tricks! If you are looking for a fun group of people to play some games with, something we've all been missing the last couple years, then come down to Lionsheart and make some new friends!","city":"Woking","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35818614","name":"Brighton & Hove BoardGAYmers","link":"https://www.meetup.com/brighton-hove-boardgaymers","description":"<p>A new and friendly social group for Brighton and Hove gay folks to get together and play board games and card games. No experience necessary - there will be games to suit all levels of experience. Aiming for a regular monthly meeting beginning in October 2021.</p>","city":"Brighton","state":"P6","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36405490","name":"Fun Free Games Night","link":"https://www.meetup.com/fun-free-games-night","description":"Come along to Hoogly’s board games evening, starts at 6pm Wednesday 29th June. Free to attend and there will be a bar and kitchen open for food and drinks. \nGreat place to meet others and enjoy some games. Will be held once a month. \n\n11 South Road, by Preston Park, BN1 6SB\nwww.hooglytealodge.com","city":"Brighton","state":"P6","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"30342387","name":"London Card Games Meetup","link":"https://www.meetup.com/meetup-group-lxabveuo","description":"<p>This is a group for people who enjoy playing cards, or would like to learn some fascinating card games. Perhaps you have one or two favourite games and are looking to find a friendly and sociable group of people to play them with. Maybe you have often been interested in learning cards but have been put off by the need to learn rules or find someone patient enough to explain them. Or perhaps you were introduced to some simple card games as a child or play Solitaire on your phone and would like to find out how much fun it can be to learn a card game from which you need to be dragged screaming and kicking from the table at the end of the evening because it is so compelling! You may even be a poker player but want to branch out into something more interesting and less ruinous to the bank balance! <br>We play a range of different games from around the world, with a particualar focus on some of the most interesting strategic games from Germany, Austria and Switzerland, such as Skat, Doppelkopf, Koenigrufen and other tarot games, Jass, etc. However, we are also open to any friendly people who just want to come along and play their favourite card game (canasta, cribbage, euchre, hearts, spades, etc) or introduce others to a new game. The only constraints are that we do not play any form of poker, for which there are other meetup groups available, and we limit ourselves to traditional games which do not require a proprietary pack of cards. There are loads of meetup groups in London where you can play those types of game, but very few where one can play traditional card games. <br>Right, whose deal is it?</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35684180","name":"Balham Board Games Group","link":"https://www.meetup.com/balham-board-games-group","description":"Hello budding board gamers… we are a group of people who love to meet up and play board games. We normally play a wide range of games from European strategy games like Carcasonne, Ticket to Ride, Agricola, etc, to the very light fun games like 6 Nimmit, Pictomania, etc. as the evening moves along and the beer kicks in. Don’t worry if you’re new to the games - we are great explainers!\n\nWe meet weekly at the Bedford Public House, (upstairs in the Cocktail bar). We aim to start at 6pm, but this isn't hard and fast and go on until about 10, or just whenever you feel you've scratched your gaming itch!\n\nEverybody is welcomed and if you ask for Rocky or Henry, we'll make sure you can get into a game that suits you and your gaming level.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"11304432","name":"Guildford Gamers","link":"https://www.meetup.com/guildford-gamers","description":"**If \"boardgames\" to you means Monopoly, Trivial Pursuit and Cluedo...** then come and join us for the next step into the world of boardgames. Modern, 'euro style' games are of very high quality, can usually be learnt quickly and generally last for 90mins to 2 hours. What's more, they usually involve everyone all of the time, so you're not sitting around waiting for someone else to take their turn and you won't be 'knocked out' after the first half hour. All in all, they are much more fun and much more accessible than Monopoly and its more traditional counterparts!\nAlthough we sometimes play the heavier/more complicated games, we love to welcome new members and players. If you’re a relative newcomer to the boardgaming hobby, get in touch and we can make arrangements for a table to introduce you to the wonderful world of games beyond the traditional “roll the dice and move along the board” examples. Drop us a note outlining what you’ve played before (if anything) and we’ll make sure you have a good time. Some great introductory games include Settlers of Catan, Carcassonne, Ticket to Ride – if you’ve never played these you’re in for a treat, or if you have, come and try something else.\n**If \"boardgames\" to you means Puerto Rico, Power Grid, Agricola and others...** you'll already be aware of the sorts of things we play!\n**Where and when:** We meet on Tuesday evenings at 6.30pm at the [Guildford Institute](http://www.guildford-institute.org.uk/). We have to pay for the room hire, though the space, tables, and lighting are excellent (much better than a typical pub). The Institute does serve some drinks and snacks, but not meals, so if you need dinner you have to arrange that separately before or after gaming.\nAlthough we try to start promptly (which means we can fit in the longer games that other clubs can’t!), please let us know if you’re going to be late (after 7pm) and we’ll try and schedule games accordingly – we generally manage a couple of games each week (per table) so we should be able to time it to maximise everyone’s playing time.\nWe also play 10am to 6pm one Saturday each month (check event listings - usually the second Saturday).\n**Fees**: The Guildford Gamers pay the Institute for the use of a room, so we make a modest charge for attending our sessions. The fee is £5 per person per session. Joining the club involves committing to regular monthly payments instead (currently £10, or £5 for weekend-only membership), and entitles the member to a vote on matters affecting the club.\nUnder-18s may attend for free. Students aged 18 or over in full time education with valid ID, and Seniors Citizens over 60, are entitled to a 50% discount.\nThe club is non-profit and fees are used solely to hire the venue and sundry costs (mainly Meetup fees).\n**More Information:** We have a [Guild page](https://www.boardgamegeek.com/guild/294) on BoardGameGeek - the site for all boardgamers! BGG contains lots of information about all the games we play - and many more! \nWe look forward to seeing you :-)","city":"Guildford","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"13102662","name":"London RPG Posse","link":"https://www.meetup.com/london-rpg-posse","description":"We play roleplaying games like Dungeons and Dragons.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18461362","name":"London 'Werewolf' Group","link":"https://www.meetup.com/londonwherewolf","description":"<p>This is a group for people who want to play the social game Werewolf.</p><p><br /></p><p>In Werewolf your village has a few dark characters on the prowl. During the Night the village is attacked by werewolves &amp; numbers start dwindling. It is up to the village to burn the culprits in the hope of ceasing the attacks. But who do you burn? Who do you trust?</p><p><br /></p><p>You will be assigned a role in secret as either a member of the Village or of the Shadow faction. It will be up to you to convince the other villagers that you are on their side &amp; should not be burnt at the stake!</p><p><br /></p><p>If you've never played before don't worry! There are always new players &amp; we'll welcome you with open paws &amp; pitchforks. The plan is to get together every so often (seeing as we're starting out) &amp; have some fun.</p><p><br /></p><p>Game Introduction:&nbsp;<a href=\"https://drive.google.com/open?id=1fbVc_xovpp9op8W779JTMX2Qn9ZVsmDL\" target=\"_blank\">https://drive.google.com/open?id=1fbVc_xovpp9op8W779JTMX2Qn9ZVsmDL</a></p><p><br /></p><p>Basic Roles:&nbsp;<a href=\"https://drive.google.com/open?id=1dieyoMYtcfO1NGc_dokUn3IkfBF1d_-k\" target=\"_blank\">https://drive.google.com/open?id=1dieyoMYtcfO1NGc_dokUn3IkfBF1d_-k</a></p><p><br /></p><p>Darkest Night Roles:&nbsp;<a href=\"https://drive.google.com/open?id=1HMHAD1fsQ0d_DUCOfoKMar5OUJHwnVSy\" target=\"_blank\">https://drive.google.com/open?id=1HMHAD1fsQ0d_DUCOfoKMar5OUJHwnVSy</a></p><p><br /></p><p>Rules (short):&nbsp;<a href=\"https://drive.google.com/open?id=1NpboGvYwIxHHjncxkfWWqZKQbXMVLpLL\" target=\"_blank\">https://drive.google.com/open?id=1NpboGvYwIxHHjncxkfWWqZKQbXMVLpLL</a></p><p><br /></p><p>Rules (detailed):&nbsp;<a href=\"https://drive.google.com/open?id=1W1YeYZpdSYTqytyAQU0YiWTwnXB_rdGF\" target=\"_blank\">https://drive.google.com/open?id=1W1YeYZpdSYTqytyAQU0YiWTwnXB_rdGF</a></p><p><br /></p><p>Participation guidelines:&nbsp;<a href=\"https://www.meetup.com/LondonWherewolf/pages/22020470/London_Wherewolf_Meetup_Participation_Guidelines/\" target=\"_blank\">https://www.meetup.com/LondonWherewolf/pages/22020470/London_Wherewolf_Meetup_Participation_Guidelines/</a></p><p>Moderator Best Practices:&nbsp;<a href=\"https://drive.google.com/open?id=1kycVAdqeWgyA-Qjz_kHYFFYKjKl1u3g6\" target=\"_blank\">https://drive.google.com/open?id=1kycVAdqeWgyA-Qjz_kHYFFYKjKl1u3g6</a></p><p><br /></p><p><br /></p><p>Separate from game rules <span> please be aware - personal attacks in the game, online cheating (messaging info from the dead and privately communicating info to people in the game), shouting at other players and moderator and harrassment of players and moderators will not be tolerated and this will result in you being removed from the zoom and banned after repeated warnings.</span></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"33431521","name":"St Albans Thursday Night Boardgaming","link":"https://www.meetup.com/st-albans-thursday-night-boardgaming","description":"<p>WE'RE BACK!!</p><p>We're a friendly bunch who meet every other Thursday to play boardgames. Bring a game along or just turn up and play other people's!</p><p>Some games we've played in the past include:</p><p>Codenames</p><p>Settlers of Catan</p><p>Pandemic</p><p>Mountains of Madness</p><p>7 Wonders</p><p>Dead of Night</p><p>Between Two Castles of Mad King Ludwig</p><p>Brass</p><p>Concordia</p><p>Power Grid</p><p>Viticulture</p><p>Spirit Island</p><p>Great Western Trail</p>","city":"St Albans","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"22262719","name":"Surrey Girl Gamers","link":"https://www.meetup.com/surrey-girl-gamers","description":"<p><br></p>\n<p>This group is created for women/girls/ladies in Surrey who enjoy playing board games or those new who would like to learn to play&nbsp;board games.</p>\n<p>We meet regularly in the pub to play games.&nbsp; It may be daunting attending an event for a first time but please don't be nervous.&nbsp;</p>\n<p>Please click on&nbsp;<a href=\"https://www.meetup.com/Surrey-Girl-Gamers/about/\">FAQs</a>&nbsp;link for information. (links only work in browser, not in app)</p>\n<p>Any questions, please don't hesitate to get in touch. Looking forward to meeting you!</p>\n<p>Twitter:&nbsp;<a href=\"https://twitter.com/surreygirlgamer\">https://twitter.com/surreygirlgamer</a><br>Instagram:&nbsp;<a href=\"https://www.instagram.com/surreygirlgamers2017\">https://www.instagram.com/surreygirlgamers2017</a><br>Slack:&nbsp;<a href=\"https://join.slack.com/t/surreygirlgamers/shared_invite/enQtMzE5MzcwNzY0MDAxLWFjZTMxODA2YmViZDU2OGM3NzE2MTk3MTE1NDU5ZjcwMWUwNTQ1OGU1YzI0NjU4YTY3NTAxMDJiMWNlNzkxOTE\">https://join.slack.com/t/surreygirlgamers/shared_invite/enQtMzE5MzcwNzY0MDAxLWFjZTMxODA2YmViZDU2OGM3NzE2MTk3MTE1NDU5ZjcwMWUwNTQ1OGU1YzI0NjU4YTY3NTAxMDJiMWNlNzkxOTE</a></p>","city":"Woking","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"30427270","name":"NX LDN: Nintendo Switch London Meetup","link":"https://www.meetup.com/nx-london","description":"<p>Hello there reader.&nbsp;</p>\n<p>We are a group of Switch Players who gather regularly on Saturdays, and occasionally on Sundays to play various Switch games (Splatoon 2, Smash mostly) and looking to increase our numbers with the games that are coming over to this popular console :) <br>Discord Server : <a href=\"https://discord.gg/ugFN5z3\" class=\"linkified\">https://discord.gg/ugFN5z3</a> . <br>We now have a twitter:&nbsp;<a href=\"https://twitter.com/NX_LDN\">https://twitter.com/NX_LDN</a> <br>FB group : <a href=\"https://www.facebook.com/groups/45536152484\" class=\"linkified\">https://www.facebook.com/groups/45536152484</a>... <br>WhatsApp group chat: Once you attend one of the meetups, just ask to join it^^&nbsp;</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"18746383","name":"Tooting Board Games Group","link":"https://www.meetup.com/tooting-board-games-group","description":"Tooting Board Games Group is for people looking to join a laid back group playing modern board games (think Settlers of Catan, Carcassone, Ticket to Ride – any game from Agricola to Zombicide) at a pub in Tooting. Have some fun, roll some dice, flip some cards and make some friends.\n\nMeetups take place every Tuesday at the same location. Sessions start around 7pm and finish when the pub kicks us out but you can turn up when you want as there will be new games starting all the time. You'll find us at the back of the pub surrounded by games.\n\nCheck past meetups for an idea of what was played on the night. There's usually lots of games about, brought by members but please feel free to bring some of your own if there is something you'd like to play. Don't worry if you are completely new to board games, we are very inclusive and you'll have a fun night.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36291387","name":"Vampire: The Masquerade - London","link":"https://www.meetup.com/vampire-the-masquerade-london","description":"A group focused on arranging play sessions for the tabletop role playing game, Vampire: The Masquerade. The games make use of the 5th edition of the rule set.\n\nWHAT DO I NEED TO TAKE PART?\n\nA good imagination, and a bit of humor :) If you do have a set of d10 dice, and possibly a copy of the VTM V5 source book, you're welcome to bring them along. We do have spare dice and a source book with us, so no worries if you don't have them.\n\nI'VE NEVER PLAYED VTM BEFORE. IS THAT A PROBLEM?\n\nNo, not at all. The game is very easy to understand, and we'll help you along the way while you're playing. While the Endless Nights are very mysterious, and steeped in lore and history, you don't need to know any of it to actually play the game. In fact, discovering the secrets of the Kindred for the first time is a part of the fun!\n\nCAN I MAKE MY OWN CHARACTER?\n\nYes, you are allowed to make your own characters if you'd like. However, please make sure to read the restrictions on character creation for the individual one shots and chronicles you join. Those restrictions are there to make sure your chosen character can make the most of the story, so it's worth paying attention to them.\n\nWe do recommend that you use this app when generating a character, as it's quite user friendly:\nhttps://play.google.com/store/apps/details?id=de.lilac.vampire_v5_character_creator&gl=GB\n\nI DON'T HAVE THE FIRST IDEA HOW TO MAKE A CHARACTER?\n\nNot a problem. Every chronicle and one shot will have pre-generated characters available for you to play. We do recommend that you install this app on your phone beforehand:\nhttps://play.google.com/store/apps/details?id=de.lilac.vampire_v5_character_creator&gl=GB\n\nIt makes it quick and easy for us to send you a pre-generated character sheet.\n\nWHAT DO I HAVE TO DO TO TAKE PART?\n\nYou *must* RSVP to an event. a story typically has between 2 to 5 players. Any more, and you'll spend a lot of timing watching other people play.\n\nYou must be 18+ to attend.\n\nWHAT IF THE PEOPLE IN MY GROUP ARE MEAN?\n\nThis group is about having fun, relaxing after a rough week at work and meeting some interesting people. Unsocial or inappropriate behavior is not tolerated, and swiftly dealt with. This is a safe space, and is open to all.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35830016","name":"London Chess Community","link":"https://www.meetup.com/london-chess-community","description":"<p>Purpose: Have fun, meet friends, be social and be a part of a community with the additional benefit of playing the great game of Chess.</p> \n<p>ALL level of players are invited - from beginners to experts. We're here to teach each other more about the game and be a community of Chess lovers. Don't worry about skill level, that's not important. It's more important to us if you enjoy your time and feel welcome at our community. </p> \n<p>Why join? If you want to make friends and be a part of a friendly community. You're the perfect match for us. We're here to learn to help each other be better. That's our ethos. </p> \n<p>What we do? We play Chess! Have fun! Be a community.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"30737914","name":"Mahjong Twickenham","link":"https://www.meetup.com/mahjong-twickenham","description":"<p>This group is for anyone interested in mah-jong. All levels are welcome as well as complete beginners. We also teach the game.</p>","city":"Twickenham","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36378236","name":"DnD Club London - Dungeons and Dragons Community","link":"https://www.meetup.com/dnd-club-london-dungeons-and-dragons-community","description":"**Welcome to DnD Club**\nYou want to play Dungeons and Dragons. You’ve watched Critical Role, you bought the Starter Kit, you’ve created multiple characters...and you’re stuck. You are in the right place. I started this meetup to create a welcoming, safe, and encouraging community for tabletop roleplaying. We now have a international community of over 2000 players and we're coming to London!\n\nThis hobby can seem very difficult to access, and getting started can feel impossible. This group is about eliminating those barriers and creating a wonderful place for both new and experienced gamers.\n\n**Our mission:**\n\n*Heroic immersion:* Regardless of the system or DM, we want you to *feel* as if you are walking the forests of Mirkwood, through the world of Exandria, or into the dungeon of a Mad Mage. We immerse players, new and experienced, in classic, heroic adventures, in the theme of Tolkien, Lovecraft, Howard, and many more...every single session.\n\n*Reliability*: Not only do our games provide an excellent experience, they are reliable. We run at least 10 games per month, and our player attendance rate is above 95%. Additionally, we have a team of 30 DMs working together to ensure that we never cancel an event.\n\n*Player Driven:* Our games are player driven, putting you and your character at the center of the plot. Your choices will decide the outcome: from heroic victory to an untimely end. We encourage adventure feedback and try to make each session even better than the last.\n\nD&D is an awesome experience, and my tables are open to all players. I'll teach you everything you need to know, and everybody we play with is very welcoming to players interested in checking out the hobby. I bring all the essentials: minis, dice, play-map, etc.\n\n***Tickets:***\nHere's the secret to this group: we pay our DMs. Because of this, sessions run on time, with prepared facilitators, and typically full tables of players.\n\nAccordingly, all players are required to purchase their seats in advance to each session. Because preparation by the DM and other participants is impacted by the number of players, ticket reservations are final, no exceptions. Also, please do not \"drop in\" to the event. Cash is not accepted at the table.🔥🔮⚔️\n\n**Why on earth would I pay to play an RPG?** \nThree reasons: reliability, quality, and immersion. Because all our players have \"skin in the game\" they are much more invested. Because we compensate our DMs, they are always on point with an awesome adventure.\nI personally vet each DM and the DM team upholds rigorous quality standards of play.\n\n**Quality Standards:** \na) We make sure all participants have the materials they need, whether in person or online.\nb) Sessions occur on schedule, at the same date and time each week, unless all participants agree to a new date and time. We've run over 1,600 sessions and had essentially zero cancelations.\nc) Our players realize this is a cooperative endeavor. Mutual respect and cooperation is what we expect of all participants. DMs are trained in how to \"share the spotlight\" and no player is allowed to derail the experience.\nd) In game themes of sexual assault, rape, or racism are expressly prohibited. Obviously these things are also prohibited between people as well.\ne) DMs are highly responsive to feedback. We encourage all players to message either their DMs or me personally to ensure that each experience is awesome!\nf) Disruptive behaviors by participants are first resolved in game, and then addressed by DMs out of game. DMs may remove players from sessions if needed to ensure a quality session. (To date we've never had to do this because players tend to work really well together.)\ng) DMs are expected to be prepared and begin on time. They are expected to deliver a quality experience on the platform of their choosing (typically roll20 and discord), every session.\nh) DMs are expected to know their setting and adventure, and should be ready to adapt to player decisions.\n\nIf there are any issues regarding your session, please contact me (Adam Scott). II will always make sure to take care of you.\n\n***About your host:***\nMy name is Adam and I’m a teacher by day and RPG game organizer by night and weekends for people who want to play and learn about the hobby.\nI learned how to play role playing games virtually as soon as I could roll dice and haven't looked back. A huge fantasy and science fiction fan, I've engaged in immersive storytelling for 20+ years, both with friends and in my classroom as a career teacher. All are welcome at my table to learn the basics of role playing games through Dungeons & Dragons. I also provide advice to my community of over 24,000 gamers through my instagram account.\n\nWe look forward to having you at the table.\nAdam Scott\nOwner/Operator/Head GM\nDnD Club\nIG: @the.dnd.club","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35921154","name":"Epsom Games Group","link":"https://www.meetup.com/epsom-games-group","description":"<p>Epsom Games Group (EGG) is a group for fans of tabletop gaming in the Epsom area. We meet every two weeks for our favourite tabletop games, including Warhammer, D&amp;D, Magic: The Gathering, and many more. Just leave a comment to set up a game with another player or come along to see what it's all about!</p><p><br /></p><p>Every 2 weeks on Sunday 4-8pm at Ascension Training, Epsom. There is free parking on site and a cafe that serves snacks and drinks. £5 entry.&nbsp;Cash is accepted but we don’t have change so online payment is preferred (Matthew Tanton, 11-04-39, 10829368).</p>","city":"Epsom","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19229245","name":"Board Games and Social Games in the East End","link":"https://www.meetup.com/east_end_board_games","description":"<p>We're a friendly bunch who meet up regularly to play modern board, card and tile games in nice venues around East London.</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"35745244","name":"Wapping Tabletop Games (E1/SE16)","link":"https://www.meetup.com/wapping-tabletop-games-e1-se16","description":"<p>Do you play tabletop games but are missing a regular group in the E1/SE16 area? Join us at our home right by the Wapping Overground station as we host regular meetups for you to attend in pairs.</p><p><br /></p><p>What we'd like to eventually get to is a fun experienced group to bring out Sidereal Confluence and Pax Pamir with and maybe even do some campaigns together.</p><p><br /></p><p>Our events are in small groups (usually 6-8). We always decide the games to play beforehand.</p><p><br /></p><p>Rules:</p><p>1. Bring a friend policy: You're welcome to our events in pairs, always bring a +1 - partner, colleague, parent, friend, neighbour, date. This is our way of keeping things safe and pleasant for everyone.</p><p>2. Your Meetup profile must have your full name and a clear photo of your face to be accepted in the group.</p><p>3. As we're hosting these events at our home, we may ask you to send us a picture of your ID before attending.</p><p>4. Signing up for an event and not attending will lead to removal from the group. This includes not bringing a guest.</p><p><br /></p><p>Reminder for point 1. Our events can be attended in pairs only. Event signups without guests will be ignored and members who turn up for events without a guest will be removed from the group.</p><p><br /></p><p>Reminder for point 2. Membership requests missing a full name and a clear photograph will be rejected.</p><p><br /></p><p>We also hang at https://chat.whatsapp.com/GwKBeJZwVHJ2aDLD907pp8 but all events and attendees are managed through this Meetup group.</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"29741211","name":"Bridge and Socialising","link":"https://www.meetup.com/ascot-sunningdale-bridge-meetup","description":"Hello! If you are looking for a friendly group where you can play bridge online (or face to face) whilst chatting (and sometimes seeing one another) give us a try. We welcome players (including bridge pairs) for social bridge games.\n\nAs bridge games are mostly online we welcome bridge players locally and from anywhere in the world! Online games are held on Mondays, Thursdays and Saturdays. In person games are held on weekdays (and will be held on any day from Monday to Thursday). \n\nThe group is ideal for folks with a reasonable or good knowledge of the game of Bridge, giving you the opportunity to play casual, fun bridge games.\n\nOnline games are done through the excellent Bridgebase.com website and we can chat verbally (and see each other whilst playing if attendees wish) using WhatsApp or a video calling service (Teams, Zoom or Skype).\nHappy to show you how to use the Bridge Base site before you play in one of our online sessions if you have not played using this site before.\n\nA photo of yourself is required from new members - so we can properly welcome you. Note: This is a private group so photos are not available to non-members. Spectators are welcome at our online events.\n\nMembers may also wish to attend face to face bridge evenings. At the moment these are held in the Ascot (Berks) area, though elsewhere may also be possible. \n\nAny questions please contact David or myself. Hope to welcome you to the group soon!\n\nDave","city":"Ascot","state":"03","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"35891934","name":"London Scrabble And Socialising","link":"https://www.meetup.com/london-scrabble-and-socialising","description":"<p>A fun and social group, meeting to chat and play Scrabble in a fun and inclusive atmosphere. All levels welcome, but mandatory is a sense of humour and a desire to have fun. Seriousness is forbidden! :)</p><p><br /></p><p>For consistency, we’ll use the most recent official Collins Scrabble wordlist for any adjudications - you can easily get this as a mobile app. Generally we’d prefer this is used for challenges rather than for people to look up words before they play…after all, it’s a game about the words we know, not our ability to read!</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"9011422","name":"Friendly bridge group in London","link":"https://www.meetup.com/friendly-bridge-group-in-london","description":"<p>This is a group for people interested in learning or playing the card game of bridge. Bridge is played all over the world, and is gaining popularity, particularly among the young. It is an ideal way of meeting people, whether you aim to be an expert or just learn the rules and play socially. Let's see if we can get a group started.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36163425","name":"London Backgammon Tournaments","link":"https://www.meetup.com/london-backgammon-tournaments-meetup-group","description":"This group is intended for people who play at all levels and enjoy the game backgammon. I look forward to hosting backgammon games within central London and making new connections along the way!\n\nAll are welcome!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"9514972","name":"Tabletop Tuesdays","link":"https://www.meetup.com/table-top-tuesdays","description":"Whether you are looking for more people to play card, board and tabletop games with, want access to an awesome selection of games or just looking for a friendly environment to learn new games in, Tabletop Tuesday is the perfect place for you!\n\nPlease come and join us for a refreshing blend of themed cocktails, bar food and gaming. Based in London's premier gaming venue, Loading Bar, every Tuesday from 7.30pm-Late.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34135428","name":"Lemons & Sevens Poker Club","link":"https://www.meetup.com/lemons-sevens-poker-club","description":"<p>Welcome! We're the Lemons &amp; Sevens poker group in London and Harrow. If you're interested in playing poker in a friendly and fun no-pressure environment then you're in the right place.</p><p>We host regular poker games (both cash and tournaments) of all stakes levels, and when demand is high we also have learning sessions for newer players.</p><p>Feel free to join or shoot us a message to receive updates on our upcoming games.</p><p>We also run <a href=\"https://www.lemonsandsevens.com/\" target=\"_blank\">lemonsandsevens.com</a> where you'll find gambling guides and up-to-date reviews on all your local casinos.</p>","city":"Harrow","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"20425452","name":"Dungeons and Dragons in Bishops Stortford","link":"https://www.meetup.com/d-d-5e-in-bishops-stortford","description":"Welcome Adventurers,\n\nWe are hosting a weekly D&D 5E session every Saturday afternoon ). All are welcome and encouraged to join, even if your levels of experience are precisely zero. \n\nWe currently have Teens to young adult in the group so please be aware of that before requesting to join.\n\nFor those who are new to the group/new to D&D, you have a choice of a race and a class to choose from.\n\nThe races are; \\\n\nDwarf,Elf, Halfling, Human, Dragoborn, Gnome, Half Elf,Half Orc, Tiefling.\nThe classes are; \\\n\nMelee (little to no magic) \\\n\nBarbarian(tank and strong damage), Fighter(most damage melee fighter), Monk(agile and martial artist), Paladin(holy fighter with great burst damage) and Rogue(stealthy and sneaky with great damage potential)\nMelee (full magic) \\\n\nCleric(divine healing), Druid(nature base magic)\nRanged (full magic) \\\n\nBard(talker, 'face' of the party), warlock(less magic but more focused, generally a bit more 'evil'), sorcerer(buffer and knows magic naturally), wizard(utility, nerd, knows magic via reading)\nRanged(minimal magic) \\\n\nRanger(shoot things,hard)\nPlease feel free to join and ask me any questions you wish\nI recommend watching the following video if you have never played the game before;\n[https://m.youtube.com/watch?v=qQq_WsPFiDs](https://m.youtube.com/watch?v=qQq_WsPFiDs)","city":"Bishop's Stortford","state":"F8","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"17984892","name":"St Albans Board Games Meetup","link":"https://www.meetup.com/st-albans-board-games-meetup","description":"A friendly all ages all games club that meets on a regular basis with alternate Monday and Wednesday sessions in St Albans.\nWe also hold monthly all day events- regulars, newbies and family's are always welcome!\n\nWe play all types of games, from Catan and Terraforming Mars through to the latest from kickstarter- someone's always got a new game they'd like to get to table.\n\nYou can find out more about us on our facebook group and also on Board Game Arena!\n\n**Subs**\nYou can pay for sessions (in preference order!):\n\n1. Bank transfer: Account: 24661997 Sort Code: 23-05-80\n2. Cold hard cash (or we can do change normally!).\n3. PayPal (friends & Family): @stabgc","city":"St Albans","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35870492","name":"Farnborough Board Games Club","link":"https://www.meetup.com/farnborough-board-games-club","description":"<p>Hello! Do you like Board Games or are curious about Board Games? We are are a friendly group of games enthusiasts that have been gathering in Farnborough since our Meetup debut in 2016. We are just restarting again after we had to temporarily close down due to the pandemic.</p><p><br /></p><p>Currently we meet up every Thursday at the Monkey Puzzle Brewers Fayre from 7pm till close. Feel free to bring along any games you might want to play, we always like to try out new games. And don't worry if you are only just getting into the hobby, our core group always brings a good selection of games that we are happy to teach.</p><p><br /></p><p>We are a very sociable group of people which often host additional gaming sessions at our homes or organise trips to board game conventions together.&nbsp;</p><p><br /></p><p>Not sure what we mean by Board Games? Check out Board Game Geek (BGG) for an idea. https://boardgamegeek.com/ This site contains listings of just about every game you can imagine and often lists helpful tutorial videos.</p>","city":"Farnborough","state":"F2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36416297","name":"Brighton Agape International Cafe","link":"https://www.meetup.com/agapecafe","description":"Agape cafe is for any age, ethnicity and background to come and have fun gaming, board games, pool, table tennis, table football and more.\nWeekly event every Friday 7pm - 10pm\nMost of our attendees range from 18 to 55 years old, looking to meet new friends and learn about new cultures through conversation and playing games.\nWe have attendees from Iran, China, Italy, Spain, France, Germany, Japan, Singapore, Malaysia and more. So if you want to learn about other cultures, have fun, meet new friends in Brighton and Hove, this is the place for you.\nThere are also opportunities for you to introduce others to your home country and culture.\nAgape Cafe is lead by a team of volunteers who want to provide you with a 'home from home' as long as you are in Brighton. Whoever you are and wherever you are from, you can be sure of a warm welcome. Please contact us to find out more and check out our events programme to see what's on. We hope to see you soon!","city":"Brighton","state":"E2","country":"gb","isPrivate":false,"isNewGroup":true},{"id":"36220305","name":"Meeple House Board Game Club","link":"https://www.meetup.com/meeple-house-board-games-club","description":"We're a board game club meeting every other Tuesday at Maple House in Hemel Hempstead. Bring a game to play or just play other people's!","city":"Hemel Hempstead","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34725343","name":"Fully Digital UK Virtual Game Show - The QuizMasta®","link":"https://www.meetup.com/quizmasta","description":"The QuizMasta® will test your knowledge in this fun and fully digital \\*\\*interactive Virtual Game Show. This is NOT your run-of-the-mill Zoom Quiz. You'll be participating in real-time against other participants from all over the UK. Fun for all ages and skill level, whether you consider yourself a Novice or Expert.\nA night of Fun & Laughter is guaranteed for all who attend\nThis Quiz is compatible on all Smartphones, Tablets and Laptop.\n\\*\\*Ideally you'll have one device to connect to the Event (Tablet or Laptop), then a second device to participate in the Quiz (Smartphone)","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36300555","name":"Meeple of Basingstoke","link":"https://www.meetup.com/meeple-of-basingstoke","description":"Our aim is to provide a dedicated environment in which to play modern hobby board games. We aim to be open and friendly, so if you want to come along to see what the hobby is all about, want to play new games that you've never tried before, or even if you just need a room to play a game you already know, then we look forward to having you join us.","city":"Basingstoke","state":"F2","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"6768972","name":"Brighton Pub Boardgamers","link":"https://www.meetup.com/brighton-pub-boardgamers","description":"Board games, card games, role-playing games, werewolf; new faces always very welcome, we're a friendly mixed bunch, and play anything from Pandemic to Dixit to Codenames to Twilight Imperium. You don't need to know how to play, just pick your game night, RSVP and come and have fun!\nCurrently meeting Weds and Sunday at pub/dice saloon, and saturday online on Discord.\nJoin us on Discord for text and (optional) voice chat about our pub meets, and playing online: https://discord.gg/b43zV4XNjQ\nWe also have a roleplaying group ([https://www.meetup.com/Brighton-Role-playin...](https://www.meetup.com/Brighton-Role-playing-Games-Meetup/) and) And we run an awesome gaming festival in the summer ([https://www.s](https://www.meetup.com/games-festival/)trangegamesfestival.co.uk/)\nAnd we're on Facebook:\n[https://www.facebook.com/brightonpubboardga...](https://www.facebook.com/brightonpubboardgamers/)","city":"Brighton","state":"P6","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36055534","name":"Blackheath Bridge Meetup Group","link":"https://www.meetup.com/blackheath-bridge-meetup-group","description":"Quantum Bridge Club is based in Blackheath, London SE3.\n\nFor July and August, we offer a drop in on Wednesday afternoon where you can play for up to three hours, supervised by a bridge teacher. You will be able to ask questions of the teachers as you play the hands (£10 per drop in session). No need to have a partner. But if you don't have a partner, please let us know in advance if you are coming, so we can find you a partner.\n\nWe are also offering beginners’ and intermediate bridge classes every Wednesday afternoon for two hours. The next courses will start in September 2022 for ten weeks.\n\nCome along and learn the world's most fascinating card game, taught by two enthusiastic teachers, both qualified bridge teachers with the English Bridge Union.\n\nWe aim to provide a fun and stress free environment where you can meet friends and share a wonderful hobby!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34642973","name":"Go Social","link":"https://www.meetup.com/go-social-meetup","description":"The opportunities to play Go on-line during Covid-19 restrictions are fantastic. There are many sites with thousands of players at any time day or night, but for me, playing on-line misses one of the key reasons I like to play - social interaction. This group sets out to make the on-line experience a bit more like a real-world Go club. We'll connect via Discord with audio and ideally video, and we'll play, discuss and teach on online-go.com (OGS). Whether you are new to the game or an experienced player, we hope to welcome you.\nFor a description of Go, see [https://en.wikipedia.org/wiki/Go_(game](https://en.wikipedia.org/wiki/Go_(game)). To learn the basics, try [https://online-go.com/learn-to-play-go/rules-intro](https://online-go.com/learn-to-play-go/rules-intro). To play on-line, register at [https://online-go.com/register](https://online-go.com/register). To enjoy playing, get help and encouragement, develop your skills, or just connect with enthusiastic, friendly people, join us!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"26510521","name":"Ware Board Games Meetup","link":"https://www.meetup.com/ware-board-games-meetup","description":"Welcome to the Ware board game club. \\\n\nWe meet regularly at each other houses to play board games, miniatures games, role playing games and party games of all types. The group includes all age ranges and abilities so do not be afraid to come along and give something a try. Once a month we hold a larger get together where we set up a few different tables and play a few games in the one night. This is a good starting place to get to know people. If you are new to gaming check out boardgamegeek.com for the difficulty level of games if you are worried. Anything below 2.5 in weight is pretty simple to pick up. Most of us aren't in it to win it so let's just have fun and hang out with good people :) \\\n\nHope to see you soon \\\n\nAnna","city":"Ware","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"2962612","name":"Stevenage Boardgame Club","link":"https://www.meetup.com/stevenage-boardgame-club","description":"<p><span>Do you want to play Boardgames? Never played but sounds interesting? <br> If so join up and find others in the area to meet up with - simple!</span></p>\n<p><em>Facebook page:&nbsp;<a href=\"https://www.facebook.com/StevenageBoardgameClub\" class=\"linkified\">https://www.facebook.com/StevenageBoardgame...</a><br></em><em>Discord server :&nbsp;<a href=\"https://discord.gg/wrTWzFQ\">https://discord.gg/wrTWzFQ</a><br></em><em>email : stevenageBGC@gmail.com</em></p>\n<p><span>We play variety of games from Eurogames to \"Ameritrash\" to classics like Settlers of Catan / Dominions etc. People are always bringing new games as well so something new at every meeting.</span></p>\n<p><span>We are a friendly fun social group and all are welcome regardless of experience.</span></p>","city":"Stevenage","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"29464040","name":"East London Gaming at Rule Zero","link":"https://www.meetup.com/rule-zero","description":"<p>Do you love games? We do!</p> \n<p>Sometimes (just sometimes) it's nice to have a night off computer screens to play games with old friends and new. If you are looking for new games, old games, new people to play with, then we can help!</p> \n<p>Our bar, cafe, and gaming space is well set up for all manner of gaming, and with this Meetup, you'll be able to find new players of your favourite game, or indeed find a new favourite game to play with old friends. Join us!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"32969041","name":"London Women's Games, Snacks & Wine Group","link":"https://www.meetup.com/london-womens-games-snacks-wine-group","description":"This is a meetup for women to get together to hang out, play some board or card games, drink some wine (bring your own to share!) and nibble on snacks together (please bring some to share!) and have an evening of fun and laughs!\n\n**VERY LIMITED SPACES AVAILABLE SO PLEASE RSVP EARLY! ONLY THOSE WHO RSVP WILL BE ABLE TO ATTEND!**\n\n**Location:** Bedford Avenue, London WC1B 3AD\n*It's a 3-minute walk from Tottenham Court Road tube station.*\n\n**Reminder:** RSVP is mandatory to attend.\n\n**Please Note:** The address will be sent directly via private message on Meetup to those approved to join games night. Please have your notifications turned on for private messages.\n\n\\*\\*\\*Starting March 2022, I will be introducing a £3.50 per spot charge on each Meetup event. This will be used to cover the Meetup Organizer Membership fee and a monthly games subscription for game nights so we have fresh board and card games on each group event.\n\nI also run a Games Group every 3rd Thursday of the month: [https://www.meetup.com/London-Bisexual-Women-Games-Wine-Group/](https://www.meetup.com/London-Bisexual-Women-Games-Wine-Group/)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"25725650","name":"Dicing With Life","link":"https://www.meetup.com/dicingwithlife","description":"🎲Welcome to \"Dicing With Life\"\nJoin us every Tuesday ,Friday and Saturday for FREE community gaming sessions located at our shared Venue with Tea Tots soft play within Unit 11 on the ground floor of The Mercury Mall. From 7 pm we offer a wide variety of boardgames and card games for all abilities from our FREE to use community games libary.\n\n🎲We have plenty of tables and chairs avalible with out the need to book in advance. Just turn up and play.\n\n🎲There's no cost to play, our members are friendly and welcoming, and it's fun, so come along and join in!\n\n(12.7.22)\nOur current opening times are\n🎲TUESDAY: 7pm till 10:00pm\n🎲FRIDAY: 7pm till 10:30pm\n🎲SATURDAY: 6pm till 10:30pm\nWe will increase our opening times in the near future.\n\n🎲 We also have a friendly and welcoming WhatsApp group you can join if you'd like to 'meet' to some of the other players in advance, and chat about the games you'd like to play - just click here and say hello:\nhttps://chat.whatsapp.com/FbqEruQoRxJJ9Nr2880CaZ \nyou'll be greeted warmly :)\nAlso, check out our Instagram page to see the types of games we can offer, and give us a follow 😋\nWe hope to meet you for a game soon🎲\n\nIf you have any questions, send us a message and we'll get back to you with some answers.\n\n🎲 One more thing, every Monday evening we hold a gaming session at The Golden Lion pub in Romford. Starting from 6pm till 11pm. The session takes place on the first floor where we offer a selection of games for you to enjoy with tables avalible all for FREE.\nA great atmosphere to join a session of D&D, or come along and meet new Meeples and join in on some conversation and gaming. Why not grab a drink, order some pub grub and roll some dice with us!\nLook forwould to seeing you there!🎲\n\n🔞To comply with the venues health and safety laws, If you are under the age of 18, you must be accompanied by an adult.","city":"Romford","state":"E4","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19756048","name":"Dorking: Dungeons & Dragons (D&D) 5e","link":"https://www.meetup.com/dorkingdnd","description":"<p><b><i>Who are we?</i></b></p>\n<p><span>We’re a friendly bunch of D&amp;D players with a range of experience; from a few weeks to a few decades!&nbsp;</span> <br></p>\n<p>Based in and around the <i>Dorking</i>&nbsp;area (Surrey); we currently run over 30 campaigns of <i>D&amp;D (5th Edition)</i>, most of which are hosted on a fortnightly basis.</p>\n<p><b><i>How does it work?&nbsp;</i></b></p>\n<p>Rather than hosting game days where players would show up on a first-come, first-serve basis, we focus on putting together groups of 6-7 people, who will run through either an official or homebrew campaign on a regular schedule. This way, you will really get to know your fellow adventurers, as well as your own character.</p>\n<p>We do host one-off games every now and then which anybody can jump into - as well as large events where we all get together for drinks, food and games!</p>\n<p><b><i>I've signed up, what next?</i></b></p>\n<p>You should receive an email from Meetup (which may go to your junk folder) with instructions on which Session 0 to join next. As the dates for these are agreed once the group is full, you may need to scroll down our list of events to find it. That date will be a placeholder, so don't worry if it clashes with something else you have planned.</p>\n<p><i>*You will need to RSVP to a Session 0 event in order to join a campaign.*</i></p>\n<p><i><b>So what are you waiting for!?</b></i>&nbsp;</p>\n<p>Join us now for what are bound to be epic times with great, like-minded people. There will be a few quick questions to answer when you join the group, and please be aware that it may take a little bit of time to get the next game filled (depending on how quickly we can find enough players and a DM).</p>\n<p>You'll also find us on <a href=\"https://www.facebook.com/groups/DorkingDnD/\">Facebook</a>,&nbsp;where we share news, stories, and occasionally recruit new players for existing campaigns.</p>\n<p>Thanks for reading!</p>\n<p><b><i> N.B:</i></b></p>\n<p> You must be 18+ to join the group. </p>","city":"Dorking","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18291937","name":"Hertfordshire RPG Club","link":"https://www.meetup.com/roleplaying-club-of-st-albans","description":"<p>We are a fun group of people who meet every other Thursday evening to play table-top role-playing games in St Albans. Come and join us. No prior experience necessary.</p><p><br /></p>","city":"St Albans","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"24173512","name":"Walthamstow Boardgame Group","link":"https://www.meetup.com/walthamstow-boardgame-group","description":"<p>We're your friendly local London board game club meeting up on a weekly basis to play the very best of modern board games, card games and party games. We welcome everyone and anyone who wants to have fun playing games in a relaxed, enjoyable and safe environment, whether you are just starting to explore modern board games or are experienced with all this brilliant hobby has to offer, this group is for you.</p><p><br /></p><p>We play a wide variety of games ranging from simple card games, social games to wonderfully challenging epic strategy board games. No experience needed, all games played will begin with a rules run down to get you up to speed. You can also bring and play your own games, choose from our games library or play games others have brought.</p><p><br /></p><p>We meet every Tuesday at 6:30pm for our Digital Events. Hop online and get involved. Sign up to games or propose what you'd like to play! Sound good? Keep reading!</p><p><br /></p><p>Join our wonderful community where most of our discussions and our virtual meetups take place, so drop in to chat games, ask questions and get involved with the community! <a href=\"https://discord.gg/mHZSKq2\" target=\"_blank\">https://discord.gg/mHZSKq2</a></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"26271350","name":"Leighton Buzzard Board Games","link":"https://www.meetup.com/leighton-buzzard-board-games","description":"<p>A monthly all-day meetup for tabletop boardgames, card games, and similar.</p>","city":"Leighton Buzzard","state":"B9","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18398800","name":"Petersfield Cards And Dice","link":"https://www.meetup.com/petersfield-cards-and-dice","description":"<p><b>What? </b> &lt;br&gt;A friendly bi-monthly Meetup to play board, card and dice games. Join us to play a growing collection of Euro and US games that include Catan, Flashpoint, Village, Viva Java, Ticket To Ride, Coup, Perudo, Dominion, Hanabi, Compounded and more! We love learning and playing all kinds of games, so feel free to bring along your own too. &lt;br&gt; &lt;br&gt;<b>Who? </b> &lt;br&gt;Game players of all skill levels and interests are welcome. Whether you're a Board Game Geek or somebody new to the hobby who wants to explore the world of modern board games. <br>&lt;br&gt;<b> &lt;br&gt;When/Where?</b> &lt;br&gt;We meet on the second and fourth Thursday of every month at Winton House in Petersfield between 7pm - 10.30pm. &lt;br&gt; &lt;br&gt;<b>Digital Games?</b> &lt;br&gt; Find us at&nbsp;https://steamcommunity.com/groups/PCandD &lt;br&gt; &lt;br&gt;</p>","city":"Petersfield","state":"F2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19749631","name":"Fleet Board Games Club","link":"https://www.meetup.com/fleet-board-games-club","description":"Join us!\nWe are a group for anyone interested in board/card games in the Fleet area. We are enthusiasts for classics such as Settlers of Catan, Carcassonne, Ticket to Ride, 6 nimmt! and Love Letter (Monopoly, Risk, Scrabble don’t make it to our tables).\nWe now meet up every Wednesday at the Lismoyne hotel in Fleet. Our evenings do not have a set agenda - members bring a selection of their games and we play whatever people want to play.\nMeet up with some friends, or make some new ones. Use the comments to ask any questions about the group and what games are being played.","city":"Fleet","state":"F2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1353613","name":"Oxford On Board","link":"https://www.meetup.com/oxfordonboard","description":"<p>Meet nearby Boardgame Players! Come to a Boardgames Meetup to play a wide variety of boardgames with a wide variety of people. All players aged 18 to 100 are invited!</p>","city":"Oxford","state":"K2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36019299","name":"London Terraforming Mars Gamers","link":"https://www.meetup.com/london-terraforming-mars-gamers","description":"This is a group for people who would like to play the wonderful game that is Terraforming Mars.\n\nThis group exists to connect people for in real life games which can be held either at people’s own homes or at venues.\n\nSome of our members are keen teachers of the game as they enjoy bringing the experience of Terraforming Mars to newcomers.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1459803","name":"Southend Board Game Club","link":"https://www.meetup.com/southend-boardgame-club","description":"<p>Our home is The Iveagh Conservative Club in Leigh on Sea.&nbsp;The address is&nbsp;69 Leigh Rd, Southend-on-Sea, Leigh-on-Sea SS9 1JW. The start and end times are 19:00-23:00.</p><p>If you walk uphill from Chalkwell train station, it is at the top of the road, about 15-20 minutes away (although the walk is quite steep).&nbsp;</p><p>The Kings Road bus stop is right outside their front door. The number 3 and number 26 bus services stop there.</p><p>It supports our hosts (and therefore us) to buy drinks and food at the bar there.</p>","city":"Leigh-on-Sea","state":"E4","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19078453","name":"Bucks Board Games Group","link":"https://www.meetup.com/bucks-board-games-group","description":"If you enjoy playing board games and socialising then this group is for you!\nWe're a fun and friendly group where all ages and experience are welcome.\n**We meet every Tuesday night from 7:00pm at the Wycombe Arts Centre, High Wycombe.** \nA few of the more well known games the group owns collectively:\nTicket to Ride, Carcassonne, Pandemic, Splendor, Codenames, Arkham Horror, Resistance, Terraforming Mars, 7 Wonders, Dead of Winter, Bang!!!, Dominion, Zombicide and many more!\nDon't worry if you're new to board games, we are all new to one game or another. Come along and we'll happily teach you a game, or bring one of your own and show us how to play!\n\n[https://www.facebook.com/groups/bucksboardgames](https://www.facebook.com/groups/bucksboardgames)","city":"High Wycombe","state":"B9","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"20302800","name":"Tabletop gamers of the London Docklands","link":"https://www.meetup.com/tabletop-gamers-london-docklands","description":"<p>Hey there,</p> \n<p>If you like to play board, card and dice games, to discover new games (there are so many!) or occasionally play old favourites, then this group is for you! If you think tabletop games are something just for kids, or something stuck in the past, let us show you some of the great modern physical games that exist and are enjoyed by millions of people of all ages. &lt;br&gt;</p> \n<p>We meet (almost) every Wednesday evening at the Pepper Saint Ontiod pub, which is on the Isle Of Dogs, very close to South Quay and Crossharbour DLR stations, and about 10 minutes walk from the Canary Wharf Jubilee line station, and (almost) every Monday evenings at The George, which is right by Crossharbour station.</p> \n<p><a href=\"https://www.facebook.com/groups/Tabletop.Gamers.London.Docklands/\">You can also join our Facebook group, for banter, gossip, games news and more</a>.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"8387712","name":"Bedford Board Gaming","link":"https://www.meetup.com/bedfordboardgaming","description":"<p><img src=\"https://secure.meetupstatic.com/photos/event/3/f/f/d/600_448816381.jpeg\"></p> \n<p>We are a board gaming group in Bedford. We offer a chance to meet new people who share an enjoyment of board games. We're about having a bit of fun and spending an enjoyable and sociable time doing what we like best; which is ...obviously... gaming. </p> \n<p>Come and enjoy your first meet-up with us for free. After that, we charge £2 on Wednesday nights and £1 on Friday night sessions. The money goes to covering our meetup fees, room hire and any spare goes towards games that can be won or used by members of the group. Tea and coffee is provided on Wednesdays and you can / should buy drinks at the bar on our Friday meets. &lt;br&gt;</p> \n<p>If you're not a die-hard gamer, don't worry! We have plenty of games to start you off gently.... and are currently running some extra introductory sessions to lead you in gently. Our regular members tend to bring a good selection of games with them...but do try and sign up if you are coming so that we can cater for the right amount of people. </p> \n<p>We never play Monopoly, Scrabble, Cluedo or Backgammon ;-) Chances are however that if you like those, you'll be blown away by the modern games that we adore. We don't have favourite games that get played every single week as we enjoy playing a wide variety of stuff...from quick 5 minute filler games to complex all-evening strategy games and everything in between. Worker placement, area control, deck building, hand management, take-that, tile placement, competitive or co-operative...we really do cater for most board game tastes. Don't worry if you don't know the rules. They will be run through at the start of the game. &lt;br&gt;</p> \n<p>Any questions or worries? Just send us a message...we will happily answer any queries. We are a friendly bunch so don't be scared ... come and have some gaming fun!</p>","city":"Bedford","state":"A5","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36208332","name":"Southend TTRPG Group","link":"https://www.meetup.com/southend-on-sea-roleplaying-games-rpgs-meetup-group","description":"Need some playtesters for a table-top RPG that I've written. \nI've written a number of game before, but have no friends round here to RPG with.\nThe game is DnD, WFRP inspired with mechanics similar to Dungeon World or Savage Worlds.\nExpecting 4 hour-odd sessions on occasional weekends - hopefully turn a one-shot into a campaign!","city":"Southend-on-Sea","state":"E4","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35947098","name":"Central London Board Games","link":"https://www.meetup.com/central-london-board-games-meetup-group","description":"We are a group of passionate board/video gamers who play in Central London.\n\nWe play board games first Saturday and second Sunday afternoons of the month at The Queens Arms pub in Maida Vale/Kilburn and on the Fourth Tuesday evening at the pub in the Mad Hatter hotel in Southark/South Bank. Beginners welcome!\n\nIf you have an interesting game you would like us to play, feel free to bring it!\n\nThe meetup rules:\n\n1. Be polite and courteous to each other, and everyone at the hosting location.\n2. Please provide patronage to the hosting location if it's a pub/restaurant/cafe.\n3. Events that have less than 3 attendees at the RSVP end time (an hour before the event) are likely to be cancelled.\n4. 3 or more no-shows are cause for a permanent ban from the group. A No-show is someone who RSVPs yes and does not attend the meetup without informing the host either by message/comment/any other means. If you have a +1, that will count as 2 no-shows.\n5. You may be removed from the meetup if you have joined but haven't attended RSVP or tried to attend the meetup for 4 months or more without informing the organizer either by message/comment/any other means. This won't result in a ban.\n\nMeetup costs:\nOwing to the bulging size of the meetup group itself as well as the number of no-shows, the meetups are no longer free. A Nominal charge will be applied to the meetup RSVP to help cover the cost of the meetup as well as for the board games.\nPayment can be made either in cash at the event or to my Monzo bank account [https://monzo.me/muralikrishnakavassery/5.00?d=Board%20Games](https://monzo.me/muralikrishnakavassery/5.00?d=Board%20Games) (Sort code: 04-00-04, customer number: 95376376, Name: Muralikrishna Kavassery, Account type: Personal). Add the payment reference as \"Board Game Meet\".","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"19819482","name":"Alder Valley GAmes Society(AVGaS)","link":"https://www.meetup.com/alder-valley-games-society-avgas","description":"<p>AVGaS is dedicated to facilitating collective games, Boardgames, Roleplaying Games and Collectable Card Games. Everything from DnD 5e to Star Trek, Arkhem Horror to Settlers of Catan, Card games like Star Realms and Magic: The Gathering, also Table Top wargames such as Flames of War or Warhammer.</p>\n<p>If you have a game you'd like to play and you looking for somewhere to play it and someone to play it with then drop us a line.</p>","city":"Farnham","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34256474","name":"East London D&D","link":"https://www.meetup.com/east-london-d-d","description":"<p>Provide an east london based meetup group for online and in person Dungeons &amp; Dragons.</p>\n<p>If you have played before or want to try it out we are happy to get you into a game! With Covid we have been usign a mix of Discord and Roll20 but once things clear up a bit more we will be running games in person. Each group will self organise once we have enough players and a DM. There is a mix of campaigns and one-shots generally run in d&amp;d 5e but not limited to that.</p>\n<p>-We have a active discord that can be found here: <a href=\"https://discord.gg/bgVJFtb\" class=\"linkified\">https://discord.gg/bgVJFtb</a> <br>-We usually play in person at Rule Zero in Hackney Wick</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36317414","name":"New Addington Dominoes Club","link":"https://www.meetup.com/new-addington-dominoes-club","description":"Come & learn a great game, socialise & compete with other dominoes players in the community","city":"New Addington","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1707517","name":"London Indie RPG Meetup Group","link":"https://www.meetup.com/london-indie-rpg-meetup-group","description":"<p><span>Try new games, meet new people, and find out what small-press role-playing games are all about!</span> <br></p>\n<p>We play tabletop role-playing games and story games like Monsterhearts, Love in the Time of Seið, and Fiasco that encourage everyone at the table to participate creatively.</p>\n<p>We also organise Playstorms for budding designers interested in creating their own games from scratch.</p>\n<p>New players are very welcome. Please check when our next meetup is.</p>\n<p><span>SUPPORT THE GROUP - help out with Meetup subscription fees:&nbsp;</span><a href=\"http://ko-fi.com/indierpg\">http://ko-fi.com/indierpg</a><br></p>\n<p> <br></p>\n<p>Indiemeet is dedicated to providing a harassment-free experience for everyone, regardless of gender, gender identity and expression, sexual orientation, disability, physical appearance, body size, race, age or religion. As a group we all take a personal responsibility in greeting new members. Please come and chat to one of our volunteers, who will be happy to introduce you to the rest of the group, and are available throughout the meet, should you have any concerns. Indiemeet is a safe space where everyone is welcome.</p>\n<p>Some of the venues we use may not be wheelchair accessible. Please check in advance, so we can make sure we can accommodate any individual needs.</p>\n<p>We believe that gaming is for everyone. Regardless of who you are, or your level of experience.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18765831","name":"Basingstoke Role Players Society","link":"https://www.meetup.com/basingstoke-rpg","description":"We’re a collective of tabletop gamers who play RPGs around Basingstoke and a bit further out. We hold four public events a month on Mondays. Meet new people! Play games! Start an offshoot home game!\n\nPUBLIC EVENTS!\n• Game nights: One Shot Wonders (1st and 3rd Monday of the month)\n• Social evening: Social & Shenanigans (2nd Monday)\n• Discussion group: GM Workshop (4th Monday)","city":"Basingstoke","state":"F2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19881358","name":"Potters Bar Games Club","link":"https://www.meetup.com/potters-bar-games-club","description":"<p>Hello! We're a friendly and free gaming group that meet in Potters Bar to play games of all types.&nbsp;</p>\n<p>We have about 30 members so far, and are looking for more! Usual attendance numbers are around 9-15 on any one night, so please 'ignore' the numbers on the meetup page :)</p>\n<p>We play games ranging from Ticket to Ride, to Dead of Winter, Pandemic and Ghost Stories. All kinds of Euro games, designer games, card and board :)</p>\n<p>This is our <a href=\"https://www.facebook.com/groups/pbgamesclub\" class=\"linkified\">Facebook Page</a></p>\n<p> And here is more info about the group on&nbsp;<a>Board Game Geek</a></p>\n<p> <br></p>\n<p>Our group is Sponsored by <a href=\"http://gen42.com/\">Gen42 Games </a>(makers of Hive)</p>\n<p> <br></p>","city":"Potters Bar","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34241419","name":"Dark Hammer (Letchworth) - Warhammer & Magic the Gathering","link":"https://www.meetup.com/dark-hammer-games-letchworth-games-workshop-games-mtg","description":"<p>Dark Hammer Games is a new game store in Letchworth Garden City. </p>\n<p>Once the Covid restrictions are out of the way we will be running a number of weekly events, including (but not limited to) - Magic: The Gathering, Warhammer 40K / AoS games nights, Shadespire, Bloodbowl leagues etc. </p>\n<p>Tables will also be available to hire during our weekend opening hours (08:00-19:00 Saturday, 10:00-16:00 Sunday)</p>\n<p>With the Covid \"Rule of 6\" in force we will be limited to very small events initially. See individual meetups for more information.</p>","city":"Letchworth Garden City","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"31643249","name":"Board Games & Social Games In n' Around E20","link":"https://www.meetup.com/board-games-social-games-in-n-around-e20","description":"<p>In this Group We Play Game's, no experience necessary, many Member's have Game's and if you don't own any that's fine!!!</p> \n<p>Some Meetup's may state a Type of Game in the Description and most are for any Game's!!!</p> \n<p>We hold Meetup's in E20 &amp; the surrounding Borough's (Hackney, Newham, Tower Hamlets and Waltham Forest)</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"32296832","name":"Aylesbury Board Games Meetup Group","link":"https://www.meetup.com/aylesbury-board-games-meetup-group","description":"<p>This group is not just here for a particular meet or venue … the idea is a the various local meets and groups can post and chat here and hopefully create a community …</p><p><br /></p><p>For info : there are groups representatives here for several established groups :</p><p>Weekly : </p><p><br /></p><p>Hayden Hill Board Games  (weds)</p><p>Milwrights Arms RPG (Monday’s)</p><p>monthly :</p><p><br /></p><p>Hop Pole Beer and Board  Games  (semi regular - next one Sunday 19th Sept))</p><p>Millwrights Arms (monthly first Saturday)</p><p>There are other sessions. As normalcy returns they will be listed here.</p><p>These are all new comer friendly so just turn up someone will be there to involve you and teach if needed</p><p><br /></p><p><br /></p>","city":"Aylesbury","state":"B9","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"26396773","name":"Newbury And Reading Wargames","link":"https://www.meetup.com/newbury-and-reading-wargames","description":"<p>Board games, tabletop RPG and miniatures games. Friendly group above a bar with food available.</p><p><br /></p><p><strong>Meetings are now open again after COVID-19 shutdown! </strong>However, bars are usually shut and food and drink will not be available. Please wear your mask and let us know that you are coming so we can manage numbers. </p>","city":"Reading","state":"03","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18447023","name":"Brighton Indie Gamedev Events","link":"https://www.meetup.com/brighton-indie-gamedev_events","description":"<p>A central hub for events in Brighton &amp; Hove for Indie gamedevs of all shapes and sizes!&nbsp; Video games, board games, card games, escape rooms etc.&nbsp; All aspects of gamedev covered, from sound and art to design, coding, and everything inbetween!<br></p>","city":"Brighton","state":"P6","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18506477","name":"Dicing With Life Havering -  Geeks & Board Games","link":"https://www.meetup.com/haveringgeeksandboardgames","description":"<p>A&nbsp;club for board game lovers, tabletop gamers, RPG and D&amp;D enthusiasts&nbsp;and geeks of all persuasions&nbsp;to converse under one roof - all ages and abilities welcome.&nbsp;<br> <br>Whatever you are into (Harry Potter, Zombies, Star Wars...), if you&nbsp;want to chat to like minded people or simply want to mingle with others (socially distanced right now, of course) while playing a board game or two (or three) all are welcome to join us at our&nbsp;weekly meetings. Currently, due to the move to Tier 4, all our games sessions are running online.&nbsp;</p>\n<p>We play anything from Monopoly to Munchkin, Scrabble to Settlers of Catan. Trivial Pursuit to Ticket to Ride and so on. It doesn't matter if you are a fan of tabletop board games and know what a meeple is, or have only ever played the golden oldies like Risk and UNO as everyone is free to participate in a very relaxed environment. <br> <br>The venue we use when we are able to open is the Hope Board Games Cafe, in Romford Market Place. It has plenty of tables, and we have all required COVID measures in place to keep you safe. Members are encouraged to bring some of their own games along for others to play but each week various games will be on offer on a first come first serve basis for everyone to use if they wish. We also do playtesting for new games from time to time. <br> <br>Our weekly meetings are held every Saturday from 12pm onwards at the Hope Cafe.&nbsp;<br> <br>82-84 Market Place, <br> <br>Romford, Essex, <br> <br>UK RM1 3ER</p>","city":"Romford","state":"E4","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18368488","name":"Epsom & Ewell Tabletop Gaming","link":"https://www.meetup.com/epsom-ewell-tabletop-gaming","description":"<p>We are a gaming group based loosely around the Epsom &amp; Ewell area with board&nbsp;<span>gaming meetups at least once a week organised by the Epsom Games Club and looking to do more for Tabletop Roleplaying Games, Card Games, and Miniature/Non-Miniature Wargaming.</span></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><a href=\"http://www.boardgamegeek.com/guild/929\">The Epsom Games Club Board Game Geek Guild Page can be found here.</a></p>","city":"Epsom","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"21004632","name":"Brighton Role-playing Games (RPG) Meetup","link":"https://www.meetup.com/brighton-role-playing-games-meetup","description":"<p>Everyone welcome! Play Role-playing games (RPGs) of all flavours, from Dungeons &amp; Dragons to indie storytelling RPGs. No experience necessary.</p><p>We've got an active Discord community for online play at:&nbsp;<a href=\"https://discord.gg/EAFPhgU\" target=\"_blank\">https://discord.gg/EAFPhgU</a></p><p>Current games and planned games include D&amp;D, Monsterhearts, Pathfinder, Apocalypse World, Zeitgeist, Ten Candles and much more.</p><p>We play full campaigns, single adventures and one-off sessions of all sorts - players and GMs wanted!</p><p>You might want to join our boardgaming meetup too, over at:&nbsp;<a href=\"https://www.meetup.com/Brighton-Pub-Boardgamers/\" target=\"_blank\">https://www.meetup.com/Brighton-Pub-Boardga...</a></p><p>And come to our summer Games Camp:&nbsp;<a href=\"https://www.meetup.com/games-festival/\" target=\"_blank\">https://www.meetup.com/games-festival/</a></p><p>And join our FB group: <a href=\"https://www.facebook.com/groups/brightonroleplaying\" target=\"_blank\">https://www.facebook.com/groups/brightonrol...</a></p>","city":"Brighton","state":"P6","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"5929312","name":"The Brotherhood Games TCG Tournaments","link":"https://www.meetup.com/bermonsey-gamers-club","description":"<p>Welcome to the home of The Brotherhood Games. We are one of London's largest Trading Card Clubs where we run weekly tournaments for Dragon Ball Super, Pokemon, Cardfight Vanguard, Final Fantasy and Yu-gi-oh!.&nbsp;</p>\n<p>&nbsp;The Brotherhood run weekly meetups of 30+ players and additionally, we have run the largest regional qualifiers 3 years in a row as well as exclusive events. As we run our events with the official Konami tournament system, you can gain points to your world wide ranking where you will win prizes if you join the top 1,000 players.&nbsp;</p>\n<p> <br></p>\n<p> <br></p>\n<p>&nbsp;Here you can find information about upcoming events, tournaments and regional qualifiers.</p>\n<p><img src=\"https://secure.meetupstatic.com/photos/event/3/b/3/e/600_436155166.jpeg\"></p>\n<p> <br></p>\n<p> <br></p>\n<p>Please note:</p>\n<p>We are a non profit club.&nbsp;Any money that is made on entry goes towards helping, provide a safe and great place to play card games.</p>\n<p>Thank you</p>\n<p>T.O Michael Loizou</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"31284294","name":"Gaming Retro-bution","link":"https://www.meetup.com/gamingretrobutionuk","description":"<p>Join us for regular weekly events across Brighton &amp; Hove:</p><p><br /></p><p>* Always free entry &amp; free to play!</p><p><br /></p><p>* A selection of our retro consoles set up around the bar.</p><p><br /></p><p>* Select any game from a catalogue of 1500+ available from our menu.</p><p><br /></p><p>* Change games as often as you like - just let us know what you fancy playing &amp; we will change it over for you.</p><p><br /></p><p>* Need some help navigating the menu screen or setting up a game? Just give us a shout, we are here to help you have the best time possible!</p><p><br /></p><p>* 4 hours per event - plenty of time to explore the multitude of games available, play on several consoles &amp; make some new friends along the way.</p><p><br /></p><p>* Please buy a drink or some food &amp; support the wonderful venues that make these nights possible.</p><p><br /></p><p>Check out our website here! - <a href=\"http://www.gamingretrobution.com\" target=\"_blank\">www.gamingretrobution.com</a></p><p>or find us on social media - <a href=\"http://www.fb.com/gamingretrobution\" target=\"_blank\">www.fb.com/gamingretrobution</a></p><blockquote><a href=\"http://www.fb.com/gamingretrobution\" target=\"_blank\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- ig : gaming_retrobution_uk </a></blockquote>","city":"Brighton","state":"P6","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"20062096","name":"Marlow Board Games Meetup","link":"https://www.meetup.com/marlow-board-games-meetup","description":"<p>A group for anyone in the Marlow area interested in playing board and tabletop games. This might be Machi Koro, Puerto Rico, Scrimish, Go, Dominion, Agricola, Robo Rally, etc. Prior to covid-19 we had been meeting at the Marlow Donkey, near the railway station. For now, we're playing online, mostly at Board Games Arena.<br></p>\n<p>We meet on the first and third Monday of every month.&nbsp;</p>\n<p><br></p>","city":"Marlow","state":"B9","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35938238","name":"Guildford Wargaming club Meetup Group","link":"https://www.meetup.com/guildford-wargaming-club-meetup-group","description":"<p>Guildford Wargames Club meets every Monday night at St Johns community centre in Merrow, Guildford, from 6.30pm until 10.00pm.</p><p>Members of the club play historical wargames using figures in many scales including 6mm, 15mm, and 28mm. All periods are covered on air, sea and land from ancients through medieval and renaissance to modern. Members also play boardgames and occasionally run campaigns.</p><p>New members are always welcome and can normally find someone else who is interested in the same period they are.</p>","city":"Guildford","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"28073333","name":"South London Board Games","link":"https://www.meetup.com/south-london-board-games","description":"<p><b>WE ARE ON HIATUS UNTIL THE CORONA VIRUS OUTBREAK RESOLVES.</b><br></p>\n<p>Update - November 2020</p>\n<p>Dear South London Board Gamers,</p>\n<p>We wanted to reach out to you and give you an update on South London Board Games. &nbsp;</p>\n<p>Given the current COVID restrictions, and the risks COVID poses, we are going to forgo Face-to-Face meetings for the foreseeable future.</p>\n<p>The COVID crisis will end, and when it does, we will return, though potentially in a different way. In the meantime, the Discord and the Meetup will remain live. If anyone would like to arrange something using the platforms, please let us know, and if possible, and safe, we will help.</p>\n<p>Additionally, there has been a boom in digital board games across all platforms. We are looking to create a Virtual Meetup to embrace these, but the high cost of many of these games makes that problematic. The Organizers will try and come up with something in the coming weeks/months.</p>\n<p>Until we can meet again as usual, please keep safe, and remember you are not alone. SLBG will return.</p>\n<p>The SLBG Organisers</p>---\n<p>Update - Spring 2020</p>\n<p>In light of the outbreak of COVID-19/the Coronavirus, WE ARE GOING TO CANCEL ALL FORTHCOMING SESSIONS OF THE MEETUP. This was not an easy choice for us to make, but we believe it is the best way to keep everyone safe and healthy. We are not sure when we will restart, as this situation may rumble on for a long time. BUT WE WILL RETURN. We love gaming, and we are proud of the community that came together after Kyle founded the group all those years ago.&nbsp;</p>\n<p>In the interim, while we will not be running groups, there is the <a href=\"https://discordapp.com/channels/523866954726113282/523866954726113284\">Discord Server</a>, which, if you haven’t joined already, you can join via this <a href=\"https://discord.gg/DY4wXFA\">link</a>. This should allow us to keep in touch, arrange ‘virtual meetups,’ and maybe play some video games together. We will also keep the MeetUp running for the foreseeable future.&nbsp;</p>\n<p>Regarding the Coronavirus, please keep an eye on local guidance, but also the <a href=\"https://www.who.int/emergencies/diseases/novel-coronavirus-2019\">World Health Organization’s page</a> on it.&nbsp;</p>\n<p>We aren’t going anywhere, and when we can, we will meet in person again. In the meantime, please keep an eye on the Discord Server,&nbsp;</p>\n<br>\n<p>Stay safe, and if you can, keep gaming.&nbsp;</p>\n<br>\n<p>Yours,</p>\n<br>\n<p>South London Board Games Organisers&nbsp;</p>\n<p>Kyle, Nick, Rich, Ed, Olley, Nick</p>\n<br>\n<p>--- </p>\n<p>In normal times, we are<span>&nbsp;a regular volunteer-led board gaming night that meets in and around South London (specifically the Brixton, Clapham, Balham area).&nbsp;</span><span>Most of the places we meet are typically pubs, which serve food.</span></p>\n<p><span>We hope to offer a place where you can come learn, play and even teach games, some that you know, and some that are new to you.&nbsp;</span></p>\n<p>Our members supply the games, so please bring any along that you have and really want to play. But don't worry if you don't have any - there are always a few of us that get excited and bring along more than we need!</p>\n<p>The games we bring change from week-to-week, covering a wide range of different games, from party games (Werewolf, Secret Hitler, Bang!...) to co-op games (Pandemic, Dead of Winter, Mysterium...) to competitive games where you are trying to beat out your opponents in an all-out quest to victory (Ticket to Ride, Concordia, Great Western Trail).</p>\n<p>We're a really friendly group - everyone is welcome especially if you've never played these kinds of games before. There is always someone on hand to explain the rules to a new game.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19583887","name":"Milton Keynes Role-Playing Games Club","link":"https://www.meetup.com/milton-keynes-role-playing-games-club","description":"<p>The <a href=\"https://www.mk-rpg.org.uk/Main_Page\">Milton Keynes Role-Playing Games Club</a> kind of does what it says on the tin. It's a club, in Milton Keynes, where we play tabletop, face-to-face role-playing games (like Dungeons &amp;amp; Dragons).&nbsp;</p>\n<p>We play mini-campaigns of around 8 weeks followed by about three weeks of one-off and short games. There's no agenda about what games get played: people propose games they want to run and the most popular ones get played. See the <a href=\"https://www.mk-rpg.org.uk/Current_games\">Current Games list</a> for what we're currently playing.</p>\n<p><span>We meet every Tuesday evening, 20:00 - 23:00, at York House in Stony Stratford, Milton Keynes. Just come along when you feel like it, no need to wait for the start of a block.</span></p>\n<p><span>The cost of hiring the venue works out to about £14 (£7 concessions) per person per month, but your first two sessions are free, so you can see what's on offer. There's no profit involved, it's purely costs.</span> <br></p>\n<p>Note that this meetup group is purely for letting people know about the club; the club predates Meetup so we don't use this site for organising ourselves.</p>","city":"Milton Keynes","state":"B9","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"31761898","name":"Poker Cash Games, London","link":"https://www.meetup.com/poker-playhouse","description":"<p>Poker Playhouse games (Bounds green only) and other non-affiliated London Cash games. </p> \n<p>John [Admin]</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"26624008","name":"DicingWithLife - Romford RPG and Dungeons and Dragons","link":"https://www.meetup.com/romforddnd","description":"<p>Calling all dwarves, elves, humans, orcs, aliens (or people who want to avoid aliens...), vaesen, ensigns, lieutenants and captains... and any other creatures of adventure looking for some people to share the journey with. If you want to play RPG's including Pathfinder, D&amp;D, Alien, Star Trek Adventures and Vaesen with a friendly, supportive and fun group then come along and find us on Monday evenings at the Golden Lion in Romford Market Place.</p>\n<p>Romford RPG and D&amp;D runs as part of Dicing With Life, the overarching community games club, which also runs gaming sessions every Saturday at the Hope Cafe venue in Romford, and includes tabletop games, CCG's, RPG's, and video gaming.&nbsp;</p>\n<p>You do not have to bring or prepare anything (although you are welcome to if you want!). We have dice and dice trays available, and if you've never played before we will support you to develop a character and understand the rules of the game you are playing. If you do have dice, paper and pencils, please bring them with you.</p>\n<p><b>Please RSVP to the event so we can get an idea of numbers. Spaces will be limited and will be on a first come first served basis.</b></p>\n<p><b>Currently the group is quite busy and so it is recommended to message in advance and check that there is space available at a table before coming along for the first time. We have a friendly WhatsApp group&nbsp;you are welcome to join too if you'd like to meet other players and chat about the games we are running - click on the link&nbsp;https://chat.whatsapp.com/FbqEruQoRxJJ9Nr2880CaZ and don't forget to say hello - you'll be greeted warmly :)</b></p>","city":"Romford","state":"E4","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35325365","name":"Wallingford Dungeons & Dragons 5th Edition","link":"https://www.meetup.com/wallingford-dungeons-dragons-5th-edition","description":"<p>We are group of people living around Wallingford that love playing Dungeons &amp; Dragons 5th Edition.</p><p>If you are wandering around Meetup in search of people to play D&amp;D 5e, please stop, you have found the group your are looking for!</p><p>No matter if you just heard of D&amp;D and intrigued by the idea of trying it, no matter if you are a veteran in search of new people in Wallingford, no matter how old you are, we accept everyone that comes to have fun and explore the fantasy multiverse of D&amp;D 5e.</p><p>This group was created in June 2021 to gather everyone around Wallingford together and organize play events for all ages. You will find parents that want to introduce the game to their children, and you will find grown-ups that still wants to play and don't want to stop.</p><p><br /></p><p>Please join the discord server <a href=\"https://discord.gg/dJb98z2KJE\" target=\"_blank\">https://discord.gg/dJb98z2KJE</a> where we discuss and plan games and events.</p><p><br /></p><p>Anyone under the age of 18 attending an event organized by this group must be accompanied by an adult.</p>","city":"Wallingford","state":"K2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"27506673","name":"East-End Loose-Enders: Quizzes/Games/Movies for N1/N16/E8ers","link":"https://www.meetup.com/east-end-loose-enders-quizzes-games-movies-for-n1-n16-e8ers","description":"<p>How long is a Blue Whale calf when it's born? <br>In which country is Bandaranaike International Airport? <br>What metal is the main constituent of Pewter?</p>\n<p>If, like me, you have no idea about the answers to any of those questions, but are willing to throw caution to the wind and guess - then let's get quizzical.</p>\n<p>This is a new 2018 Meetup group for fellow freaks and geeks around Islington, Stoke Newington &amp; Dalston, who are interested in forming teams for things like pub quizzes, games nights and escape rooms, or catching a film / gig locally.</p>\n<p>(<span>Answers: 22ft, Sri Lanka, Tin)</span></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36354358","name":"Online Social chess","link":"https://www.meetup.com/meetup-group-knidznlh","description":"Hi everyone, I am organizing this event to **meet interesting people** and **catch up with old ones** over a game of chess.\n\nI am far from being a chess professional, i'm just a guy who enjoys the game. This place is **open for people of all levels**.\n\n**Masterspace** allows people to **play, learn and talk** from the comfort of your own home. I am excited for you to try it out!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36191780","name":"Catch or Catfish? - Dating Events (London)","link":"https://www.meetup.com/catch-or-catfish-london-dating-events","description":"***At Buckbuck Games, we believe in bringing people together! Games with live human interaction stimulate collaborative and communicative instincts that quite simply - feel bloody brilliant! Let's uplift some spirits and make some connections...***\n\n📣 Introducing our brand new event - Catch or Catfish? 📣\n\n𝗠𝗘𝗘𝗧 𝗥𝗘𝗔𝗟 𝗦𝗜𝗡𝗚𝗟𝗘 𝗣𝗘𝗢𝗣𝗟𝗘... 𝗔𝗡𝗗 𝗢𝗡𝗘 𝗡𝗢𝗧 𝗦𝗢 𝗥𝗘𝗔𝗟!\nBored of swiping and awkward first dates? Try a more exciting way to break the ice in this brand new dating event!\n\n❇️ Meet new people in a speed dating-style format.\n\n❇️ Get to know each date through fun mini-games, where outlandish ideas earn points. (The player with the most points wins a BOTTLE OF WINE!)\n\n❇️ Find a match and we'll put you in touch.\n\n❇️ One participant will be a secret Catfish - an actor with a false name, identity and backstory. They will attempt to complete secret objectives that aim to sabotage the romance!\n\n❇️ Work together to figure out who's lying. Score BIG POINTS for being the super sleuth who correctly catches the Catfish!\n\nTickets and FAQs here:\nhttps://www.designmynight.com/london/pubs/hackney/peoples-park-tavern/catch-or-catfish\n\n𝘉𝘶𝘤𝘬𝘣𝘶𝘤𝘬 𝘎𝘢𝘮𝘦𝘴 𝘤𝘳𝘦𝘢𝘵𝘦 𝘴𝘢𝘧𝘦 𝘢𝘯𝘥 𝘴𝘶𝘱𝘱𝘰𝘳𝘵𝘪𝘷𝘦 𝘴𝘱𝘢𝘤𝘦𝘴 𝘧𝘰𝘳 𝘵𝘩𝘢𝘵 𝘨𝘰𝘰𝘥 𝘰𝘭’ 𝘴𝘵𝘶𝘧𝘧 𝘸𝘦 𝘶𝘴𝘦𝘥 𝘵𝘰 𝘤𝘢𝘭𝘭 𝘱𝘭𝘢𝘺𝘵𝘪𝘮𝘦! 𝘊𝘰𝘮𝘦 𝘨𝘦𝘵 𝘴𝘰𝘮𝘦! 18+","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"29577044","name":"Geek Hub AL10","link":"https://www.meetup.com/hatfield-welwyn-gamers-board-miniature-rpg","description":"<p>Geek Hub AL10 welcomes you. &nbsp;Join us for board, war and roleplay gaming.</p>","city":"Hatfield","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false}]