[{"id":"32563524","name":"Bromley and Beyond Entertainment Society","link":"https://www.meetup.com/bromley-and-beyond-entertainment-society","description":"All are welcome but we are a primarily a group of fun- loving over 40s who enjoy a wide range of events in Bromley, the surrounding areas and London.\n\nSo if you are finding it difficult to expand your social group or feel stuck in a rut, join us for theatre, quizzes, cinema and many more fun events.\n\nYou will need to become a full member with an annual fee.\n\nThe membership fees are charged primarily to cover charges by MeetUp to host the site and any profits will be invested back into the group with both a summer picnic and Xmas Party.\n\n**THE BORING BIT BUT PLEASE READ.**\n**Please ensure your profile includes a picture of yourself. This is so we can identify you at your first event.**\nPlease only join if you can attend an event within 3 months as we like to get to know all our members. \nThis is primarily a group for people who want to socialise and make new friends. Please do not send unsolicited messages to other members. This will result in removal from the group.\nThere is often a waiting list for events so if you can not make an event, please change your RSVP to no as soon as possible. \nIf you need to cancel on the day, please contact your organiser directly and not by leaving a comment on the site.\nThree no shows will result in removal from the group.","city":"Bromley","state":"G5","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"29633333","name":"GIN (Gay Indian Network) The LGBTQIA Indian Network in UK","link":"https://www.meetup.com/gin-gay-indian-network-london","description":"Connecting (and supporting) the LGBTQIA community of Indian Heritage and the wider Diaspora with each other and their friends and allies in London and the United Kingdom.\n\nGIN is a fun and sociable networking group for LGBTQIA community of Indian origin and their friends and allies that would like to get to know each other in a friendly group.\n\nWe have around 5 meetups per month (both physical and online). We also have a monthly “deeper connection” Saathi conversation group.\nWe organise trips to museums, places of interest, Indian restaurants, LGBTQIA social support events, Bollywood and Bhangra playing LGBTQIA clubs, And we also have the occasional fun party or two 😃\n\nThis group is open to all LGBTQIA people of any nationality or race that are interested in getting to know more about India and people of Indian origin.\n\nTo help our members stay connected, we also have:\n\n1\\. GIN & Lime Womens' group\\.\n\n2\\. GIN Book Club & GIN Film & Arts Club\\.\n\n3\\. GIN 1 to 1 Buddy Telefriending Service\\.\n\n4\\. GIN Midlands for members in Birmingham\\, Coventry\\, Leicester\\, Nottingham\\.\n\n5\\. GIN & Bombay Tonic Whatsapp Group with over 140 members\\.\n\nWebsite:\n\nhttps://www.gayindiannetworklondon.com\n\nTwitter: @GINindianUK\n\nInstagram: @ginindian\n\nLIABILITY WAIVER: GIN LGBTQIA Indian Network Meetup Group (\"GIN\")\n\nBy joining the GIN Meetup group and signing up for or attending any event, you acknowledge and accept the following Liability Waiver:\n\nI do hereby absolve, release and waive any and all civil or criminal liability litigation claims or demands against GIN (including its Organizer, Assistant Organizers, and event hosts), which may arise out of or be related to any injury, illness, damage or monetary loss to me, my guest(s), or any member(s) of my friends and family by reason of involvement in any group or group-related activities.\n\nBy joining GIN, I accept this waiver, and hereby acknowledge that I am solely responsible for my own safety during any event or group-related activity and that, if intoxicated, I will not operate a motorized vehicle after leaving any GIN meetup event.\n\nOur website is: \\\n\n[https://gayindiannetworklondon.com](https://gayindiannetworklondon.com)\nAnd you can follow GIN on Twitter: \\\n\n[https://twitter.com/GINindianUK/status/1329945689804206081?s=08](https://twitter.com/GINindianUK/status/1329945689804206081?s=08)\nAlso on Facebook: [https://m.facebook.com/GayIndianNetwork.UK/?ref=py_c](https://m.facebook.com/GayIndianNetwork.UK/?ref=py_c)","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"24841696","name":"Bexley and Bromley Belles","link":"https://www.meetup.com/bexley-and-bromley-belles","description":"We are a group of ladies 45+ looking to meet new friends in Bexley Bromey and surrounding areas. We enjoy eating out, fine dining, theatre, cinema, visiting London, walks, afternoon teas and breaks away.\nTo join there is a membership fee of £5 From then on fees are £10 every 6 months due in January and July.\nMembers are encouraged to organise their own events if they wish to.\nAnyone not attending an event in 6 months or cancelling 4 times in a row will be advised and taken off the group. This will keep the group active and not just ‘full of numbers‘.\nIf for any reason you can't make an event please change your RSVP. This enables others to take your place and also means a likely refund of any monies already paid. Please note refunds can only be given if replacements are found. Anyone with 3 no-shows without changing their Rsvps will be taken off the group . Where deposits are asked for they are non-refundable. If an event is prepaid please pay by the stated date or no later than 2 weeks after event goes on the site. I will not be chasing payments up so if you haven’t paid you will be taken off the event.\nOnly people with photos on their profile with be accepted into the group - no animals flowers or cartoons please.\nThe aim of this group is to be fun, friendly and to try new places and things to do. We look forward to welcoming you.\nDisclaimer: this group does not take any responsibility for injury or loss during events or changes of times dates and venues that are unavoidable.\n\\\n\n\n\\","city":"Bexleyheath","state":"G5","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"2466962","name":"BLACK FEMALE FRIENDSHIP","link":"https://www.meetup.com/the-london-black-female-friendship-group","description":"<p>I decided to start this group as I was looking to bring together black females for authentic and genuine friendships. It's as simple as that really but it will be so rewarding, because just having one friend can bring you so much joy.</p><p>As we grow older friendships change, as do circumstances, our girlfriend circle gets smaller and smaller.. until we're left with that one slightly unreliable friend.</p><p>So I'm looking to bring together a group of black or mixed females, on a first come basis, to go out to places of interest - mainly black events, but non black also, wine bars, restaurants, birthdays, holiday &amp; weekends away, cinema, shopping, theatre, jazz festivals anything goes!!</p><p>So now, after reading all this and you still want to meet more women like you, then please join. Also note, our meetups will generally be held over the weekends as this is most best for most people and the weekend is the best time to have some fun....Stay blessed. &lt;br&gt;</p><p>&lt;br&gt;</p><p>Please note that two No Shows will result in removal from the Group (which no one wants). If there is a waitlist of over 20, one No Show will result in removal, so updating your invite is required.</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36316952","name":"London Skate Group","link":"https://www.meetup.com/london-skate-group","description":"Welcome, all rollerskaters and rollerbladers ❤️\n\nThis is a group for people who want to meet other skaters regularly in London parks. It doesn't matter if you're a new skater or a seasoned veteran - this is for ALL of us to meet, have fun and skate our mighty hearts out.\n\nWe can teach each other new tricks, skills and techniques and of course, build new wonderful friendships too.\nOn days when the sun is out, we can picnic + skate, music + skate, laugh + skate - as long as there is skating involved we're good.\n\nI started this group because I want to get back into rollerskating after a 20year hiatus 😅and I just couldn't find a community where I felt relaxed enough to release my anxieties.\n\nAlso, I want this to ideally be a free group so that everyone can join without financial restraints.\n\nTo join the group you must have your own skates, protective helmet and wrist guards (at least).\n\nI look forward to skating with you soon.","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"4721202","name":"Up In The Cheap Seats - Enjoying London Theatre","link":"https://www.meetup.com/up-in-the-cheap-seats","description":"Welcome to **up-in-the-cheap-seats**. This group aims to bring together people who share a common aim - to *see theatre at reasonable prices*.\nAll are welcome at our events - We've met so many lovely people and everyone has been so friendly and enthusiastic. Group sizes vary so we can meet up before and get a chance to talk to each other. We have a great group of organisers with varied tastes and interests; which keeps our calendar filled with mainstream and more eclectic events.\nWith over **2,200 events** in the 10 years we've been going, the variety of shows we've seen is immense. We see a mixture of musicals, plays, opera, ballet, music, comedians and films and are always open to new suggestions! A calender of our events can be found here: [https://www.meetup.com/Up-in-the-cheap-seats/events/calendar](https://www.meetup.com/Up-in-the-cheap-seats/events/calendar)\n**There is a one-off joining fee of £2.50** to be a member of **up-in-the-cheap-seats**. These funds will be used to cover the meetup fees and cover expenses associated with running the group. \n\nPlease note, if you are an inactive member for many months (i.e. if you don't log into the website or don't attend any events), you will be removed from the group as we encourage this group to be as active as possible.\nSo......how does it work? \n\n**We buy our own tickets.** Your event organiser will add a link on the event invitation so you can buy your ticket at the same price that they enjoyed. Obviously the price is not guaranteed especially if the show is popular or you wait a few days before booking.\n\n**Please update your RSVP to confirm that you are joining us.** The organiser will normally add a comment to the event page saying which seat they have purchased. This isn’t mandatory but helps others decide on their seat selection – it is always nice to be sat near or next to another member of the group! The group does not charge to attend individual events (just the one-off £2.50 joining fee). Therefore Meetup states that the event is free. This does not mean that your ticket is free - you will need to purchase this yourself.\n\nThe event host will post the meet up details a day or two before the show.\n\nWe usually meet outside the theatre or in one of the theatre's bars around 30 minutes before the show.\n\nIf there is an interval we will meet up again in the bar at the interval so we can all share our opinion of what we have enjoyed (or not!) so far.\n\nWe will also usually meet up afterwards for a brief chat about the show but sometimes (depending on how late it is and the day of the week), we may go on somewhere for a drink and a longer chat.\n\n**If you are unable to make an event, please change your RSVP** so that your host knows not to wait for you.  \n\nHope to see you at an event soon,\n**Your UITCS Oraganisers**\n\\*Please note, this group does generate a lot of email, but the good news is these settings are customisable, and can easily be changed by going to 'My Profile', then 'Emails' and 'Notifications'.","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"33123951","name":"Walking and Wine Women's Group","link":"https://www.meetup.com/walking-and-wine-womens-group","description":"A women's social group for over 40's based around Ealing/West London.\nWalking and wine are two of my favourite things along with good company, food and occasional gallery/film/theatre - events will reflect this. Locations will be a combination of local, central and further afield green places.\nIdea is to have a relatively small active membership group (capped at 70) with events of around 6-8 people so everyone can get to know each other.\n\nMembership notes:\n\\*A photo showing your face is required to join this group.\n\\*Please sign up to events with consideration, 'no shows' or late cancellations will likely result in member being removed from group.\n\\*To maintain a small active group non-active members will periodically be removed.\n\nIf you have ideas for events or would like to host your own let Babs know.\nBring with you a friendly, generous and inclusive attitude.","city":"Brentford","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"1600796","name":"Social Buddies (Middx Area)","link":"https://www.meetup.com/socialbuddies","description":"> **Are you looking to improve your social life and make some new friends?**\n\n**Then come along to Social Buddies!**\nSocial Buddies is a lively, fun, social club for the 35+ age group with many events each month, mainly in the Middx area.\nOur events include quizzes, pub nights, meals, live music/tribute bands, comedy nights, theatre, cinema, coffee mornings, craft events, days out and walks to name a few.\nAs well as attending events we especially welcome new members who are keen to host events themselves. The more people that do this the more events we can offer!\nThere is a joining fee of £10 which helps to cover admin and website costs. This fee is payable no later than 8 weeks after joining.\n\nPlease use your real name when joining and have a recent photo of yourself (clearly showing your face) as your profile picture. This helps members put a face to a name at events and know who to look out for.  Failure to do this will result in your membership being rejected.\nIf you require further information please email socialbuddies@gmail.com.\nWe look forward to meeting you at an event soon.\n**Don't sit at home on your own - come out and have some fun with Social Buddies!**","city":"Ruislip","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"11148652","name":"Metropolitan Walkers - walks in London and the South East","link":"https://www.meetup.com/metropolitan-walkers","description":"**Metropolitan Walkers is the largest London-based Ramblers group for people in their 20s and 30s.**\n\nAll our planned walks can be found at [https://www.metropolitan-walkers.org.uk/wal...](https://www.metropolitan-walkers.org.uk/walks) We publish to MeetUp to showcase our activities to a wider audience!\n\nIf you've not walked with us before, you’re welcome to come along on three free walks before becoming a member, to see if Met Walkers is for you! Membership is just £34.50 per year, or £20.50 concessionary rate.\n\nWe’re a very active group. Our volunteers lead walks every weekend, ranging from short, leisurely walks to strenuous hikes of 17+ miles across hilly terrain. We also lead one evening stroll during the week, discovering different parts of the capital.\nWe explore the beautiful areas near London such as the North Downs, south coast and Chilterns, all of which are accessible by public transport.\n\nA lot of our members walk regularly, which is a great way to form friendships. As well as walking, we have a regular social programme.\n\nWe regularly run weekends away to explore the other great walking areas the UK has to offer, such as the Lake District, Snowdonia and Scotland, and have also put on several trips abroad.\n\nWe’re part of the Ramblers – the charity that helps everyone, everywhere, enjoy walking; and protects the places we all love to walk.\n\nFollow us on Instagram @metwalkers [https://www.instagram.com/metwalkers/](https://www.instagram.com/metwalkers/)\nFollow us on Twitter @metwalkers [https://www.twitter.com/MetWalkers/](https://www.twitter.com/MetWalkers/)\n![](https://secure.meetupstatic.com/photos/event/a/7/0/4/600_432942756.jpeg)\nRegistered charity 1093577. Metropolitan Walkers is a part of the Ramblers - Britain's walking charity.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34884576","name":"Guildford Friendly Meetup - Friendships, Events & Activities","link":"https://www.meetup.com/guildford-friendships-events-and-activities","description":"<p>A group for people based in and around Guildford, UK to enjoy life and make friends!</p><p>As we emerge from lockdown, events in this group will be very varied and include Walks, trips to Restaurants, Festivals, Theatre, Cinema, Bowling, Pubs, ice skating and trips to London to name a few examples.</p><p><br /></p><p>We are very open to new ideas, this group will be a collaborative effort and led by the interests of members. If you have a suggestion for something fun to do, don't hesitate to get in touch.</p><p><br /></p><p>We really looking forward to seeing you and to the fun events we'll arrange together 😊 we're always on the look out for event organisers, so drop us a line if you want to help!</p>","city":"Guildford","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1403494","name":"Chillout London","link":"https://www.meetup.com/chilloutlondon","description":"Bringing like-minded people with the same passions together in a fun social setting for FREE. Whether it's a particular genre of music/club night/dancing,  theatre/acting, food, singing/rockaoake, sports/fitness, comedy, art, pub crawls, cutting edge science, spirituality actvities - we host free fun themed events to ensure only like minded people with the same passions get to meet and particpate as life is too short to spend time with people who do not excite and or engage you.\n\nOur membership is biased towards successful but unpretentious career professionals with highly engaging personalities who are are socially skilled, outgoing, intellectually curious and creative with outstanding sense of humour! We value quality over mediocrity so attempt to constrict attendees to people with an authentic love of the event theme to both foster good engagement dynamics & keep attendees to a manageable size.\n\nOur London events are hosted by a born Londoner who know the city and hidden gems inside out! We also avoid holding events in touristy/sleazy venues so attendees get to enjoy authentic London venues & experiences and meet native brits anf form long lasting connections easily. Typical past events have included stargazing, rockaoke, music themed clubbing events (80s, 90s, 70s, 50s, Hip Hop & Reggae nights), sports events (badminton, rounders, tennis), Halloween pub crawls/tours, exhibitions, dinners/food tasting/supper club, lunches/brunch, coffee, firework displays, talks/seminars, concerts - you name it - we've done it!\n\nWaiting lists wise - when places become available, preference will be given to people with complete profiles who can demonstrate a genuine passion for the event theme, to the most loyal members and those with a close proximity to event location so it is parmount you fill out your profile!!\n\nAnd here at Chillout, our philosophy is you shouldn't have to pay a premium to enjoy the things that you love so in accordance with the fundamental founding tenet of Meetup - the vast majority of our events are free - no profit motive here! However in rare cases, where direct or venue hiring costs are incurred for putting on a specific event, there maybe a small charge.\n\nSo, whether you’re originally from London or brand new to the city, here's to enjoying some memoriable crazy times out with a select audience and even forming strong new authentic long lasting connections along the way.\n\nLucas - Founder & Organiser (and essay writer!)\n***Please note, if you are identified to having different motives for attending events other than for socialising around a shared theme that you are truly passionate about or found to be harassing members or seeking sexual conquests you will be removed. For security screening and protecting our members - everyone must have a full face pic prior to attending an event so they can be indentified in the case of any issues. If any ladies recieve unsolicited contact from random people they have never met please feel free to report to me (so I can remove) and contact meetup site directly.*** \n\nFeel free to follow us on Twitter to Keep updated with new events here:\nhttps://twitter.com/Chillout_London\nhttps://twitter.com/LucasBulsara\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAnd now for some blatant testimonial marketing (generous bank transfers on way):\n\n\"His energy, event passion, beauty and brief conversation shifted my mindset tremendously in less than a few minutes which is very rare when attending meetups\" Clare\n\n\"I went to Chillout London when I was new to the city from the USA and I always had a really great time. Everyone was super friendly. Lucas always has cool captivating themes and I always felt deeply engaged, never bored. I would definitely recommend!\" Staci Schidmt\n\n\"The organiser is late often and as a former teacher I have no idea how he made it through school or university without being expelled but his events are so novel & addictive I just can't stay away\" Reena Teacher\n\n\"Meeting Lucas and attending his event was a lovely experience. He had so much knowledge and passion. It was really good. Very impressive\" Komal\n\n\"It's about time Lucas grew up, got a girlfriend/got married like the rest of his mates instead of wasting his time on this meetup nonsense. He should be hanging out with his real friends!\" Adam Joslin\n\n\"The organiser is one of the funniest entertaining people I've met. He is really passionate about all his event themes and so there is always an air of excitement and never a dull moment. Now I'm a semi regular - I always leave either learning something new or laughing on the way home\"  Lorraine Norton\n\n\"Organiser jokes around a lot but I love him. When he was DJing at his club event party he refused to play Never Tear Us Apart for me so if you like good music I suggest you avoid Chillout events\" Dominika Abel (Assitant Organiser)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36419841","name":"Bored in West London. Ages 35 to 55, all of 40s","link":"https://www.meetup.com/bored-in-west-london","description":"Enjoying life without breaking the bank.\nKeeping it local but Posh.\nStylish and smart.\nLet's enjoy the summer together.\n\nCome along to any of our meetups all around West London and beyond.\n\nFun and lively Picnics. \nCocktails and drinks. \nMuseums/houses/castles. \nEaling Festivals. \nComedy Nights. \nDickings Yard. \nTheatres. \nHammersmith Apollo. \nMore random Picnics. \nMid morning coffee/cold juice. Westfield or other trendy locations. \nSlow motion dating/getting to know you picnics. \nFriday evening hangouts. \nRunning. \nWalks. \nLive Music. \n\nMembers are encouraged to suggest activities so that we can have a variety of events.\n\nLet's get together for activities in our neighbourhood, feel free to message and suggest anything that looks like fun.\n\nTo serve different members of the group, we will aim to schedule a diverse range and types of meetups. This can be at weekends or evenings, daytime or weekdays. Everyone's life is different and not everyone is 9-5 and free at weekends and evenings, so we will endeavour to schedule events to cater for different folks.\n\nLooking for members to get involved with planning! 4 co-admins needed, message me.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":true},{"id":"7373422","name":"45+ Not grumpy old Londoners!","link":"https://www.meetup.com/45-not-grumpy-old-londoners","description":"<p>This is a group for those of us who accept who we are and like who we are - do things alone however would prefer to share some of our leisure time with like-minded. We are interesting and interested in so much...walking in the countryside, travel, week-end breaks, playing cards, theatre, opera, dining, visiting galleries, exhibitions, playing tennis perhaps, book club, art.......it would be good for members to come up with ideas that we can join in with...we're not necessarily 'grumpy old' but do not like loud music, gum chewing or bootcamps!&nbsp;</p>\n<p>Please note that photographs and/or video recordings may be taken at a 45+ Not Grumpy event. If you do not want your photo/video published online, please notify the group leader of this.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36382801","name":"London Food Fun and Travel Group","link":"https://www.meetup.com/london-food-fun-and-travel-group","description":"This group is for anyone wanting to get out and about and meet new people.\nThe group is open to both men and women over 35\nFood, travel and new experiences including walks, theatre and dancing.\nPlease make sure your profile picture is of you and not your pet or garden.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36152115","name":"Encore: Theatre and Events for Friends to Enjoy","link":"https://www.meetup.com/meetup-group-gdjepjbm","description":"Encore: Theatre and Events for Friends to Enjoy is a friendly and sociable not for profit group, primarily based around South Bucks, Gerrards Cross, Chalfonts, Amersham, Chesham and surrounding area. However, if you don’t live in that area you can still request to join if able to travel to and from events.\n\nIf you are 40+ and looking for new friends and things to do why not give us a try?\n\nTheatre has always been a key aspect of our group and we have been to numerous performances over the years since the group started in June 2016. We have had some challenging times during the Covid Pandemic but we are now beginning to look at putting on more events as people begin to venture back out on the social scene.\n\nApart from Theatre our events can be anything from comedy nights, party breaks, quiz nights, outings, music nights, cinema, meals out, walks, guided tours, picnics, informal parties etc.\n\nThe extent and number of events will depend on what people are prepared to offer to the group. The organisers are not able to do everything so we are particularly interested in new members who are willing/able to host/organise events.\n\nWe appreciate not everyone is comfortable with uploading a face photo but this is preferred if possible as it does help with identification when meeting up for events (especially new people). However, if you prefer just add a photo of anything to get through the photo required section.\n\nAlso with new members there is an admin/joining fee required (currently £5 for individual membership or £10 for plus one membership) to go towards MeetUp fees.\n\nEncore: Theatre and Events for Friends to Enjoy is a Closed Group (acceptance for membership is at the discretion of organisers subject to availability). Please do not be offended should it not be possible to accept a request to join. This is more likely if you already belong to 10 or more other MeetUps as we are looking for active members and if you already belong to loads of other groups that's unlikely. If accepted you will need to attend at least one event every year (but hopefully you will want to join us at many more that). Current members can also recommend people to join the group.\n \nWe hope you will enjoy being a part of Encore and if you have an idea for a show or event please let me know and we will investigate, or better still have a go and organise it yourself as it will be possible to add extra organisers to Meetup.","city":"Chalfont St Peter","state":"F8","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"25899298","name":"FRENCH LONDON EXPERIENCE - FLE","link":"https://www.meetup.com/french-london-experience-meetup","description":"\"You will love French, the French and France\". \n\nFrench London Experience is an intiative that I've launched to promote connections between French and British cultures. \n\nIt offers various ways to practise your French and to learn about French culture. We have a lot of events and services to improve your knowledge about France, its people, culture, history, political organisation, culinary traditions, way of life and way of working, and much more... \n\nThe activities take place in different forms - meetings, one-to-one, small groups, sessions, lectures, guided tours - in a variety of venues such as cafes, parks, companies, theatres, cinemas, gardens, exhibitions, museums, meeting rooms, and online.\n\nAttendees will be encouraged to engage in different ways along events.\n\nLast, a native French professional, I offer private tuitions and can reply to a various range of specific requests from lessons to works or any support in French (training, welcoming, writing, speaking, voice-recording,...)\n\nKeywords are ENTHUSIASM, ADAPTABILITY and PASSION\n\nAny question or request?\nDrop me a line frenchlondonexperience at gmail dot com\n\nWebsite\n[https://www.frenchlondonexperience.com/](https://www.frenchlondonexperience.com/?fbclid=IwAR3AqarNR1W5yav_DL1dCNuQddEOSgDju762CbuIV2HbknnrL4z8rB2Iqas)\n\nList of public events:\n[https://www.meetup.com/French-London-Experience-Meetup/](https://www.meetup.com/French-London-Experience-Meetup/?fbclid=IwAR3AqarNR1W5yav_DL1dCNuQddEOSgDju762CbuIV2HbknnrL4z8rB2Iqas)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36410037","name":"North West London Lesbian and Gay Group","link":"https://www.meetup.com/north-west-london-lesbian-and-gay-group","description":"An all inclusive and friendly gay and lesbian social group meeting weekly in Harrow.\n\nWe have been meeting locally for 51 years. We are a friendly, welcoming LGBT local group meeting every Tuesday from 8pm in the upstairs bar of The Trinity, 380 Station Road, Harrow HA1 2DE.\n\nOur group organises a variety of interesting events and welcomes LGBT-friendly people to join us. We attract our membership from the boroughs of Harrow, Brent, Barnet, Hillingdon, and other parts of London and Hertfordshire.\n\nSome members play tennis and badminton. For further information please email us - details below.\n\nEmail: nwlgay@mail.com\n\nSunday Gay Badminton: sundayshuttles@gmail.com\n\nWebsite: https://nwlgay.com\n\nOur Facebook page: https://www.facebook.com/NWLGG/","city":"Harrow","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"34562524","name":"West Herts AAA Social","link":"https://www.meetup.com/west-herts-aaa-social","description":"<p>Welcome to a new Meetup group, for people who live in Hemel Hempstead, Watford, St Albans, Berkhamsted, Bovingdon, Tring, Rickmansworth and surrounding areas. It’s for people who’d like to take part in social activities on a regular basis, meet new friends and lead an active social life.</p> \n<p>We aim to discover unique and unusual local activities and events, together with regular, more traditional Meetups like pub nights, meals, cinema/theatre, live music, semi-guided walks etc. Our aim is to compliment activities to your own social calendars. </p> \n<p>We welcome new ideas and always encourage members to share with us your thoughts for future events.</p> \n<p>Most events will be free however occasionally we may suggest members make a voluntary (not mandatory) small contribution (for example £1 on a walk) to help cover the cost of having this group on the Meetup site. (Sadly it’s not a free service to the Organisers!)</p> \n<p>In addition, we ask that all members keep in mind the fact that our Event Organisers are hosting their events completely voluntarily, in their own time and we need to make the events as straightforward as possible for them to run. The absolute basic requirement of all members is therefore to ensure that you keep your RSVPs up to date. If you put your name down to attend an event and later cannot make it, you need to be fair to all parties involved and click on ‘Edit your RSVP’ to ‘Not going’ ahead of the event. Try not to leave it to the last minute if possible as there will quite often be people on a waiting list wanting to go, should a place become available.</p> \n<p>The most important thing about this group is to feel safe, relaxed, included and above all, have fun 😇</p> \n<p>Risk Disclaimer:<br>Please note that all members take part in all activities solely at their own risk, should any personal loss, accident, illness or physical injury occur during an event.</p>","city":"Hemel Hempstead","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"315983","name":"The London Cultureseekers Group","link":"https://www.meetup.com/london_cultureseekers","description":"**Welcome to the London Cultureseekers Group!**\nIf you're interested in exploring London's history & culture with other like minded people, then this is the only group you need to join! We are London's largest cultural and history group!\n\nWe meetup 2-3 times a week to explore museums, art galleries, historical buildings, go on guided walks and history talks. We also have historic treasure hunts, visit the theatre, have coffee evenings, social evenings, meals and attend classical music concerts. In the summer we also have day trips outside of the capital by train or coach to explore historical towns and walks in the countryside.\n\nThe group is very friendly, we have members from 20 to 80 years old, across all backgrounds. The group has been running for over 15 years and is a great way to meet and make new friends. Plus after events we generally head to a local pub or cafe to chat.\n\nYou can either pay as you go at events or we do have an optional annual membership fee (details below).\n\n**Membership Fee**\nThe group charges an optional annual membership fee of £13 per person.\n\nBenefits of paying the membership fee and becoming a Full Member are:\n\n* *Discounted entry at 11 museums and galleries around London (You can view them here: [www.meetup.com/london_cu­ltureseekers/sponsors](http://www.meetup.com/london_cu%1fltureseekers/sponsors))*\n* *10% discount on any purchases at Foyles bookshops or from their website*\n* *All treasure hunts we do will be FREE (normally £6 each)*\n* *The 'Wren City Churches', 'Charlie Chaplin', 'Roman Wall', 'Have I Got Mews For You', ‘What’s in a Name’ and 'Shakespeare's London' Guided Walks will all be FREE (normally £6 each)*\n* *All talks the group does will be FREE (normally £6 each)*\n* *All Thames foreshore visits will be FREE (normally £6 each)*\n* *Guided highlights tour around the Museum of London & Museum of London Docklands will be FREE (normally £6 each)*\n* *All ‘London’s Lost Rivers’ hikes will be FREE (normally £6 each)*\n* *All day trips by train out of London will be FREE (normally £6)*\n* *All coach day trips out of London will be discounted by £6 per trip*\n* *All the Blue Badge guided walks we do will be discounted by £2 per walk*\n* *Entry to 20-30 paying museums & historical buildings that we visit across the year will be discounted by £2 each*\n\nOnce you pay the membership fee, you will receive a membership card, go to ([https://www.meetup.com/london_cultureseekers/dues](http://www.meetup.com/london_cultureseekers/dues)) to pay online or you can pay cash at an event.\n\n**Events**\nHave a look at the page below to see what's coming up and where we have been. Cultureseekers is a brilliant place to make friends in London whilst experiencing some of the very best areas of culture and history which the city has to offer. We keep costs low and the quality high.\nOur events always go ahead, regardless of the weather. Feel free to email or text me if you have any questions or would like to suggest somewhere we can visit.\n\nClick on the video clips below to view our day trips to Bath and walking the Seven Sisters:\n[https://youtu.be/WAXipRxXtnc](https://youtu.be/WAXipRxXtnc)\n[https://youtu.be/06scGec8CcY](https://youtu.be/06scGec8CcY)\n\n**RSVP'ing**\nClick on the 'Join Us' button below, enter your details and then RSVP Yes to any events that you would like to attend, it's that simple! All new events get sent out on Friday evenings, so keep a lookout then.\nWhen you turn up for an event, look out for the red & blue 'London Cultureseekers Group' flag and then come over and say hello.\n\nPlease be aware of the groups rules, which you can read here: [https://www.meetup.com/London_Cultureseekers/pages/26449165/Group_Rules/](https://www.meetup.com/London_Cultureseekers/pages/26449165/Group_Rules/)\n\nHope to see you at an event soon!\n\nRobert - 07905 901 834 (text only please) / [general@cultureseekers.org](mailto:general@cultureseekers.org)\n\n**Follow us on:**\nFacebook: [https://www.facebook.com/LondonCultureseekers/](https://www.facebook.com/LondonCultureseekers/)\nTwitter: [@Culture_Seekers](https://twitter.com/culture_seekers)\nYouTube: [Cultureseekers channel](https://www.youtube.com/channel/UCnnip7xQzYaJ5u-Q4RRLj3w)\nThe group blog: [www.cultureseekers.blog](www.cultureseekers.blog)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18094372","name":"Hemel Hempstead Social","link":"https://www.meetup.com/hemel-hempstead-social","description":"Hemel Hempstead Social Meetup welcomes all, to meet new people, socialise, have fun, try new things and make new friends.\nOur social activities could include meeting for coffee or a drink, eating out, pub nights, live music, dancing, theme nights, cinema, theatre, comedy, arts & crafts, day trips, race days, bowling, quiz nights, games, book club, walks, picnics, afternoon tea, escape rooms, footgolf, bike rides, skating, trampolining, snowboarding or any other sports & leisure activities, museums, galleries and much more. We welcome all ideas. Events can be daytime, evening, midweek or weekends. Members are also encouraged to host events. The more event hosts we have the more events there will be for you to attend. Contact one of the organisers if you are interested & want help with this. All members are required to keep their RSVP's up to date.\nJust get involved, give ideas and organise your own events as well. Don't just sit at home on your own, come out, have some fun & start making new friends.\nPam, Karen & Steve","city":"Hemel Hempstead","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"33232020","name":"Magical Moments:In search of awe, adventure and exploration!","link":"https://www.meetup.com/become-an-adventurer-explorer-by-exploring-hidden-london","description":"Welcome!\nThis group has morphed from where it initially started which was an invitation to explore Hidden London. I have made a decision that every year the group will focus on a different way to explore our beautiful city and connect to likeminded people.\n\nFollowing the last 2 years of Covid and restrictions, it is only natural that we now all value the simpler things in life we might have taken for granted before, more deeply.\n\nI am inviting you to see your life, your world with new eyes....\nI am inviting you to become an explorer in your own city.\nAn explorer in the world.\nAn explorer with yourself and others.\nI invite you to awaken awe and playfulness and see what happens....\n\nWhether you have just moved to London or have lived here all your life, or if you live outside of London but always wanted to explore the forgotten or hidden parts of London, while meeting new people then this invitation is for you, if deep down inside you have an adventurer and explorer waiting to come out! All adults are welcome.\n\nI will be running a variety of events: my aim is to put events together that will unite people to come together in this amazing city (and sometimes even venture further afield!) and just have fun. And in the process slow down to really take in the beauty that is life and make magic moments. \n\n\n\n\n**IS THIS GROUP FOR YOU?**\nThis is for you if you are an adventurer/explorer at heart, you are open to new experiences, curious, energetic and enthusiastic about life and living in London and interested in exploring it in different ways. For me the lure of setting up this group wasn't just about getting out the house to see the city I have lived in for so many years but rather to explore London, in a new and exciting way! And it goes much deeper than that: it's about creating a sense of novelty, awe and wonder about our lives and our surroundings. For all we think we know so well and there's nothing left to discover, once we decide we are at heart \"intrepid explorers\" in our own lives and in our own city then we can choose to see everything around us with curiosity and fresh eyes and a renewed sense of wonder. It's an almost child like ability of playfulness, that we tend to lose as we become adults. This is what I hope to achieve with this group: recapture our sense of playfulness, discovery and wonder, while making connections with others! The magical moments happen when we are brave enough to explore and then make a connection with others on the same path!\n\n**MY EXPERIENCE:**\nI spent years working in top 5 star hotels as a Concierge so I got to know all the secret places that few people know about in London. In addition to that I have a passion for London and it's unique character and all the gems it hides in plain sight!I have escorted some friends and even business clients through London and they all loved how they were shown parts of London they didn't expect to see, and how much they enjoyed it! I am now also a Life Coach and Healer, so I love the idea of connecting people especially now following an extended period of Covid that will have affected our mental health and ability to connect with others. \n\nPlease feel free to drop me a line and suggest any events/activities you would like to take part in...all suggestions are welcome!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"23191778","name":"WYBTD? Will You Be There Darling? Gay Men Who Wanna Have Fun","link":"https://www.meetup.com/wybtd-will-you-be-there-darling","description":"<p>WYBTD (Will You Be There Darling?): Gay Men Who Wanna Have Fun</p><p>A free all-encompassing Meetup group for gay men who like to go out, be entertained and socialise. No more missing out on fun events because you have no-one to go with or are reluctant to go alone.</p><p>Covering all tribes from the pretentious culture vultures to the unapologetic trashy queens and everyone in between. Whether you are single, partnered or polyamorous there is something for everyone! We don't believe in gender stereotypes (such as masc/fem) or slut-shaming or body-shaming. We are all 'good gays' just maybe some are more shy or socially anxious than others.</p><p>All Meetups are organised by a friendly host whose prime responsibility is to ensure all new members are welcomed, introduced to the group and not excluded. We have very quickly built a great reputation for making everyone feel comfortable and welcome.</p><p>We don’t believe in boxes, labels or tribes - we are all QUEER! We welcome all MSM (men who have sex with men) regardless of where you belong on the GBTQ+ spectrum. So you are welcome to join us regardless of your social background, income, colour, ethnicity, disability, HIV status, size, age, shape or even hairiness. None of us are equal until ALL of us are equal.</p><p><br /></p><p>We have been called the “non-judgemental” Meetup group and we are rather proud of that!&nbsp;We love ‘teenagers of all ages’ but we also love queers who want to act either their age or even older, which is why we have events for all ages and personalities. So let’s go out and do more things that make you forget to check your phone!</p><p>We believe in disconnecting (at least temporarily!) from our mobile-enabled, click-bait geo-social networks and reconnecting in a meaningful way through face-to-face socialising instead. After all, we live in our brilliant London culture bubble, where we're used to having access to the crème de la crème of entertainment every night of the week, so let's take advantage of it!</p><p>We organise Meetup events of all kinds such as art galleries, cabaret, cinema, comedy, dance, museums, music concerts, spoken word poetry and theatre - as well as clubbing nights, cruising bars, drag shows and even sex parties!</p><p>A typical weekend's activities might look like this:</p><p>Friday: WYBTD Social in a private members club in Soho</p><p>Saturday: Art gallery in the afternoon. Off-West End play or independent cinema in the evening, followed by Clubbing</p><p>Sunday: Brunch, comedy cabaret afternoon at the Royal Vauxhall Tavern followed by Horse Meat Disco at the Eagle.</p><p>So regardless of whether you prefer Hard On or Kylie (or both at the same time!) join one of the most all inclusive Meetup groups for gay men.</p><p>Here is an article about WYBTD published recently by Gay Star News:&nbsp;<a href=\"https://www.gaystarnews.com/article/will-you-darling-meetup-london/#gs.972e1z\" target=\"_blank\">https://www.gaystarnews.com/article/will-you-darling-meetup-london/#gs.972e1z</a></p><p>Here is a discussion thread for members to write some short comments about their first time experiences with WYBTD: <a href=\"https://www.meetup.com/WYBTD-Will-You-Be-There-Darling/discussions/5665472998014976/chat/\" target=\"_blank\">https://www.meetup.com/WYBTD-Will-You-Be-There-Darling/discussions/5665472998014976/chat/</a></p><p>If you need to know more - check out the testimonials on the 'group reviews' section here:&nbsp;<a href=\"https://www.meetup.com/WYBTD-Will-You-Be-There-Darling/about/comments/?op=all\" target=\"_blank\">https://www.meetup.com/WYBTD-Will-You-Be-There-Darling/about/comments/?op=all</a></p><p>WYBTD's founder and main host, Michael, is a veteran of over 1,700 Meetup events! You can now find him on Instagram: michaelgaylondon</p><p>WYBTD started on 7 April 2017 and has already more than 6,500 members and a plethora of upcoming events - we have something most days, and sometimes three or four!</p><p>Will you be there darling?</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"4081012","name":"Golf and other sports Socialising","link":"https://www.meetup.com/ascot-sports","description":"Hi! We are a friendly active group mainly for people interested in golf, snooker, table tennis, and occasionally a few other sports/activities (e.g. cycling). Golf events are generally held in east Berkshire or north west Surrey, whilst other activities are mostly held in Ascot, Sunningdale or Windlesham.\n\nWomen and men of any age are welcome at our events (see also ' more details' below). Having fun doing sports or activities, whilst perhaps making some friends are the main aims of the group. Please ensure you have a photo of yourself when joining so that we can recognise you and welcome you when attending events (note: photos are only visible to members). Hope to see you soon!\n\nMore details:\n\n* Golf - organised most weekends (in Sunningdale, Ascot, or at one of several other nearby courses mainly in east Berkshire and north west Surrey) - usually over 18 holes (but at least once a month over nine). Further details lower down on this page.\n* Table tennis - at least once a month - for players of varied ability up to low league standard (though not suitable for complete beginners) - held at Charters leisure centre, Sunningdale\n* Snooker (or Pool) (at Lavender park, Ascot - during the week or at the weekend). Some experience needed for snooker.\n* Other sports/activities: Cycle rides (leisurely and on quiet roads or off-road) are organised occasionally (in Windlesham or Windsor Great park). Trips to watch sports or to play petanque may also be organised.\n* Please say on your profile which of our regular and occasional activities you are interested in! *Note: Badminton used to be organised (and coaching may still be available), but there is at least three other meetup groups in the area who regularly do this sport (plus some 'no strings badminton') further details available from Dave or David).*\n\n*• Note: If you are interested in bridge locally and online please go to: [https://www.meetup.com/Ascot-Sunningdale-Bridge-Meetup/](https://www.meetup.com/Ascot-Sunningdale-Bridge-Meetup/) .*\n\nThere are a roughly equal number of men and women in the group, and members are of various ages from 20's to over 60.\nTemporary local residents or visitors to the area from other parts or the country or from overseas are welcome to join if they regularly come to the area or before a visit.\n\\*If the group is 'full' there may be a delay in accepting you in to the group (but this will be done as soon as possible).\n\\*\\*If you are interested in organising a certain activity please contact Dave.\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\\*\\*: Golf details: Events are organised at Courses\\* to suit experienced, intermediate and improver players mainly. Cost usually £25 to £40 (for 18 holes). The area has some attractive and quite challenging golf courses. Novice golfers are recommended to come to golf at Lavender Park, Blackwater Valley or Billingbear Park. Other courses that we go to are largely only suitable for more experienced players. The golf courses we visit often or sometimes are Sunningdale Heath, Billingbear Park, Chobham, Downshire, Lavender Park, Pine Ridge, Sand Martins, Mill Ride, Royal Ascot, Sherfield Oaks, Hennerton, Hoebridge, Theale, Sutton Green, Pyrford Lakes and Blackwater Valley.\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nNotes:\n\\*: For 2022 there is a SMALL annual membership charge for active group members (at least), but there is no charge for your first event with the group (if done in the first two years of membership).\n\\*\\*: To keep the membership list up to date; because we have a maximum number of members, probably have a waiting list, and possibly to save money on meetup fees, a FEW/SOME inactive members only who have not paid the annual membership fee may be messaged to check they are still interested and active on Meetup (and if no response removed) or removed:\na) members who have not looked at our meetup site in their first 12 months of membership since the day they joined; or\nb) members who have been a member for less than two years, not looked at our meetup site for a year and who have not done any events; or\nc) members who have been a member for at least two years, who have not done any events, and who have not looked at our site for at least six months, or\nd) any member who has attended events before, who has not done any events in their last 3 years of membership and not looked at our meetup site for at least 12 months.\n*\\*\\*\\*Members removed can re-join on payment of the small membership fee. You can live a long way away, but please consider how busy you are on other activities and how far you live or work from the area and whether you will be able to attend events occasionally, before you re-join (note: we rarely do online events).*","city":"Ascot","state":"03","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"30753907","name":"Social Butterflies (Bracknell & Wokingham)","link":"https://www.meetup.com/social-butterflies-bracknell-wokingham","description":"<p>Social Butterflies is non profit making&nbsp;fun social group for people of all ages, living in and around Bracknell &amp; Wokingham and surrounding areas. The group is run entirely on a voluntary basis for the benefit of its members.</p><p>We have weekly events, which include dining out, theatre trips, boat trips, seaside trips, cinema, bowling and lots of other activities, including the occasional break away.</p><p>We are also a walking group with walks most weekends as well as midweek walks for those who are able to attend.</p><p>There is an annual membership fee of £12 which becomes payable one month after joining. Should you be a member for three months without attending any events then admin will automatically remove you from the group.</p><p>For dining out and some other events, a deposit is payable, which will automatically be deducted from your final bill, however please note, any deposit paid is NON-refundable and should you be unable to attend for any reason then that money will automatically go in to the Social Butterflies ‘fun pot’ and be used towards heavily subsidised events such as summer or Christmas parties. No deposits will be carried forward to other events either. The admin involved in refunding or carry overs is simply to great to keep on top of.</p><p>Social butterflies has been established for over 3 years and is a successful group. We Welcome new members and we welcome any ideas for events or venues etc.&nbsp;We are a friendly bunch and I look forward to meeting you all.</p><p>Many thanks</p><p>Anne – Social Butterflies founder and host.</p>","city":"Bracknell","state":"03","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"34921556","name":"Sapphists Hertfordshire","link":"https://www.meetup.com/meetup-group-vmefrdsa","description":"This is a social group to bring Women Who Love Women together,  build a friendly, active over 18s WLW network in Hertfordshire and have fun!\n\n\n\n\nMeet-ups are a great way to meet new people and connect so come along to one of the social events and say hi. We are a really friendly, welcoming bunch!\n\n\n\n\nWe have a great group of organisers, of varying ages, all of whom bring very different life experiences and perspectives to the mix.  In 2022 we are combining Sapphists Hertfordshire with Hitchin Sapphic Socials, and have added a mid Herts event organiser, so we hope you can find something for you not too far from home.  During the last couple of years, spurred on by the desire to address social isolation amongst our Herts LGBTQ+ community, we have enjoyed pub and meal nights, picnics, beach volleyball, book groups, walks, theatre trip, Hertfordshire Pride, North Herts Pride picnic etc.  Some great friendships have developed between some members, and we have been supportive just by being there for each other.\n\n\n\n\nWe hope that the group will grow and develop over time so please do chat to us about your ideas. If there is something you would like to see as part of this group then let us know.\n\n\n\n\nWe look forward to meeting you soon!\n\nEvent Organiser Jacqui - Living in Brighton for almost 15 years I always felt part of a community as LGBTQ+ is part of the fabric of the city. It felt different when I moved to Hitchin so I started a local group to help people feel connected to a wider community and have fun!\n\n\n\n\nGroup Organiser Gillian - After discovering I am lesbian in my 40s/50s, I met and married a woman and moved to another county.  Returning alone to Watford a few years ago, I began to realise I had absolutely no connection with women who love women here!  I joined Meetup and Facebook groups, have enjoyed some great events, and have made many valuable new friends.\n\n\n\n\nEvent Organiser Sharon - I joined the group to socialise with like minded people and have made some lovely new friends.  I’ve enjoyed various nights out with the Sapphists ladies, from meals out, karaoke, book clubs, music to Prides.  Lots of fun and laughter to be had.\n\n\n\n\nEvent Organiser Jenny - I realised I was gay later than most people my age and then felt like I was the only gay in the village.  It seemed like all Lesbian/Bi events were in London and there was nothing in the countryside.  Going to my first LGBTQ+ Meetup was a game changer for me and this group has played a wonderful part in my journey.  So for me helping organise events is my way of paying it forward.  You couldn’t ask for a nicer group of people.","city":"Watford","state":"F8","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36086242","name":"THE FILM ATELIER  Folk Indie Classical Music Jam, Gigs Meets","link":"https://www.meetup.com/musicians-london-southeast","description":"**For: Acoustic musicians, singer-songwriters, classical musicians and musical instrument & world music players!**\n\n(Not for: Drum N Bass, Rap, RnB, Soul, Funk, Electronica or X factor style commercial music)\n\n**Who Should Join: Solo acoustic instrumentalists, singer-songwriters, session players, keen musicians who know their way around their instrument; those looking for ensemble playing experience and performance. We are not an Open Mic. Meet-up is just one platform we use and we currently trial Meet-up to see whether this is worth continuing with.**\n\n**What we do at events:** We are a new independent start-up! Acoustic Music is core to our emotional well-being, down the the rhythm of our heartbeat. We promote being well and healthy through music and developing a small local community of budding musicians who are otherwise isolated and disconnected from growing with other musicians.\n\n2 hours long acoustic music sessions limited to a max of 8 musicians. We work on shared and agreed music repertoire and play as an ensemble or session. We have our own performance space and audience in the acoustic cafe coffeehouse style.\n\nWe currently run 5 acoustic music meet ups:\n\n**1\\. Classical Chamber Meet\\-up: Saturdays 3\\.00pm \\[sessional depending on players\\]**\n**2\\. Singer\\-Songwriter Indie Alternative Session: Saturdays 5\\.00pm**\n**3\\. Alt\\. Folk Acoustic Session: Wednesday 6\\.00pm**\n**4\\. London Chinese Music Instrument Music Meetup: Sundays 2\\.00pm \\[Private\\]**\n**5\\. World Music \\[Acoustic instruments only\\] Meet up \\[NEW\\]: Sundays 2pm** \n\n**1\\. Classical Music & Chamber Music Meet\\-up:** If you know your way around your classical instrument (cello, violin, flute, clarinet etc), and are interested in meeting like minded instrumentalists to grow and nurture classical ensemble playing- drop us a message with your instrument and repertoire interest! We work out scores with parts we can rehearse and put together.\n\n**2\\. Acoustic Indie Alternative Sessions:** Unlike Open Mics, we work around each others' songs and songwriting, traditional folk and original songs creating instrument parts from the collective of musicians. By alternative, we refer to the spirit of alternative music in its non-commercial, non-saccharin lyrics and non-pop structure.\n\n**3\\. Alt\\. Folk:** we started off performing as folk musicians and love folk music by T Bone Burnett, Wovenhand, Jason Isbell and the Indigo Girls. We play loosely and openly embrace new twists and turns to folk music. We're definitely not oldtimer style!\n\n**4\\. London Chinese Music Instrument Meet up:** Private session. Interested players committed to performing and long term playing are welcome to enquire. From time to time we invite new members.\n\n**5\\. World Music \\[Acoustic\\] Meet up:** open to anyone who plays or sings (ethnic) world music acoustically. First meeting scheduled for Sunday 3rd May 2022 @ 2pm\n\n**Email: thefilmatelierse6@gmail.com**","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"17549802","name":"London Theatre & Film Meetup","link":"https://www.meetup.com/london-theatre-and-film-meetup","description":"**A Social group for People who enjoy WestEnd Theatre and Film Shows!**\n**Maybe a bit passionate... serious theatre and film goers needed!**\nWhat we do is to get a group of like minded individuals (That's YOU) to get together and watch Theatre and Films in London, with a **bit of socialising** throw in - I have met some really lovely interesting people. We are a **busy** group and see more than just one or two shows a month!\nWe love theatre in with A-listed stars in them, musicals, fringe, tear jerkers, films with George Clooney, serious dramas, indie films, cult classics, comedy, opera in fact anything goes. The only criteria for joining is you love the Theatre and Film, so become one of us!!!!\n*Often I have priority booking for shows and I will get tickets for the group -'cos its more fun sitting together.*\n*And of course if I hear of any deals, discounts or special events I will let you know!*\n\n***New Season booking has opened and I've got some extra tickets for sale!!***\nEureka Day stars Helen Hunt\n**Who Killed my Father Directed by Ivo van Hove**\nRose stars Dame Maureen Lipman\n**John Gabriel Borkman stars Simon Russell Beale (The Lehman Trilogy)**\nBlues for Alabama stars Samira Wiley\n**The Band's Visit- musical theatre Winner of 10 Tony Awards**\nJerusalem\nHandbagged\nThe Upstart Crow by Ben Elton\n**Matthew Bourne’s Sleeping Beauty - Ballet**\nThe Wife of Willesden\nImmersive Theatre Guys and Dolls\n**\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**\n**Some of the past shows:**\n**The Ferryman**\n**42nd Street**\n**Matthew Bourne’s Red Shoes**\n**The Truth**\n**Travesties**\n**Funny Girl**\n**When Father came home from the war part 1,2 and 3**\n**THE INTELLIGENT HOMOSEXUAL'S GUIDE TO CAPITALISM AND SOCIALISM WITH A KEY TO THE SCRIPTURES starring Tamsin Greig**\nMan and Superman/ Richard III and Master Builder with Ralph Finnes\nThe Father\nPeople Places and Things\nD H Lawrence's Husbands and Sons starring Anne-Marie Duff\nKinky Boots\nDeath of a Salesman\nLes Liaisons Dangereuses' with Dominic West\nHamlet\nFunny Girl\nLooking for Godot\nView from the Bridge\nThe Play that Goes Wrong\nAntigone with Juliette Binoche\nThe Ruling Class with James McAvoy\nHangmen\nThe Rocky Horror Picture Show *feat. Richard O'Brien*\nAnd a lot of Shakespeare!\n**New events are added on a regular basis - so come along join us and lets see a show together!**","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"35986859","name":"Surrey Women's Social 20s & 30s","link":"https://www.meetup.com/surrey-womens-social-20s-30s","description":"The purpose of this group is to meet other women in their 20s and 30s in Surrey, and take part in a variety of activities while enjoying all this beautiful county has to offer.\n\nWhether you're a local, newcomer, single, or married, we all know how tough it can be to meet new people outside of work and existing social circles. If you're interested in meeting new people, making new friends, and attending fun, laid-back events, then this is the group for you!\n\nIt seems like a lot of the Meetup events geared towards women are always full, so I decided to start my own. Events might include: country walks, brunch, dinner, playing tourist, live music, picnics, theatre, art exhibits, museum visits, and more.\n\nI know everyone has different schedules, so I plan on setting up at least one event every month- come to as many or as few as you'd like!\n\nI look forward to meeting you at an event soon 🌸\n\nGroup etiquette:\n-The events are mostly held in smaller groups.\n-Please RSVP only if you are certain you can attend (of course things happen sometimes, and you might have no choice but to cancel, in this case please make sure you update your RSVP ASAP). Members who RSVP and don't show up will be removed from the group, to be fair and respectful to members who are on the waiting lists and do want to come to the event.\n-Unless it's a 'show up whenever you want' event, please aim to arrive on time.\n-Thanks for being considerate!","city":"Guildford","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1754495","name":"KEN'S GREEN WALKS FOR HEALTH","link":"https://www.meetup.com/kens-events-explore-london-secrets","description":"**GET OUT and GET FIT AGAIN AFTER LOCKDOWN.**\n\n**Do you like to BREATHE FRESH AIR?   Do you want to IMPROVE YOUR FITNESS LEVELS?   Do you like GREEN WALKS in the COUNTRYSIDE or by the SEASIDE?  Do you prefer walks in PARKS by LAKES, CANALS, RIVERS, rather than through busy city streets?**\n\n**Do you want to see new SECRET PLACES in London, places that you might not otherwise have reason to visit?**\n\n**If you answered YES to any of the above then this group is the right one for you.**\n\n**EVERYONE IS WELCOME TO JOIN KEN'S WALKS, a friendly group of walkers (Over 22,000 Members) mainly featuring WALKS in all the green parts of London (in places you have probably never heard of) and surrounding countryside and coastal towns. Change your life (physical health and mental health) dramatically for the better!!**\n\n**YOU CAN JOIN KEN'S EVENTS FOR FREE and just pay a contribution for each event attended!!!**\nTHERE IS NO JOINING FEE. INSTEAD FROM JANUARY 1st 2022 THERE WILL BE A COLLECTION OF A NOMINAL £5 CONTRIBUTION FOR EACH WALKING EVENT in LONDON ATTENDED (known as the 'pay as you go' option) OR YOU CAN PURCHASE A KEN'S EVENTS CARD (only £20 for a full 12 months validity from date of purchase, (known as the 'season ticket' and equivalent to only £1.66 pence per month), thus allowing you to save loads of money if you come to more than 4 walks a year!\n\n***If weekday and evening walks are your thing, then you should also join Ken's Weekday and Evenings Walking Group. [Click here for more information.](https://www.meetup.com/KENS-WEEKDAY-EVENING-WALKS/)*** \n![](https://secure.meetupstatic.com/photos/event/1/0/e/c/event_375424332.jpeg)\n\n![](https://secure.meetupstatic.com/photos/event/d/2/a/c/event_259913932.jpeg)\n\n![](https://secure.meetupstatic.com/photos/event/d/e/8/1/600_456536961.jpeg)\n\n**JOIN KEN'S EVENTS AND SEE LONDON!!**\nYou can buy a 'Kens Events' card online through Paypal or by cash at most events. Please note that although Paypal is used for on-line payment, you do not need a Paypal account, just a credit or debit card.  Click on this link to get a Card. [https://www.meetup.com/KENS-EVENTS-EXPLORE-LONDON-SECRETS/dues/](https://www.meetup.com/KENS-EVENTS-EXPLORE-LONDON-SECRETS/dues/)  Now just bring your e-mail receipt to your next event and you will be given the Card in exchange. \n**You can also follow Ken's Events on Facebook at**\n**[http://www.facebook.com/pages/Kens-Events/1...](http://www.facebook.com/pages/Kens-Events/176879445725726)**\n**and on Twitter**\n**[http://www.twitter.com/KenEvents/](http://www.twitter.com/KenEvents/)**\n**[Also Click Here for more information including the Ken's Events disclaimer.](https://www.meetup.com/KENS-EVENTS-EXPLORE-LONDON-SECRETS/pages/14591782/KEN%27S_EVENTS_DISCLAIMER)**","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1738311","name":"South Bucks Social","link":"https://www.meetup.com/south-bucks-social","description":"Hi and Welcome to the wonderful world of South Bucks Social Club aka SBS. We are a very friendly & inclusive bunch, who enjoy everything from pub quiz's, to walks, to meals, to music, to cinema, to talks, to theatre events and everything in between, in and around the South Bucks area. But we are not a singles or dating group.\nThe club is run by Brian, Dawn & Mary, plus has a whole bunch of wonderful Event Hosts, hosting a wide variety of events. \nWe do charge a small subscription fee of £5.00 per year, however we do not charge a \"per event\" attendance fee. We are a non profit organisation and all subscription fees goes to cover the cost of using the Meetup web platform.\nWe look forward to welcoming you to one of the many SBS events soon!\nAll the very best, \nBrian, Dawn, Mary and all at SBS :)","city":"Burnham","state":"B9","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"28008982","name":"Female Friends - London (20-45yrs)","link":"https://www.meetup.com/new-female-friends","description":"<p>Welcome to our community! This group is made for ladies who want to make new female friends in London in a relaxed environment. We hope you will make lifelong girlfriends here, as well as enjoy all the fun London has to offer. There will be several events each month ranging from brunch, theatre, days out and much more! Suggestions for events are welcomed and encouraged. We encourage new people to attend, so feel free to RSVP to events that take you interest! 👩🏿‍🤝‍👩🏼❤️</p><p>&lt;br&gt;</p><p><br /></p><p>Our Ethos -</p><p>We want everyone to contribute to the success and joy of this group, and this involves turning up to the events you RSVP to. Showing up is a commitment we want everyone to make, as this helps the organisers maximise the spaces booked, helps the attendees meet more new people, and most importantly it help you fulfil the commitment you made to yourself to meet nice new friends.</p><p><br /></p><p>WE STRICTLY DO NOT DO ANY NETWORING OR ANY BUSINESS-RELATED EVENTS OF ANY KIND, NO EXCEPTIONS. This group is for meaningful friendships and quality time amongst women in London.</p><p><br /></p><p>NO-SHOW POLICY – We would like to maximise every event for your full enjoyment, therefore we encourage you to turn up to the events you RSVP to. All attendance is monitored. TWO missed events will be marked as 'no-shows', and a polite reminder will be sent to you. If you do not show up THREE times when you have RSVP'd as \"Yes\" without sending a message and changing your RSVP, you will be automatically removed from the group. Its important you RSVP to things you can attend to, and change you RSVP in good time if other plans come up. Please do this so we can offer your spot to someone else if you decide not to attend. This rule applies to last minute drop outs (UNDER 48hrs) without a message too. This is to make sure that we maximise all the space we book for events and include more people who want to participate and enjoy meeting each other.</p><p>&lt;br&gt;</p><p>PAYMENT - Please note, running this group is not free and lead organisers pay Meet-up a monthly fee to keep the group running. Therefore RSVPs will be charged a non-refundable £3 for all events. Some events might also require an additional fee if the restaurant or event venue requires a prepayment. This £3 is non-refundable under all circumstances unless only if the organisers cancel the event. If you cancel your RSVP the non-refund still applies. If you would like to support the continued running of this group you can also donate any amount to our PayPal pool which I can send to you if you request the link :)</p><p>&lt;br&gt;</p><p>WAITLIST - Please be aware that we currently don't have waitlist and all events are first come first serve. Updates will be sent out once we can have a functioning waitlist.</p><p>&lt;br&gt;</p><p>SAFETY AND COURTESY: We want everyone to have a fun and safe time when attending our events, and we want our organisers to communicate with attendees about event  updates with confidence that they will be treated with respect - therefore we follow Meet-up's policy on safety strictly.  We do not tolerate any abusive language towards anyone in this group. Please DM people with respect. Any members found to be harassing/insulting/threatening/bullying any member of this group will be removed immediately and the ban will be permanent. We also make reports to meet-up who have the power to remove any policy breakers of the platform completely.</p><p><br /></p><p>SOCIAL MEDIA: Our Instagram handle is @femalefriendsLDN. Please follow. We take pictures at events. If you do not want your picture uploaded please let the organiser know and they will delete all pictures featuring you.</p>","city":"Edgware","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"33904113","name":"Berkhamsted & Tring Social","link":"https://www.meetup.com/berkhamsted-tring-social","description":"<p>Berkhamsted and Tring Social welcomes all friends and residents, new and established, to our social group. The aim of our group is to provide our members with opportunities to meet new people in the area with similar interests and to make new friends who want to get out and about in the local area. We will be offering a range of events and have a strong commitment to supporting our local community and local events. We will be aiming to offer a range of events, such as film nights, theatre trips, concerts, book club, the wine club, quizzes, pub nights, meals out etc. We will also be hoping to offer outdoor events such as walks and hikes and other physical activities in the beautiful Chilterns area around us. <br>Initially, due to lockdown, we will resume some of our regular events such as the book club (via Zoom) and walks (with limited numbers). <br>You will recognise our event hosts as the same people who made great efforts to provide members with a variety of events over several years in the former Berkhamsted Social group which has now come to an end. We will be looking for new, committed hosts with fresh ideas, too, to help our local group grow and develop, offering a range of regular and new events to suit the different interests and tastes of our members. Some events will have a small cost so that the organisers can cover the subscription fees, but many events will remain free of charge. We ask that all members keep their RSVP’s up to date and respect the efforts made by all hosts in offering local and varied events for our enjoyment. <br>Look forward to you joining us at an event soon! </p>","city":"Berkhamsted","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18985592","name":"Ladies Who Brunch ...and pretty much do everything else too","link":"https://www.meetup.com/ladies-that-brunch-and-pretty-much-do-everything-else-too","description":"<p>This group is ideal for women who are time-poor and want to be able to drop in to social meetups with like-minded individuals at similar stages in their lives.&nbsp;</p><p><br /></p><p>Many women I know struggle with the same problem as they hit their mid-twenties/ thirties with most of their social network spread out all over the country.&nbsp;Many of us have moved from our hometowns, friends are scattered all over the place and long working hours make it pretty difficult to commit to hobbies.&nbsp;This Surrey-based member's group is designed to be low maintenance but there when you want it, as and when you are free.</p><p><br /></p><p>The group is always open to suggestions for things to do, but will start on the basis of all things from fitness (runs, yoga, walks, gym sessions, dance classes) to coffee catch-ups, new lunch venues, as well as golf, film, fashion and career conversations/ networking.&nbsp;We welcome anyone to host a meetup, so if you'd like to see more events near you or fancy a particular activity, why not have a go? Similarly, If you have any hobbies or passions we could incorporate that you would like to share or teach - we would be thrilled. Just let me, Charlie, know.</p><p><br /></p><p>Ultimately, this group is a great way to take a moment out of our busy lives, put the world to rights, share hobbies and skills, network, and enjoy those odd free evenings and weekends in the company of some amazing women.</p><p><br /></p><p>****************************************************&nbsp;</p><p><br /></p><p>Kindly Note:&nbsp;</p><p>- Please ensure first names and photos are included on your profiles for membership consideration&nbsp;</p><p>- We hope that this group will be full of fun, enthusiastic members, please contribute and RSVP where reasonable. It can be daunting attending an event for the first time - but please don't be nervous. The meetups are low-key and filled with genuinely amazing, friendly women.</p><p>- We welcome women of any age to join.</p><p>- Most of the meetups will be free, but to accommodate any charged events or visiting speakers/experts, some of the meetups may involve a small fee or deposit. Charged events include things such as theatre visits, cinema, lectures, exercise classes etc.&nbsp;Any fees will of course be communicated well in advance.</p><p>- To cover the cost of having the meetup group (currently £120/year), the meetup owner, Charlie, may negotiate with paid activity organisers for compensation, such as covering their ticket cost - this won't affect members and any fees will be communicated well in advance.</p><p>- If you would like to share a paid event with the group, where funds will go to yourself or someone you know, please ask the group owner, Charlie, in advance.</p><p><br /></p><p>Any questions, please don't hesitate to get in touch.&nbsp;</p><p>Looking forward to meeting you.&nbsp;</p><p>Thanks and enjoy!</p>","city":"Twickenham","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"22263375","name":"Lovers of Black Theatre","link":"https://www.meetup.com/lovers-of-black-theatre","description":"Hi Ladies and Gentleman\n\nThis is a meetup group for London theatre lovers out there.\n\nTheatre is a huge passion of mine and I wanted to find other people with a similar passion. \n\nI particularly have an interest in theatre that recounts the black experience ,whether that be in the UK or abroad and many a time when I go to such shows, the turnout is not as full as I would like, hence the main reason for starting this group.\n\nThe plan is to watch shows from the likes of Arinze Kene, Wole Soyinka,Debbie Tucker Green, Roy Williams, August Wilson, Lorraine Hansbury, Inua Elams etc \n\nWe will aim to shine a light on these productions, go down and support have fun and hopefully get to know each other in the process. \n\nI look forward to seeing many plays together :-) ","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"13404982","name":"THEATRE and STUFF - Love London Theatre!","link":"https://www.meetup.com/theatre-and-stuff","description":"<p>THEATRE and STUFF is for anyone who wants to meetup to enjoy London theatre and combine it with some socialising. We like our theatre up close and personal so if you want to be within spitting distance of Ralph Fiennes, Tom Hiddleston, Juliette Binoche, Benedict Cumberbatch - this is the group for you! We <i>always</i> get together after THEATRE and STUFF events so that members can chat and get to know each other - after all, it is a meetup group! We're a friendly, eclectic bunch and you'll find us really inclusive. Everyone's welcome - including you, so hope to see you at a meetup soon! &lt;br&gt;</p> \n<p>We do ask for a contribution of £5 when you join to help defray the group's running costs, but don't worry - it's well worth it! :) &lt;br&gt;</p> \n<p>&lt;br&gt;</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"18219147","name":"Acting Gymnasium - unique weekly acting workshop","link":"https://www.meetup.com/acting-gymnasium-unique-weekly-acting-workshop","description":"Following on from the OUTSTANDING CRITICAL SUCCESS of THE MERCHANT OF VENICE and SPRING AWAKENING in January 2022, HAMLET and SIX CHARACTERS IN SEARCH OF AN AUTHOR in June 2021, ANTONY AND CLEOPATRA in September 2020 - described by critics as '...the hottest ticket in town.'-  and before that Macbeth, A Flea In Her Ear, Miss Julie, A Doll's House, Midsummer Night's Dream, La Ronde, Platonov, Romeo and Juliet, Three Sisters, An Ideal Husband, The Cherry Orchard, Uncle Vanya, Ivanov, The Parasite and Playboy of the Western World - The Acting Gymnasium is looking for male and female actors to join our workshop. We will be working each week on elements of performance using our methodology informed and influenced by the ideas of Stanislavski, Vakhatangov and Nimerovic-Danchenko. This unique acting workshop will culminate in a TWO WEEK RUN of full productions at the 120 seat Tower Theatre in June 2022. \nCheck the reviews at [www.actinggymnasium.co.uk](http://www.actinggymnasium.co.uk) \n\\*\\*\\*\\*\\* (5 Stars) A Midsummer Night's Dream\n\\*\\*\\*\\*\\* (5 Stars) La Ronde\n\\*\\*\\*\\*\\* (5 Stars) Romeo and Juliet\n\\*\\*\\*\\*\\* (5 Stars) The Cherry Orchard \n\\*\\*\\*\\*\\* (5 Stars) Uncle Vanya \n\\*\\*\\*\\*\\* (5 Stars) Ivanov \n\\*\\*\\*\\*\\* (5 Stars) The Playboy of the Western World \nIf you are interested in any of the following then The Acting Gymnasium may be for you: \nWeekly acting workshops Performing in a top quality theatre production \nVoice work \nAlexander technique \nAdvanced characterisation techniques \nImprovisational character work \nKeeping your creativity sharp by regular workshopping \nBeing seen by industry professionals \nNetworking and connecting with fellow professionals \nTop quality colour photographs of your work to add to your portfolio \nHAVING YOUR WORK REVIEWED. \nPerforming in a production that gets four &amp; five star reviews may be the catalyst that gets you noticed by casting directors and industry professionals. \nCheck out recent reviews: \n[http://www.theirishworld.com/?p=4887](http://www.theirishworld.com/?p=4887) (5 Stars) \n[http://playstosee.com/page.php?sad=play&amp;id=1576](http://playstosee.com/page.php?sad=play&amp;amp;id=1576) (4 Stars) Critics' Choice \n[http://www.thepublicreviews.com/the-playboy-of-the-wester...](http://www.thepublicreviews.com/the-playboy-of-the-western-world-the-corrib-rest-london/) (4 Stars) \n[http://www.theirishworld.com/?p=5961](http://www.theirishworld.com/?p=5961) (5 Stars) \n[http://www.everything-theatre.co.uk/2013/11/ivanov-theatr...](http://www.everything-theatre.co.uk/2013/11/ivanov-theatro-technis-review.html) (4 Stars) \n[http://www.thepublicreviews.com/ivanov-theatrotechnis-lon...](http://www.thepublicreviews.com/ivanov-theatrotechnis-london/) (4 Stars)\n[http://www.irishpost.co.uk/entertainment/theatre-review-i...](http://www.irishpost.co.uk/entertainment/theatre-review-ivanov-theatro-technis-london) (4 Stars) \nPLEASE NOTE ACTING GYMNASIUM IS A UNIQUE, TOP QUALITY WEEKLY PROFESSIONAL DEVELOPMENT WORKSHOP FOR ACTORS CULMINATING IN A SHOWCASE PERFORMANCE.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1749213","name":"Free Stuff and Free Events - try new things","link":"https://www.meetup.com/freestuffandfreeevents","description":"Free talks, comedy live-streamed, open mic live, dancing online parties, pub quizzes live-streamed, yoga, theatre performances, clubbing, sports and more!!\nMore added regularly...\nWe have everything from chilled out music events to fitness classes, talks, workshops and even yoga! You're almost guaranteed to find something that you'd like to do, no matter where you're from and what you want to do.\n\nClick 'join', and have fun! We look forward to seeing you at one of our events soon.\n\nJoin us! Everyone is welcome :)\n\n———————————————————————————-\n\nJoin our Newsletter and get 50+ new freebies:\nhttps://www.freestuffandfreeevents.com\n\nOther ways to get freebies:\nTelegram\nhttps://t.me/FreeStuffandFreeEvents\n\nFacebook page/group & Instagram:\nFreeStuffAndFreeEvents\n(We are giving away Amazon Vouchers soon!)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"14750442","name":"London Drawing Life Drawing Meetup","link":"https://www.meetup.com/londondrawing","description":"<p>Join the London Drawing Meet Up Group to hear about some of the best life drawing sessions in London. Join us for drop in sessions, Saturday workshops, courses, summer schools and very special life drawing events across the capital.&nbsp;Expect professional tutors and models in interesting spaces for conventional life drawing sessions, as well as completely unique creative life drawing events in significant venues across the city such as the Museum Of London, Battersea Arts Centre, The V&amp;A and Design Museum. All our sessions welcome all levels of ability.</p><p>We hope to meet you in a class soon!</p><p>For more on London Drawing and what have got going on:</p><p><a href=\"http://www.londondrawing.com/\" target=\"_blank\">http://www.londondrawing.com/</a></p><p>For monthly news letters independent of Meet Up- support us and stay in touch via our own mailing list:</p><p>https://londondrawing.com/contact-us/</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1727794","name":"Museums, Galleries, Tours & More","link":"https://www.meetup.com/museums-galleries-and-more","description":"<p>For days, evenings and afternoons out at places of artistic interest, guided walks - with the option of a meal or drinks afterwards to chat, get to know each other, talk about what we've seen etc.</p>\n<p>Open to anybody interested in the visual arts, and will include a mix of free and paid for events.</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"31329628","name":"London Art Museum Creatives","link":"https://www.meetup.com/london-art-museum-creatives","description":"**London Art Museum Creatives is a group for anyone who enjoys the art world in any capacity. We enjoy making art, learning about artists, materials and new techniques and supporting each other in our own creative journeys.**\n\nIf you're a beginner in the arts or a professional artist, then you're very welcome.\n\n**I do request that you must be fully vaccinated against COVID-19 in order to attend events as we have vulnerable members (myself included) who need to be kept healthy and safe.**\n\nSo you can expect to wear a mask for events that are held inside and prior to attending, you'll need to take a lateral flow COVID test and send me your negative results before you attend. \nFor outside events, you will also need to take a COVID test prior to attending to protect everyone.\n\nI also encourage everyone to fully read an event's description as I do put a lot of work into trying to cover everything an attendee might need in the description, so make sure you've fully read everything before reaching out to me with further questions.\n\n* **Anyone unwilling to take a COVID test before an event will be removed from this group.**\n* **Anyone claiming to be exempt from wearing a mask indoors needs to send me a message explaining why this is before being allowed to attend.**\n* **Anyone not yet vaccinated will not be allowed to attend any event.**\n* **Anyone who tests positive for COVID will not be allowed to attend events and will need to keep me updated when they have a negative COVID test result.**\n\nIf you have any questions/concerns about this group, it's events or anything else please feel free to send me a message here on Meetup and I'll do my best to answer as soon as I'm able. *(Please be courteous, don't sell me things or flirt.)*\n\nSorry if my rules are strict, but after my fight last year with cancer, I'm very aware of how important it is to keep others safe in my community, hence my rules. I appreciate your understanding. \n\nThank you for joining my group and I hope to see you all at a future event!\n\n-Franceska\nOrganiser\n\n[www.thefranceskatree.com](www.thefranceskatree.com)\n[www.franceskadrawstrees.com](www.franceskadrawstrees.com)\n[www.toothpickmoon.com](www.toothpickmoon.com)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"29763394","name":"London Arts & Culture Group","link":"https://www.meetup.com/london-arts-culture-group","description":"<p>This is a group for anyone with an interest in Art Galleries, Museums &amp; Culture. You will find the groups activities entertaining if you enjoy visiting Museums, like Literature, or study any other art related subjects. We meet to visit, and learn more about the Art &amp; Culture on offer in London.</p>\n<p><span>The group meets every Friday, visiting:</span></p>\n<p><span>National Gallery (1st Friday)&nbsp;</span> <br></p>\n<p><span>V &amp; A Museum (2nd Friday)&nbsp;</span></p>\n<p><span>British Museum (3rd Friday)</span></p>\n<p><span>Tate Modern (Last Friday of the Month)&nbsp; <br></span></p>\n<p><span> <br></span></p>\n<p><span>Hope to meet soon</span>&nbsp; <br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"22903581","name":"Like minded people  in London (2750+)","link":"https://www.meetup.com/like-minded-peopleinlondon","description":"This is a group for people who would like to explore art & music, theatre & museums and attend talks and lectures in the city of London. There are a huge number of these in this city at any given time and we ought to make it out to see, hear and experience them. It is particularly nice to do all these things in a large group so that we could identify other like minded people while also being able to discuss our experiences after our meetups.\nWe will visit these venues every week and after the visits meet at a cafe or bar for some refreshments or a meal where we can chat and discuss.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"29411604","name":"Contemporary Art London","link":"https://www.meetup.com/meetup-group-egamcuwn","description":"<p>This is a group for those interested in keeping their eye in on the London contemporary art scene. We regularly visit new exhibitions across the city including attending Private Views with the intention to see as much as possible, to make friends and connect with other arts professionals and to build our knowledge of the contemporary art scene in London.</p>\n<p>Events we see are designed to help you explore new exhibitions (as opposed to permanent displays) and new spaces across the city. Not all events involve 'Contemporary Art' - some may be, for example, pre-20th Century Art exhibitions, visits to Open House events looking at architecture, and occasionally walking tours of outdoor sculpture.</p>\n<p>Group events are fun and designed to be both informative and just a good day/evening out. Members are welcome to bring friends and we'll often book a table for lunch nearby an exhibition. We also always try to end each event by heading to a nearby pub/cafe/place to sit down and have chat about the work we've seen, the themes around the work, curatorial decisions and much more.</p>\n<p>So welcome to the group and get yourself RSVP'd for some of our forthcoming events!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35045944","name":"The Hobby of Acting - online :)","link":"https://www.meetup.com/hobby-of-acting","description":"Let’s meet online to play and develop some new (or old) acting skills.\n\nOur online acting sessions are for you if:\n\n* You ever thought about taking up acting.\n* You did drama in college, uni, school and you miss it.\n* You ever needed to speak in front of people and wishes you had some more tools (and some more confidence).\n* You like to play and be creative (and sometimes silly).\n* You want to meet people while being at home.\n* You are an adult (but really a child).\n\nWe will play, learn skills, create and perform.\nWe will become free when performing and more confident in front of people.\nWe will make new friends and get to know ourselves in a new way.\n\nAll of the sessions in this Meetup group are online.\nAll of the sessions are suitable for beginners with little or no experience.\nMore experienced performers are very welcome to join and play with us too :)\nMost sessions are run by [Theatre Gym](https://www.theatregym.co.uk/) and Tal Jakubwiczova","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1174642","name":"Oxford Arts Events","link":"https://www.meetup.com/oxford-arts-events","description":"We are a friendly and informal social group for arts and culture enthusiasts in and around Oxford. If you love music, spoken word, dance, cinema, comedy, theatre, galleries and museums and more, do join us. If you want to promote an arts event and are happy to host a Meetup on the day please contact the organiser.\nMeetup site costs are approximately £200 per year. A £2 annual contribution is requested.","city":"Oxford","state":"K2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34425543","name":"London Performing Arts Meetup Group","link":"https://www.meetup.com/london-performing-arts-meetup-group","description":"<p>This is for everybody. Improv is great for those who want to improve in public speaking. Actors and improvisers and for anyone who wants to have fun.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35138684","name":"Considering.Art™ (UK)","link":"https://www.meetup.com/considering-art-uk","description":"<p>Oh, Hi. 👋 We are Considering.Art™ - a new LIVE cultural engagement network that's as unique as you are. Join us!</p> \n<p>Unlike a typical museum / gallery tour, here at CA - it's not really about us, we are more interested in you. Never repeated and uniquely yours, our interactive and explorative video tours last typically 60-90 mins in duration, and are facilitated LIVE by your very own 'museum' guide. Cool right?</p> \n<p>With a focus on contemporary art, together we aim to explore some of the most pressing issues of today - bringing thoughts, feelings, and observations into a fun, lively and sometimes challenging exchange.</p> \n<p>Developed in collaboration with a team of NYC art world professionals, in response to COVID 19 closures, we are super excited to welcome you into our global community as we join each other on this exciting journey.</p> \n<p>Once registered, your unique and direct link to our Zoom viewing / meeting room will be provided. Events are FREE to attend and open to all. This is LIVE arts engagement for all. Never recorded. Uniquely yours. Your voice. Your idea.</p> \n<p>Fancy a chat? Have an idea? Interested in presenting? Reach out via info@considering.art - we love hearing from you ❤️.</p> \n<p>Let’s do this... why not book a free tour today?</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"17937502","name":"London Dramatic Art Meetup- Theatre, Film Et Cetera","link":"https://www.meetup.com/london-dramatic-arts-meetup-theatre-film-et-cetera","description":"<p><b> <br></b></p>\n<p><b>For those interested in drama and theatre arts. You could be a newbie, wanting to try things out or a fanatic who goes at least three to four times a week. Welcome!</b></p>\n<p><b>We go as a group to theatre to most west-end theatres and non west-end theatres including &nbsp;Arcola, Almeida, Hampstead, Kings Head, Young Vic, Old Vic, Donmar Warehouse, The National Theatre etc with lots of socialising pre and post show.&nbsp;</b></p>\n<p><b>We are a small group who would love to get to know you, the individual, better. We keep our meetup numbers to usually not more than 10 to 12 people. Please join only if you are interested in turning up for a meetup event. There are plenty of online discussion forums and newsletters out there, but we are about making friends whilst enjoying theatre/drama, and in the spirit of Meetup, to meet face to face.&nbsp;</b></p>\n<p><b> London theatre scene is fabulous- if you want to go out every night and suffer theatre fatigue, this is easily done. If we go to every play out there, there would be no time for work or a balanced life.&nbsp;</b></p>\n<p><b>Whilst easy to put up every play out there in our calendar (cut and paste from theatre listings!), we would rather not. We take pride in being selective, adding must-sees alongside under-rated or under-exposed productions, prefering quality over quantity. You will not see a menu listing every show in theatre land, but our choices are carefully considered. This is the group for you if you are a discerning theatre goer and want to make the most efficient use of your leisure time...!</b></p>\n<p>We are not a ticket reselling site, but we do aim to get members the best deals on offer including group discounts, priority bookings and low cost tickets. <b> Our members benefit from&nbsp;high value tickets at lower cost, not 'cheap' tickets (these are easy to find). </b>There may be booking fees and paypal fees added to some ticket prices, and any additional fee goes to the running costs including priority memberships, producers/ supporters circle/donations, administration costs, banking and paypal costs. This group does run at a loss, due to the costs above and especially management time costs of the Organiser, but we do it for <b>the love of theatre </b>and <b>the love for theatre going people.&nbsp;</b></p>\n<p><b>It's free to join this Meetup group but we tend not to retain non-active members. To help with running costs, there is a one off £10 Theatre Pass fee to pay on your first booking to join an event.</b></p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"4130802","name":"Life-Drawing Workshop @ Islington Arts Factory","link":"https://www.meetup.com/life-drawing-drop-in-workshop-islington-arts-factory","description":"<p>Welcome to the Islington Arts Factory Weekly Drop-In Life Drawing Sessions. The sessions have been running for 25 years! </p><p><br /></p><p>Classes are untutored and drawing materials are not provided. Paper can be purchased at the Reception. </p><p><br /></p><p><br /></p><p>Fee is £10 cash to be paid at the venue.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"27103867","name":"Candid Arts Drop In Life Drawing Classes","link":"https://www.meetup.com/candid-arts-life-drawing-meetup","description":"<p>Life Drawing Drop-In Daytime &amp; Evening Classes</p>\n<p><br></p>\n<p>Every Tuesday, Wednesday and Thursday*&nbsp;11am – 1pm<br>Every Monday, Tuesday, Wednesday and Thursday* 7 – 9pm</p>\n<p><br>(*except bank holidays)</p>No need to book, just drop-in!\n<p>Wednesday morning and evening sessions are&nbsp;long pose sessions,&nbsp;which allows students to work on one drawing for 60 minutes.</p>\n<p>Thursday morning sessions are one pose sessions.</p>\n<p>£9 per class</p>\n<p>Materials available to buy – paper (25p/sheet) &amp; charcoal (25p).</p>\n<p>Loyalty cards available – Attend 9 drop in classes and get the 10th free.&nbsp;</p>\n<p><span>All levels welcome.</span></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"27106055","name":"Candid Arts Friday Life Drawing Meetup","link":"https://www.meetup.com/meetup-group-zzfipsjc","description":"<p>Draw, drink and socialise. <br>Set in the fantastic Candid Arts Sky Lab with stunning view of the city, these tutored life drawing classes provide an opportunity to socialise with like minded creative people. <br>Two life models are arranged for each class and included in the ticket price are two complimentary drinks.</p>\n<p><br></p>\n<p>Price: £15 (inc a free drink)</p>\n<p>Materials: You can either bring your own materials or buy paper and charcoal at the class.</p>\n<p><br></p>\n<p><br></p>\n<p><br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"26230806","name":"Theatre Improv","link":"https://www.meetup.com/theatre-improv","description":"<p>This is a group for anyone interested in improvisation theatre shows and workshops. <br></p>\n<p>Improvisational theatre involves creating characters, plots and scenes in the moment. <br></p>\n<p>Improvisation is a skill that also enhances listening, team building and communication skills. <br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36056751","name":"Amateur Drama Class","link":"https://www.meetup.com/amateur-drama-class","description":"If you are looking for something creative and fun to do on Monday and Wednesday evenings after work, then join me for an amateur drama class that I will be teaching at the Omnibus Theatre Clapham from 6:30-8:30 pm. These classes are wonderful to build confidence, connect, meet people, and learn acting skills. We usually go out for a drink at the local pub after each class to further know each other. \nFor more info contact me at catherine@thebrightdaycompany.net. First trial class is half price at £10 (different payment plans offered after that). \nI look forward to seeing you there!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"12633962","name":"West Essex Arts, Photography & Culture Group","link":"https://www.meetup.com/west-essex-arts-photography-culture-group","description":"Come along to our events, exploring what the local and surrounding areas have to offer with like minded people and make new friends!\n\nOur members come from Loughton, Epping, Chingford, Walthamstow, Buckhurst Hill, Woodford, South Woodford, Chigwell, Wanstead, Claybury and surrounding areas. We have visits to art & photography exhibitions, galleries, museums, fairs, festivals, live music, walks, statley houses, castles and places of historical interest, gardens, parks, pubs, meals and coffee.\n\nPhoto opportunities at most events which you can share with the rest of the group on the meet-up and Facebook pages. \n\nWe usually have time for a drink, refreshments and a chat during or after the events at a local pub.\n\nEvents are local and further afield including Essex, Hertfordshire and London.\n\nJoin us today and don’t forget to sign up for some interesting and fun events, meeting new people and making friends!","city":"Buckhurst Hill","state":"E4","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"34997748","name":"London Drawing Community and events","link":"https://www.meetup.com/london-art-friends","description":"This group is part of the Network for Figure Drawing like Myspace is for Music or FB for paying for ads and is called the Life Drawing Network based in London and Brighton UK with Main Groups in New York, London, Brighton, Toronto, Seattle, San Francisco, Los Angeles and members as far as China or Greenland. We don't mind coming up at some point with a new name, let us know of any great name you have in mind.\nWe ran Figure Drawing classes since 2004 when there was only about 10 2D Figure Drawing classes left in London UK. This was the time when Ipad/Wacom tablet classes started to overtake. We, I mean I went a bit mad about it and by influencing as much as humanly possible we had 650 classes weekly in London in 2013 and run about 120 in 10 years, in all areas of the city, was seen on Tele, Radio, press regularly. This crusade was about anything and everything but capital gain and hasn't changed. For absolutely everyone to be able to draw, Online zoom classes are perfect as you always get the best seat and can use equipment that you can never use at the Local weekly classes.\n\n**Classes:**\n**Saturday and Sunday** every 2 weeks I meet Londoners in Central London Park, Hyde Park corner and gently push others like Clissold Park Locals to do the same, like I did, as those are Free events. If I am in Brighton someone else's welcomes guests on the day.\n**Monday:** Every Monday as this is the most regular class of the week, I or someone I trust guide the group which again is only possible online, for 1/2 the session. Then I turn my camera towards my Drawing board or using the chat on zoom, help those who turn their own camera on their drawings. Other participants will never hear, see anything so a bit like private tuition. This is something offered only to those who really mean to achieve results in the future and need to pay a tiny £5/week that helps me pay the models with and all our video and running of our website. Without those people keen to achieve and me absolutely keen to help them none of all this would ever be possible.\nThose who don't need help on that day simply put the volume down.\n**Tuesday** is our together day for a little extra Socializing and to draw each other's faces mainly. Sometime hands, or feet, Costumes, hats, jewelry etc... To keep the experience fun fun fun who ever poses must do a funny face before the more or less still posing for 20 mins :). If you llok like anyone let me know so more will turn up. The first time we did one one those, before any Doodle events ever existed was in 2006 and was called Happy Drawing Circles with up to 20 in each circle.\n**Wednesday** about every 2 weeks depending on level of attendance we do Exceptional Life Drawing themes that most attendees go to Live or continue drawing after the class from the recordings if they are Weekly members (£5 all incl.)\n**Thursday** is our Partly clothed to completely clothed/costumed models day also every 2 weeks on Low season and weekly otherwise.\nTo recapitulate: A live experience cost £2.50, A live experience and/or working from the recording is £10 or the weekly pass inclusive of all events is £5/week or £7.50 for Pro Class organizers who need little help.\nFor a complete list of what this Pass gives you feel free to read our Prices page at www.thelifedrawingnetwork.com\n**The motivation** part is also in our pricing as if you Buy a £10 ticket to be able to work/finish your work from a video, if you email us a Drawing that we can exhibit on our Life Arts Gallery page, we refund £7 and will show your Art to potential buyers/investors.\nIf you want or intend to model one day for classes we let people give it a go at the end of any of our classes and offer Completely Free services to them for Life, my life.\nIf you or someone you know would like to be promoted for anything in person, from Artist, Art teacher, Class organizer, Art writer, let me know.\nWe'll be writing the History of Comtemporary Figure drawing so please share good old times stories... I'll share mine from anywhere.\n\n**Tony**\n[Facebook](https://www.facebook.com/tony.a.gallery/): Days when I was running Voila! Life Arts Galley in Central London-\n[Instagram:](https://www.instagram.com/lifedrawing/) Days I was running very busy classes by Leicester square where Central Saint-Martin used to be-\n[Flickr ](https://www.flickr.com/photos/lifedrawingsocietycouk/albums/72157719223461051)\\- Mainly my ball ben drawings as I always drew for as long as I carried a ball ben so from the age of 6\\.\nDiscord: Smitone#2038 - For what technology can bring to us 2D Artists up to 3D Virtual reality.\n[Twitter - ](https://twitter.com/LifeDrawingUK) [Linkdln](https://www.linkedin.com/in/tony-picano-49613527/) \\- eukart\\(at\\)msn\\.com\\.","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"17811712","name":"Theatre Gym - Beginners acting classes","link":"https://www.meetup.com/theatregym","description":"Let’s meet online and in person to play and develop some new (or old) acting skills.\n\nOur online acting sessions are for you if:\n\n* You ever thought about taking up acting as a hobby.\n* You did drama in college, uni, school and you miss it.\n* You ever needed to speak in front of people and wishes you had some more tools (and some more confidence).\n* You like to play and be creative (and sometimes silly).\n* You want to meet people while being at home.\n* You are an adult (but really a child).\n\nWe will play, learn skills, create and perform.\nWe will become more free & confident in front of people.\nWe will make new friends and get to know ourselves in a new way.\n\nAll of the sessions in this Meetup group are online.\nAll of the sessions are suitable for beginners with little or no experience.\nMore experienced performers are very welcome to join and play with us too :)\nMost sessions are run by [Theatre Gym](https://www.theatregym.co.uk/) and Tal Jakubwiczova","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36001873","name":"Helen's Walks","link":"https://www.meetup.com/helens-walks","description":"<p>Helen's Walks are inspired by one of the world's most wonderful cities.</p> \n<p>Come and discover some the most fascinating corners of London, or see familiar places in a different light. There is always something new to learn about London.</p> \n<p>It's many diverse delights might have been here for centuries or just opened last week, that's the joy of London and there's no one better to explore with than Helen, her enthusiasm for the city is infectious.</p> \n<p>Helen has lived in London for 30 years and has worked as an actor, tour guide, stand up comedian and prize winning poet.<br>Her love of London's rich history, its arts, architecture, food, green spaces, wildlife and constant reinvention will probably keep her here for 30 more years.</p> \n<p>Join Helen’s Walks now to enjoy visiting her favourite sites, incite your imagination and gain more insight into fabulous London.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18810435","name":"St Albans Life Drawing","link":"https://www.meetup.com/st-albans-life-drawing-meetup","description":"<p>Join Life Drawing St.Albans. For those interested in figurative drawing. Perhaps you studied art at college or university and always enjoyed life drawing or perhaps you've never tried life drawing before. Well here is your chance....</p>\n<p><span>&nbsp; &nbsp; &nbsp; run by illustrator Bob Wright. Sister Meetup group to Stevenage life drawing, bringing you more life drawing dates held in St Albans at the fantastic Trestle arts base. We'll be creating art and figure studies using nude artist models.&nbsp; I'll be on hand to bring you tutelage and a critical eye. I'm always working on my knowledge of the human form and its my aim to bring you some drawing insight as I continue my artistic journey. Please feel free to contact me directly if you need any further information.&nbsp;</span></p>\n<p><span> <br></span></p>\n<p><span>contact: Bob email: bobwright@pencilwright.com tel. 07811190714</span></p>\n<p>Venue website:&nbsp;<a href=\"http://www.trestle.org.uk/\">http://www.trestle.org.uk/</a></p>\n<p>My website:&nbsp;<a href=\"http://www.pencilwright.com/\">http://www.pencilwright.com/</a></p>\n<p> Models: Please do not post Directly onto page, send me your details directly, I'm happy to take them.&nbsp; Fair warning: local models close to St Albans &amp; Stevenage get priority, London travel via public transport will usually exclude you from my roster, Trestle is a fair distance from St Alban's station and causes expense and punctuality issues. So local based models and models able to travel by car within an acceptable petrol cost distance will get priority.&nbsp; &nbsp; &nbsp; &nbsp;</p>\n<p><span> <br></span></p>\n<p><span> <br></span></p>\n<p><span> <br></span></p>","city":"St Albans","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36129825","name":"Brixton Stand Up Comedy","link":"https://www.meetup.com/brixtonstandupcomedy","description":"Join us for a showcase of some of the brightest talents on the London Stand Up Circuit.\nWe're located 3 minutes walk from Brixton station at the Trinity Arms Pub.\n\nDate **Every 2nd Wednesday of the month**\nDoors open **7:15pm**\nShow starts **7:30pm**\nEnd time \\~**9:30pm**\nTicket price - **£5**\n(https://www.designmynight.com/london/whats-on/comedy/edgware-comedy-club-thursdays)\n\nThis Meetup is for people who are looking for something social to do on a Wednesday in Brixton.\n\nYou can get drinks from the lovely bar stuff before you find a seat.\nAnd we like to stick around after the show for a couple of drinks.\n\nAll the best,\nLouis","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36164484","name":"Twyford Drama","link":"https://www.meetup.com/twyford-pantomime-2023","description":"The purpose of this meet-up group is to stage plays and pantomimes in Twyford, Berkshire\n\nTo achieve this we need stage hands, front of house, artists, technicians, designers, singers, dancers and whole load of other skills. You can also of course audition for a part in one of our shows!\n\nTwyford Drama is being organised by Twyford & Ruscombe Theatre Group to introduce new people to the fun and satisfaction of staging live performances. No previous experience required. \n\nIf you decide to partipate in our performances then we will ask you to join the theatre group and an annual membership fee of £20 will be payable in June.\n\nWe will be holding a variety of informal events, roughly once a month. There will be no charge o these dates. There will also be social evenings, for which there may be a nominal charge to cover costs.","city":"Twyford","state":"03","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36294393","name":"The Solo Art Group","link":"https://www.meetup.com/the-solo-art-group","description":"The Solo Art Group is a group of artists that has been established for some time. It has already organised 3 group shows and published 2 magazines. The first has the title SOLO and it is a physical magazine distributed to 150 U.K. galleries. The link to it is www.issuu.com/soloprojects. The second is an online art magazine and the link to it is https://bit.ly/ART_LOVE. Instagram: art_lovemagazine. The purpose of the group is to work on further issues of both magazines and to organise more exhibitions. Members get priority in taking part in exhibitions and be included in the magazines. There are also plans for meetings to discuss various art subjects and outings to galleries. Any artist, .curator, collector and generally anyone who is interested in the visual arts should join. Currently we are open for contributions to the ART_LOVE online magazine specifically for the Art for Sale and for the Interviews sections. We do not charge fees or commissions. You can apply directly to the Organiser at ronisvarlaam@hotmail.com.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18536699","name":"Performing Arts for Adults who want to have fun!","link":"https://www.meetup.com/performing-arts-for-adults-who-want-to-have-fun","description":"<p>Looking for a fun way to spend your evenings? Join us at one of our free performing arts workshops!</p>\n<p>Free taster&nbsp;classes that we run include Comedy Acting, Diva Dance, Contemporary&nbsp;Dance, Ballet, Musical Theatre, Acting and Singing!&nbsp;&nbsp;</p>\n<p><b>See our <a href=\"http://www.stageandthecity.com\">website</a> for full details about all of the courses that we offer.&nbsp;</b></p>\n<p><b> <br></b></p>\n<p><br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"25663333","name":"Film, Production and Performing Arts","link":"https://www.meetup.com/film-production-and-performing-arts","description":"<p>Through our networking events we aim to encourage filmmakers to meet and build professional relationships, with each other, potential employers and experts in different fields of filmmaking. <br> <br>We also hold a variety of workshops, speakers and panel discussion and crowdfunding courses to educate independent filmmakers on how to develop, finance, create and distribute their films. <br> <br>Finally we hold a variety of competitions with a variety of prizes which help filmmaker bring their visions to the screen.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"27753673","name":"Stevenage Life Drawing","link":"https://www.meetup.com/stevenage-life-drawing","description":"<p>Join us for Life drawing in Stevenage, run by illustrator Bob Wright. Sister Meetup group to St Albans life drawing, bringing you more life drawing dates held at Stevenage community arts centre. We'll be creating art and figure studies using nude artist models, I'll be on hand to bring you tutelage and a critical eye. I'm always working on my knowledge of the human form and its my aim to bring you some drawing insight as I continue my artistic journey. Please feel free to contact me directly if you need any further information.&nbsp;</p>\n<p>contact: Bob <br><span>bobwright@pencilwright.com</span> <br></p>\n<p> <br></p>\n<p>Venue website:&nbsp;<a href=\"http://www.stevenageartsguild.org.uk/\" class=\"linkified\">http://www.stevenageartsguild.org.uk/</a> <br>my website:&nbsp;<a href=\"http://www.pencilwright.com/\">http://www.pencilwright.com/</a></p>\n<p><span> <br></span></p>\n<p><span>Models: Please do not post Directly onto page, send me your details directly, I'm happy to take them. Fair warning: local models close to St Albans &amp; Stevenage get priority, London travel will usually exclude you from my recurring roster, train and additional public transport results in expense and punctuality issues. So local based models and models able to travel by car within an acceptable petrol cost distance will get priority.</span>&nbsp; Still I have used London based models on occasion in emergencies so no harm e-mailing me.&nbsp;<br></p>\n<p> <br></p>","city":"Stevenage","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"17309982","name":"LGBT Culture Lovers","link":"https://www.meetup.com/lgbt-culture-lovers","description":"<p>A social group for those in the LGBTQ+ community to meet up for cultural pursuits - high culture or low! Theatre, Concerts, Gigs, Musicals, Opera, Dance, Film, Art, Photography, Exhibitions, Galleries, Museums, Historic houses, London history, Food (or other) Festivals, and anything else of a cultural bent. <br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36339091","name":"Queer Women’s Theatre Meetup","link":"https://www.meetup.com/queer-women-s-theatre-meetup","description":"Want to meet likeminded people for theatre trips in Brighton, Hove & beyond? Look no further. Once a month we go see a show then have a drink. Friendly, fun group. You don’t need to be a theatre ‘expert’ to join.","city":"Hove","state":"E2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35904682","name":"London Arts and Culture Meetup Group","link":"https://www.meetup.com/london-arts-and-culture-meetup-group","description":"<p>This is an accessible group aimed at doing more cultural things. I want to keep this group relaxed and welcoming so whoever you are please do come along and together lets see and do interesting things.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35185991","name":"Unbound Moving Arts","link":"https://www.meetup.com/unbound-moving-arts-cic","description":"<p>This is a group for anyone who may benefit from the transformational and healing gifts of the moving arts. Through 5Rhythms dance, movement and the creative arts.</p><p>We are committed to bringing movement practice into support of growth for individuals, communities and the world field. We operate as a CIC (Community Interest Company) and we seek to welcome all dancers and 'non-dancers' into movement and art.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"30780548","name":"The Sketchbookers (Oxford)","link":"https://www.meetup.com/the-sketchbookers-oxford","description":"Calling all amateur, professional and curious wannabe artists, this might be the perfect group for you! Drawing is action. I have had a passion for the arts since childhood.\n\n'The teaching of drawing is the teaching of looking.' A lot of people don't look very hard - David Hockney\nThis group is an opportunity to:\n• draw/sketch/create (whatever you like to call it) in a group environment.\n• see other ways of expression\n• spend a few hours broadening horizons on sketching and drawing\n• practice. Doing is thinking. And looking!\nAfterward, maybe find a pub for a nice long drink and share ideas on art and have a laugh!\nEveryone has the ability to draw. I look forward to meeting you at an event! ","city":"Oxford","state":"K2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34192102","name":"ART & CULTURE - LEVEL","link":"https://www.meetup.com/art-culture-level","description":"<p>Hello! This Meetup community is organized by LEVEL and focuses on all things art and culture!</p>\n<p>LEVEL is a group of experts who believe in power of art to initiate personal transformation. We deliver high quality talks and discussions that improve cultural competence and expand our own emotional intelligence through art. </p>\n<p>The aim of the project is to use artistic practices (like painting, architecture, fashion, language etc) to explore different meanings, philosophies and values of foreign world views. Dismantling stereotypes, cliches and prejudices in a peaceful way of learning holds a beautiful potential to build compassion towards others and simply enjoy the process of understanding arts.</p>\n<p>We offer online lectures - join our events and embark on a journey towards a new perspective!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"5293682","name":"Creative eXchange  (Berks & Hants)","link":"https://www.meetup.com/creative-xpressions","description":"<p>Are you creative?&nbsp; Then this is the group for you! <br></p>\n<p>Creative eXchange is all about sharing ideas and enthusiasm across a broad spectrum of creative endeavours.&nbsp; The goal is cross-fertilisation of inventiveness and skills in diverse disciplines: This generates the vital energy and inspiration you need to be productive in your chosen field.&nbsp; Note: This meetup is a not-for-profit group.</p>\n<p>Whatever your field of creative activity, it's extremely helpful to bounce around ideas with other positive, enthusiastic, inventive people.&nbsp; Members with a wide range of skills and talents, provide objective feedback, encouragement and constructive advice for each other.&nbsp; We exchange new ideas and get a different perspective on our current projects, always in a relaxed, fun and sociable way.&nbsp;&nbsp;</p>\n<p>We promote regular social and creative meetings, workshops and collaborative projects, with emphasis on the exchange of ideas between creative disciplines - music, painting, photography, creative writing, poetry, drawing, sculpture, printmaking, textile arts, glass art, interior and garden design, illustration and so on.</p>\n<p>We have an annual theme, deliberately open to wide interpretation (currently \"Action/Reaction\" - see project discussion here.)&nbsp; The aim is to use it as a starting point for invention and making, leading up to a group exhibition at the end of the year.&nbsp; We want to encourage as much diversity as possible in the creations we exhibit, including 2-dimensional art and as many other forms as we can practically show the public.&nbsp; <br></p>\n<p>Watch out for up-coming meetups in which we will share, discuss and develop project ideas.&nbsp; Please don't hesitate to contact your group organisers to request or offer workshops on any specific technique or topic.&nbsp; Remember to Track discussions you're interested in, to receive notifications of updates.</p>\n<p>Wishing you the best of creative energy!</p>","city":"Spencers Wood","state":"03","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19029882","name":"Crouch End Figure Life Drawing","link":"https://www.meetup.com/crouch-end-figure-life-drawing","description":"This is a group set up to enjoy life drawing in a different way and in a real artist Studio. Located in a busy and interesting creative hub like all artistic Studios, these meetings are a chance to draw with professionals, learn from each other and also relax in a cosy, friendly environment over a cup of tea, coffee and sometimes drinks at the pub. My sessions are varied and memorable, and sometimes I invite athletes, dancers, theatre performers, contortionists, etc. This group is open to both professionals and beginners. I look forward to welcoming you to The my Studio Olympia Industrial Estate, Unit 3, Studio 8, Coburg Road, Wood Green, London N22 6TZ.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"31609623","name":"ACT - Aspire, Connect & Thrive","link":"https://www.meetup.com/act-aspire-connect-thrive","description":"Collage Arts, an organisation of artists, look after the old post office in Wood Green's library mall, along with a disused warehouse space in Coburg Road, a old sweets factory in Coburg Road, and a empty council building in Cumberland Road, collectively known as the Collage Artspaces. We create artistic opportunities in Wood Green’s Creative Quarter. Learn about what's on offer, connect, participate, share skills, experience art.  \n\nWe run:  \nCollage Voices - creative expression, performance, writing, digital music for 8 to 28 year olds, \nCollage Works - creative, digital and enterprise skills for over 18s. \nCollage Events - jazz, live music, spoken word, childrens theatre, and exhibitions at our venue, Karamel - McQueens Theatre, and annual N22 Open Studios. \nCollage Arts is an ethnic minority-led, arts-led, social action and educational charity. We have been developing and connecting creative communities in and around Haringey for over 37 years.  \nwww.collage-arts.org","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"22880562","name":"Sussex and Surrey Improv Comedy Meetup","link":"https://www.meetup.com/sussex-and-surrey-improv-comedy-meetup","description":"<p>If you are interested in theatre, comedy, performing, storytelling, writing, meeting creative people in the local area or just having a laugh, then this group is for YOU!</p>\n<p>Improv is the art of collaboratively creating theatre in the moment. It can be dramatic, it can be funny (it doesn't have to be!), it can be emotional, it can be musical, it can be anything! It's brilliant to behold and it's liberating to do. There's no wonder its taking the world by storm at the moment. It's a fast growing scene in London and Brighton right now but there's not much improv in between the two cities. This is where we come in!</p>\n<p>There's a great variety of ways you can become involved with 'The improv community of Sussex and Surrey'...</p>\n<p>- Join us in our Zoom improv workshops from anywhere across the globe.</p>\n<p>- We meetup in Horley and Crawley at least once a week to practice improvisational theatre techniques in fun and supportive workshops. (Currently postponed for obvius reasons)</p>\n<p>- Participants of these workshops have the option to become involved in showcases in local theatres. These are really fun to be in or to watch</p>\n<p>- We're always going on trips to see improv shows in London, Brighton or anywhere in between.</p>\n<p>- Then there's all our other social events (in the pub mostly)</p>\n<p>We sail under the banner of 'Dingbats Improv' and you can find out more about us on our website <a href=\"http://www.dingbatsimprov.com\">www.dingbatsimprov.com</a></p>","city":"Horley","state":"P6","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36170936","name":"Acting For Beginners","link":"https://www.meetup.com/acting-for-beginners","description":"This is an Acting class for beginners (professionals and non-professionals) but everyone and all degree of experience welcomed.\n\nActing exercises include (but not limited to): relaxation, improvisations, games, storytelling and text work (a bit later on). Aside from learning more about acting, these exercises provide wonderful tools to build confidence, get more more comfortable with public speaking and interactions, and connect to yourself and others. And it’s fun too!\n\nPart of this upcoming term will be dedicated to scene work which we will showcase on the evening of the 6th of July for friends and family at the Omnibus Theatre. \n\nMy name is Catherine and I have been acting for the last 20 years and teaching in various drama schools for the last 10 years. I hold an MA in Actor Training and Coaching (teaching Acting) from the Royal Central School of Drama.\n\nThe session starts at 10:00 am and finishes at 11:30 am on Fridays. The trial session is 10 pounds and should be paid before the session in order to reserve your spot. Different payment options are available if you do decide to come back.\n\nThe class is at Clapham Methodist Church in Clapham Common. \nIt will take place every Friday morning term time. Please send me a message at catherine@thebrightdaycompany.net to reserve your space or visit www.thebrightdaycompany.net for more information.\n\nHope to see you there!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36091157","name":"Brighton Adult Drama Classes with Savage Heart Theatre Co","link":"https://www.meetup.com/brighton-adult-drama-classes-savage-heart-theatre","description":"Hello! We are Savage Heart, a Brighton based theatre company running drama classes and workshops for adults of all ages (18+) and levels of experience. Join this meetup group to find out about our regular courses and 'Taster Sessions.' Our classes are run by theatre director Joy Forsythe and writer/performer Rachel Mae Brady. We have years of experience running workshops and creating safe spaces for participants to express their creativity.\n\nIn 'Beginners' Drama' we play drama games, learn acting technique and get creative with character and script work. If you’ve been struggling with group interaction as we return to ‘normal life’, this course can help ease you back in to social settings. Emphasis is on confidence building and having fun.\n\nIn 'Intermediate Drama' we delve further into the world of performing. This course offers a more in depth look at acting technique in a welcoming and fun environment.","city":"Brighton","state":"P6","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"24477220","name":"Drawing values - London tutored draw and paint studio","link":"https://www.meetup.com/london-tutored-draw-and-paint-meetup","description":"Art classes focused on figurative and abstract drawing and painting. Addressed to beginners, intermediate or advanced adult learners.\nArt classes focused on figurative and abstract drawing and painting. Addressed to beginners, intermediates and advanced learners who would like a taste of a different approach.\nThe goal of these classes is to introduce the student to the fundamentals of painting and drawing. It's more possible to express ourselves successfully when we understand how a visual language is structured.\nClasses consist of studies on still life and nude human compositions. Media to be used are charcoal, pencil, acrylics, ink, and watercolours.\n\nLocation: Tannery Arts studios, 15-19 Parkhouse St. Camberwell, London SE5 7TQ\n*Tannery Arts has no affiliation with these classes and is not responsible for their content.*","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36187305","name":"Amateur Drama Classes","link":"https://www.meetup.com/amateur-drama-classes","description":"This is an Amateur Drama Class that takes place every Friday morning from 10 am to 11:30 am at Clapham Methodist Church.\n\nActing exercises include (but are not limited to): relaxation, improvisations, games, storytelling, and text work (a bit later on). Aside from learning more about acting, these exercises provide wonderful tools to build confidence, get more comfortable with public speaking and interactions, and connect to yourself and others. And it’s fun too!\n\nMy name is Catherine and I have been acting for the last 20 years and teaching in various drama schools for the last 10 years. I hold an MA in Actor Training and Coaching (teaching Acting) from the Royal Central School of Drama.\n\nThe session starts at 10:00 am and finishes at 11:30 am on Fridays. The trial session is 10 pounds and should be paid before class in order to reserve your spot. Different payment options are available if you do decide to come back.\n\nThe class is held in a hall at Clapham Methodist Church (entrance on Nelsons Row). It's the last door on the left (at the end of the rail). There will be a sign on the door.\n\nFor the last term of class, we will be working on scenes that we will showcase for friends and family on the evening of the 6th of July at the Omnibus Theatre. \n\nIt will take place every Friday morning during the term. Please send me a message at catherine@[thebrightdaycompany.net](http://thebrightdaycompany.net) to reserve your space or visit [www.thebrightdaycompany.net](http://www.thebrightdaycompany.net) for more information. If you do reserve on Meetup, please make sure you attend the session or cancel if you can make it as it will allow people on the wait list to join. Thank you!\n\nHope to see you there!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"33059250","name":"Living Room London Arts","link":"https://www.meetup.com/living-room-london-arts","description":"<p>Art is the expression or application of human creative skill and imagination, typically in a visual form such as painting or sculpture, producing works to be appreciated primarily for their beauty or emotional power. We wanna nurture and encourage our community to develop in all arts and expressions of the soul!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"33442418","name":"Mindset Salon: Mindful & Curious Empaths and HSPs","link":"https://www.meetup.com/london-mindset-salon-empath-hsp-meetup","description":"<p>Welcome to the ‘<strong>Mindset Salon: Mindful &amp; Curious Empaths and HSPs</strong>’ group!</p><p><br /></p><p>Do you remember the feeling when you found out that you are an Empath, or a Highly Sensitive Person or maybe both? Maybe you ‘accidentally’ came across a book, an article or maybe you took one of these tests:</p><p><br /></p><p><a href=\"https://drjudithorloff.com/quizzes/empath-self-assessment-test/\" target=\"_blank\">https://drjudithorloff.com/quizzes/empath-self-assessment-test/</a></p><p><br /></p><p><a href=\"http://hsperson.com/test/highly-sensitive-test/\" target=\"_blank\">http://hsperson.com/test/highly-sensitive-test/</a></p><p><br /></p><p>You felt a sudden relief mixed with the realisation that you are not alone. Oh, the pure joy of it!</p><p><br /></p><p>The next thing you thought: How do I meet fellow Empaths or Highly Sensitives? Where can we socialise? You crave deep discussions, arts and culture and you are always curios and want to learn more.</p><p><br /></p><p>The ‘Mindset Salon: Mindful &amp; Curious Empaths and HSPs’ group is a safe place to express yourself and your ideas while meeting with fellow kind, joyful and creative Empaths and Highly Sensitives.</p><p><br /></p><p><strong>This group is focusing on the following topics:</strong></p><p><br /></p><p>Intuitive coaching and mentoring: Holistic coaching using positive psychology, mindfulness and traditional coaching techniques from a trained, professional coach. The sessions are taking place in person or online, in a small group setting or one-to-one format.</p><p><br /></p><p>Intuitive Reading &amp; Energy Healing: Most Empaths and Sensitives are very spiritual but sometimes their energies are unbalanced due to them being unaware that they are taking on other people's energies. With the help of a trained Energy Healer, these unwanted energies can be effectively removed.</p><p><br /></p><p>Empaths and HSPs are craving real connections and meaningful discussions. Due to the pandemic we had to take a break, but hopefully we'll have the chance to meet up soon socially too.</p><p><br /></p><p>The type of social events this group offers from the new year are:</p><p><br /></p><p><strong>Informal discussions: </strong>We’ll go to a restaurant or a pub and have a laid-back discussion on Life as curious and creative Empath and HSP. Each event will focus on a different topic.</p><p><br /></p><p><br /></p><p><strong>Art &amp; Culture Social:</strong> We'll immerse ourselves in London's superb arts and cultural life; we’ll go to a museum, art gallery or see a new show together and network afterwards.</p><p><br /></p><p>Hope to see you soon!</p><p><br /></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18550856","name":"China Britain Art Centre - based in Oxford","link":"https://www.meetup.com/china-britain-art-centre-based-in-oxford","description":"This is a group for people who are interested in Chinese arts, culture and language. We are a group of artisits who are dedicated to promote the UK-China art culture exchange. We will meet once a week for various workshops such as Guzheng (古筝）- a traditional Chinese musical instrument, Chinese classical dancing, Chinese calligraphy, Chinese brush painting and Chinese language. We can also meet at all the events we hold such as Sino-British concert, art work exhibitions, and so on. We bring Chinese students to Oxford every year to experience a totally different summer and winter holidays, and we also bring people who are interested in Chinese culture to China for art exchange. Come and join us if you have any interest in any of the Chinese arts and cultures. Looking forward to meet other art enthusiasts!","city":"Oxford","state":"K2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19521934","name":"Wycombe Arts Festival","link":"https://www.meetup.com/wycombe-arts-festival","description":"<p>Anyone interested in attending Arts Festival events, helping out, venues, artists&lt;/p&gt;</p>\n<p>History of the festival</p>\n<p>The Wycombe Arts Festival was started&nbsp;50 years ago. It is a registered charity, and is a non-profitmaking organisation. We solely rely on sponsorship from local people and organisations (these are credited where applicable in the programme). We also have a number of regular Patrons, (see list elsewhere on the website), who pay a minimum subscription - currently £24 - each year. Obviously, without this support, we would not be able to provide such a variety of events, so we would like to repeat our thanks to these organisations and individuals. <br> <br>The Festival is organised entirely by volunteers, who work hard throughout the year to arrange a mixture of events across the artistic spectrum for our local community. </p>\n<p> <br></p>\n<p>About Wycombe Arts Festival&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <br> <br>Booking Hotline: 01628 483597&nbsp; <br><a href=\"http://www.wycombeartsfestival.org/%3Ca%3E\"></a> Focused in and around High Wycombe and Marlow in the South of Buckinghamshire within the Chiltern Hills, the festival offers a wide range of the arts, both amateur and professional.&nbsp; <br>Its aim is to embrace and engage all members of the community. <br> <br>2014 marked the festival's 50th anniversary.&nbsp; Each year, the festival includes a wide range of musical events including jazz, chamber and orchestral concerts, photographic and art exhibitions, theatre productions, National Trust walks, storytelling and talks on subjects of local interest and much, much more. <br> <br>This large range of events reinforces the aim of the festival to bring a wide variety of performing and visual arts to the widest possible audience at a reasonable cost. <br></p>\n<p><img alt=\"Picture\" src=\"http://www.wycombeartsfestival.org/uploads/1/6/6/6/16665800/1427233295.png\"></p>","city":"Hughenden Valley","state":"B9","country":"gb","isPrivate":false,"isNewGroup":false}]