[{"id":"29633333","name":"GIN (Gay Indian Network) The LGBTQIA Indian Network in UK","link":"https://www.meetup.com/gin-gay-indian-network-london","description":"Connecting (and supporting) the LGBTQIA community of Indian Heritage and the wider Diaspora with each other and their friends and allies in London and the United Kingdom.\n\nGIN is a fun and sociable networking group for LGBTQIA community of Indian origin and their friends and allies that would like to get to know each other in a friendly group.\n\nWe have around 5 meetups per month (both physical and online). We also have a monthly “deeper connection” Saathi conversation group.\nWe organise trips to museums, places of interest, Indian restaurants, LGBTQIA social support events, Bollywood and Bhangra playing LGBTQIA clubs, And we also have the occasional fun party or two 😃\n\nThis group is open to all LGBTQIA people of any nationality or race that are interested in getting to know more about India and people of Indian origin.\n\nTo help our members stay connected, we also have:\n\n1\\. GIN & Lime Womens' group\\.\n\n2\\. GIN Book Club & GIN Film & Arts Club\\.\n\n3\\. GIN 1 to 1 Buddy Telefriending Service\\.\n\n4\\. GIN Midlands for members in Birmingham\\, Coventry\\, Leicester\\, Nottingham\\.\n\n5\\. GIN & Bombay Tonic Whatsapp Group with over 140 members\\.\n\nWebsite:\n\nhttps://www.gayindiannetworklondon.com\n\nTwitter: @GINindianUK\n\nInstagram: @ginindian\n\nLIABILITY WAIVER: GIN LGBTQIA Indian Network Meetup Group (\"GIN\")\n\nBy joining the GIN Meetup group and signing up for or attending any event, you acknowledge and accept the following Liability Waiver:\n\nI do hereby absolve, release and waive any and all civil or criminal liability litigation claims or demands against GIN (including its Organizer, Assistant Organizers, and event hosts), which may arise out of or be related to any injury, illness, damage or monetary loss to me, my guest(s), or any member(s) of my friends and family by reason of involvement in any group or group-related activities.\n\nBy joining GIN, I accept this waiver, and hereby acknowledge that I am solely responsible for my own safety during any event or group-related activity and that, if intoxicated, I will not operate a motorized vehicle after leaving any GIN meetup event.\n\nOur website is: \\\n\n[https://gayindiannetworklondon.com](https://gayindiannetworklondon.com)\nAnd you can follow GIN on Twitter: \\\n\n[https://twitter.com/GINindianUK/status/1329945689804206081?s=08](https://twitter.com/GINindianUK/status/1329945689804206081?s=08)\nAlso on Facebook: [https://m.facebook.com/GayIndianNetwork.UK/?ref=py_c](https://m.facebook.com/GayIndianNetwork.UK/?ref=py_c)","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"4721202","name":"Up In The Cheap Seats - Enjoying London Theatre","link":"https://www.meetup.com/up-in-the-cheap-seats","description":"Welcome to **up-in-the-cheap-seats**. This group aims to bring together people who share a common aim - to *see theatre at reasonable prices*.\nAll are welcome at our events - We've met so many lovely people and everyone has been so friendly and enthusiastic. Group sizes vary so we can meet up before and get a chance to talk to each other. We have a great group of organisers with varied tastes and interests; which keeps our calendar filled with mainstream and more eclectic events.\nWith over **2,200 events** in the 10 years we've been going, the variety of shows we've seen is immense. We see a mixture of musicals, plays, opera, ballet, music, comedians and films and are always open to new suggestions! A calender of our events can be found here: [https://www.meetup.com/Up-in-the-cheap-seats/events/calendar](https://www.meetup.com/Up-in-the-cheap-seats/events/calendar)\n**There is a one-off joining fee of £2.50** to be a member of **up-in-the-cheap-seats**. These funds will be used to cover the meetup fees and cover expenses associated with running the group. \n\nPlease note, if you are an inactive member for many months (i.e. if you don't log into the website or don't attend any events), you will be removed from the group as we encourage this group to be as active as possible.\nSo......how does it work? \n\n**We buy our own tickets.** Your event organiser will add a link on the event invitation so you can buy your ticket at the same price that they enjoyed. Obviously the price is not guaranteed especially if the show is popular or you wait a few days before booking.\n\n**Please update your RSVP to confirm that you are joining us.** The organiser will normally add a comment to the event page saying which seat they have purchased. This isn’t mandatory but helps others decide on their seat selection – it is always nice to be sat near or next to another member of the group! The group does not charge to attend individual events (just the one-off £2.50 joining fee). Therefore Meetup states that the event is free. This does not mean that your ticket is free - you will need to purchase this yourself.\n\nThe event host will post the meet up details a day or two before the show.\n\nWe usually meet outside the theatre or in one of the theatre's bars around 30 minutes before the show.\n\nIf there is an interval we will meet up again in the bar at the interval so we can all share our opinion of what we have enjoyed (or not!) so far.\n\nWe will also usually meet up afterwards for a brief chat about the show but sometimes (depending on how late it is and the day of the week), we may go on somewhere for a drink and a longer chat.\n\n**If you are unable to make an event, please change your RSVP** so that your host knows not to wait for you.  \n\nHope to see you at an event soon,\n**Your UITCS Oraganisers**\n\\*Please note, this group does generate a lot of email, but the good news is these settings are customisable, and can easily be changed by going to 'My Profile', then 'Emails' and 'Notifications'.","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"33123951","name":"Walking and Wine Women's Group","link":"https://www.meetup.com/walking-and-wine-womens-group","description":"A women's social group for over 40's based around Ealing/West London.\nWalking and wine are two of my favourite things along with good company, food and occasional gallery/film/theatre - events will reflect this. Locations will be a combination of local, central and further afield green places.\nIdea is to have a relatively small active membership group (capped at 70) with events of around 6-8 people so everyone can get to know each other.\n\nMembership notes:\n\\*A photo showing your face is required to join this group.\n\\*Please sign up to events with consideration, 'no shows' or late cancellations will likely result in member being removed from group.\n\\*To maintain a small active group non-active members will periodically be removed.\n\nIf you have ideas for events or would like to host your own let Babs know.\nBring with you a friendly, generous and inclusive attitude.","city":"Brentford","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"19864815","name":"London Lesbians & Queer Womxn","link":"https://www.meetup.com/llqwomxn","description":"<p>A million welcomes into our little corner of the Meetup community, a place to meet likeminded womxn and non-binary people in the ever so brilliant city of London!</p><p><br /></p><p>This group welcomes all womxn and non-binary people who like womxn and non-binary people! Whatever sexuality you identify as, from lesbian-bisexual-pansexual-queer-gay this group is inclusive.&nbsp;&nbsp;</p><p><br /></p><p>We are also age, ability, race, cultural identity and everything else you can identity as inclusive.&nbsp;We never tell you how to look or identify to attend an event or restrict you narrowly to just identifying as 'lesbian'.&nbsp;Occasionally we might run an event which is specifically targeted as part of our community and if we do that we will always tell you why (an example might be an event centred around black, asian and ethnic minority members, dating for a specific group or for vegans); this is never to exclude you but to connect an even more marginalised membership of our community or where members might share a very specific common interest.</p><p><br /></p><p>We are super friendly, always welcoming to our new and regular members, and no matter who you arrive with or arrive alone, you will most definitely leave with new connections and awesome people to hang out with at future events or meet with outside of the group.</p><p><br /></p><p>I know how daunting it can be to come to your first event.&nbsp;Will anyone talk to me?&nbsp;Will I connect with other members?&nbsp;Will the ground open and swallow me right up?&nbsp;I promise after the first few minutes of nerves, you'll have been greeted by one of our lovely hosts and be made to feel part of the furniture.&nbsp;If you are super nervous please alert your host in advance and I recommend to always arrive at the start when it's slightly quieter and you can get more individual attention from your host.</p><p>With the sharp decline of bars for queer womxn and non-binary throughout London, Meetup really is the best way to network and make new connections. Events will be varied, including food, film, drinks, art (although right now during Covid-19 times were are much more restricted to meeting online). If you would like to organise an event get in touch!&nbsp;We are always looking for diverse hosts who are representative of our awesome community.</p><p><strong> </strong></p><p><strong>PLEASE READ</strong></p><p>To enable us to build a great community please treat any events you sign up to as if you were meeting a friend; unless you have an emergency (sometimes life gets under your feet!), make sure to turn up on time and give plenty of notice if you are unable to attend.&nbsp;It is only courteous.&nbsp;Imagine if you arranged to meet a friend and you never showed up... that friendship wouldn't last long!</p><p>Please note this is a group for adults (18+)</p><p><strong> </strong></p><p><strong>PLEASE DONATE</strong></p><p><br /></p><p>Meetup currently charges organisers $180/year to maintain these event pages on their platform.&nbsp;</p><p>If you can, please donate just a few pounds to the group host via PayPal (LQWmeetup@gmail.com) when you join to help cover these fees.&nbsp;</p><p><br /></p><p>Those with access to a steady, living income or other wealth are encouraged to donate more.&nbsp;</p><p>Please do not be deterred from attending if financial hardship prevents you from donating.</p><p><br /></p><p><strong>MAILING LIST</strong></p><p>Please sign up here:&nbsp;<a href=\"https://mailchi.mp/28160a803d0b/llqw\" target=\"_blank\">https://mailchi.mp/28160a803d0b/llqw</a></p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36414279","name":"Prince Charles Cinema Social Group","link":"https://www.meetup.com/prince-charles-cinema-social-group","description":"A group for those of us who find the Prince Charles to be our Spiritual Home (cinematically speaking).\n\nAnyone who loves watching movies in this historic cinema should join to do this is in a social context with like minded people. The Prince Charles Cinema shows a rotating programme of cult, arthouse, and classic films alongside recent Hollywood releases – typically more than ten different films a week on two screens. Occasionally we will do events at BFI and independent cinemas that reflects the films we love.\n\nWe will have events covering everything from single movies to marathons with a drink before or/and after.\n\nWe welcome anyone who would like to host a film.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1403494","name":"Chillout London","link":"https://www.meetup.com/chilloutlondon","description":"Bringing like-minded people with the same passions together in a fun social setting for FREE. Whether it's a particular genre of music/club night/dancing,  theatre/acting, food, singing/rockaoake, sports/fitness, comedy, art, pub crawls, cutting edge science, spirituality actvities - we host free fun themed events to ensure only like minded people with the same passions get to meet and particpate as life is too short to spend time with people who do not excite and or engage you.\n\nOur membership is biased towards successful but unpretentious career professionals with highly engaging personalities who are are socially skilled, outgoing, intellectually curious and creative with outstanding sense of humour! We value quality over mediocrity so attempt to constrict attendees to people with an authentic love of the event theme to both foster good engagement dynamics & keep attendees to a manageable size.\n\nOur London events are hosted by a born Londoner who know the city and hidden gems inside out! We also avoid holding events in touristy/sleazy venues so attendees get to enjoy authentic London venues & experiences and meet native brits anf form long lasting connections easily. Typical past events have included stargazing, rockaoke, music themed clubbing events (80s, 90s, 70s, 50s, Hip Hop & Reggae nights), sports events (badminton, rounders, tennis), Halloween pub crawls/tours, exhibitions, dinners/food tasting/supper club, lunches/brunch, coffee, firework displays, talks/seminars, concerts - you name it - we've done it!\n\nWaiting lists wise - when places become available, preference will be given to people with complete profiles who can demonstrate a genuine passion for the event theme, to the most loyal members and those with a close proximity to event location so it is parmount you fill out your profile!!\n\nAnd here at Chillout, our philosophy is you shouldn't have to pay a premium to enjoy the things that you love so in accordance with the fundamental founding tenet of Meetup - the vast majority of our events are free - no profit motive here! However in rare cases, where direct or venue hiring costs are incurred for putting on a specific event, there maybe a small charge.\n\nSo, whether you’re originally from London or brand new to the city, here's to enjoying some memoriable crazy times out with a select audience and even forming strong new authentic long lasting connections along the way.\n\nLucas - Founder & Organiser (and essay writer!)\n***Please note, if you are identified to having different motives for attending events other than for socialising around a shared theme that you are truly passionate about or found to be harassing members or seeking sexual conquests you will be removed. For security screening and protecting our members - everyone must have a full face pic prior to attending an event so they can be indentified in the case of any issues. If any ladies recieve unsolicited contact from random people they have never met please feel free to report to me (so I can remove) and contact meetup site directly.*** \n\nFeel free to follow us on Twitter to Keep updated with new events here:\nhttps://twitter.com/Chillout_London\nhttps://twitter.com/LucasBulsara\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAnd now for some blatant testimonial marketing (generous bank transfers on way):\n\n\"His energy, event passion, beauty and brief conversation shifted my mindset tremendously in less than a few minutes which is very rare when attending meetups\" Clare\n\n\"I went to Chillout London when I was new to the city from the USA and I always had a really great time. Everyone was super friendly. Lucas always has cool captivating themes and I always felt deeply engaged, never bored. I would definitely recommend!\" Staci Schidmt\n\n\"The organiser is late often and as a former teacher I have no idea how he made it through school or university without being expelled but his events are so novel & addictive I just can't stay away\" Reena Teacher\n\n\"Meeting Lucas and attending his event was a lovely experience. He had so much knowledge and passion. It was really good. Very impressive\" Komal\n\n\"It's about time Lucas grew up, got a girlfriend/got married like the rest of his mates instead of wasting his time on this meetup nonsense. He should be hanging out with his real friends!\" Adam Joslin\n\n\"The organiser is one of the funniest entertaining people I've met. He is really passionate about all his event themes and so there is always an air of excitement and never a dull moment. Now I'm a semi regular - I always leave either learning something new or laughing on the way home\"  Lorraine Norton\n\n\"Organiser jokes around a lot but I love him. When he was DJing at his club event party he refused to play Never Tear Us Apart for me so if you like good music I suggest you avoid Chillout events\" Dominika Abel (Assitant Organiser)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"8680152","name":"Bexley Area Circle of Friends - For Ladies","link":"https://www.meetup.com/bexley-area-circle-of-friends","description":"We are a friendly group of ladies from Bexley, Crayford, Dartford, Sidcup and surrounding areas. This group is aimed at ladies in the 50 plus age group who feel they would like to make new friends. Do you want to chat over a coffee, go for a walk, see a film, dine out, or a number of other activities? Come on then ladies lets build a Circle of Friends!\nOccasionally some venues are small so numbers will be restricted, we normally have a waiting list for these events in case someone can't make it, so click on the rsvp anyway and that will add you to the wait list, and check back near the time to see if you have been added to the event.\nSo you can't find something to fit in with your commitments, why not host an event? Please speak to one of the organisers.\n\n**Membership fees are used to pay the costs that Meetup charge for us to use this site.**\nMembership fee is £5.00 per year due by 1st December each year. Any members who haven't renewed by 1st December risk being removed.\nNew members have **two months** to join in as many events as they would like before membership will be due if you decide to stay with us.\n**New members fee is £5.00 due two months after joining**, renewal due 1st December every year thereafter.\nMembers may bring a friend (+1) along to 3 meetups as a guest. After this they would need to join and pay their membership fee before attending more events. **Please note that popular events will be available to members first, therefore I would urge you to encourage your +1 to join otherwise they could miss out!**\nWe look forward to meeting you all.\n\n**The rules**\nIf you RSVP yes to an event and then for some reason you can't make it please change your RSVP to not going at least **24hrs** prior to the event starting **preferably 48hrs**, **this includes the waiting list**, as it's unfair when people don't show up or cancel at the last minute, it holds up the group waiting for someone who's not coming, plus may prevent others from attending an event that's full.\n\nAlso anyone who repeatedly RSVP's to events and then cancels will risk being removed from the group, as this prevents others from joining in.\n\nDO CHECK YOUR DIARIES BEFORE SAYING YES TO AN EVENT!!!!\n\n**To remain a member you will need to have attended an event in the last 6 months, this is to enable new members a chance to join.**\n\nSorry but if you RSVP yes 3 times and then don't show up without changing your RSVP to not going you will be removed from the group.\n\nAll members are required to have a **profile picture of their face not views, pets or other family members!**\n\nThat's it for the rules, so we look forward to seeing you all and building our circle of friends. x","city":"Crayford","state":"G5","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"26230711","name":"Bracknell & Ascot Walking and Social","link":"https://www.meetup.com/bracknell-ascot-walking-and-social","description":"<p> Welcome !&nbsp; <i> <br></i></p>\n<p><i>Before sending a join request , please note that we require a nominal membership fee of £12.00&nbsp; per year, payable in January when you request membership. This covers administration and running costs.&nbsp; &nbsp;Due to Covid limiting the number of events we can put&nbsp; on ,for 2021&nbsp; only, this payment will be prorated per month ( ie join in April , fee is £9 )&nbsp;</i><br></p>\n<p>This is a group for those interested in walking, socialising and doing new things.&nbsp; We hold a short walk local walks most evenings&nbsp; in the week just to get some fresh air after work and go for longer walks further afield most weekends. We hope to offer a good selection of walks from easy sociable walks to longer distances. <br></p>\n<p><i>note : Whilst we do our best to ensure that our walks are safe and enjoyable for every walker participating, in the unlikely event of an accident please understand that you are responsible for your own well being and that we (the organisers and other members) cannot accept any responsibility for loss,injury or any other unwanted incident that may occur at our planned events</i>. <br></p>\n<p>We try to do a variety of different activities such as going for evening meals locally, catch a film, hold quiz nights and go for the odd trip away. If you are interested in meeting new people and enjoying a social side to your walking this group should be for you. <br></p>\n<p>Everyone is welcome to pop along to any event, but if you are a little shy, then please contact one of the organizers and we will do everything we can to make your first event with us as easy as possible.</p>\n<p>Do join us and come along for some fun, don't just sit at home on your own</p>\n<p>PLEASE ASSURE YOU HAVE A PHOTO OF YOURSELF ON YOUR PROFILE AS WE DO NOT ACCEPT ANONYMOUS MEMBERSHIP. <br></p>","city":"Bracknell","state":"03","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36086242","name":"THE FILM ATELIER  Folk Indie Classical Music Jam, Gigs Meets","link":"https://www.meetup.com/musicians-london-southeast","description":"**For: Acoustic musicians, singer-songwriters, classical musicians and musical instrument & world music players!**\n\n(Not for: Drum N Bass, Rap, RnB, Soul, Funk, Electronica or X factor style commercial music)\n\n**Who Should Join: Solo acoustic instrumentalists, singer-songwriters, session players, keen musicians who know their way around their instrument; those looking for ensemble playing experience and performance. We are not an Open Mic. Meet-up is just one platform we use and we currently trial Meet-up to see whether this is worth continuing with.**\n\n**What we do at events:** We are a new independent start-up! Acoustic Music is core to our emotional well-being, down the the rhythm of our heartbeat. We promote being well and healthy through music and developing a small local community of budding musicians who are otherwise isolated and disconnected from growing with other musicians.\n\n2 hours long acoustic music sessions limited to a max of 8 musicians. We work on shared and agreed music repertoire and play as an ensemble or session. We have our own performance space and audience in the acoustic cafe coffeehouse style.\n\nWe currently run 5 acoustic music meet ups:\n\n**1\\. Classical Chamber Meet\\-up: Saturdays 3\\.00pm \\[sessional depending on players\\]**\n**2\\. Singer\\-Songwriter Indie Alternative Session: Saturdays 5\\.00pm**\n**3\\. Alt\\. Folk Acoustic Session: Wednesday 6\\.00pm**\n**4\\. London Chinese Music Instrument Music Meetup: Sundays 2\\.00pm \\[Private\\]**\n**5\\. World Music \\[Acoustic instruments only\\] Meet up \\[NEW\\]: Sundays 2pm** \n\n**1\\. Classical Music & Chamber Music Meet\\-up:** If you know your way around your classical instrument (cello, violin, flute, clarinet etc), and are interested in meeting like minded instrumentalists to grow and nurture classical ensemble playing- drop us a message with your instrument and repertoire interest! We work out scores with parts we can rehearse and put together.\n\n**2\\. Acoustic Indie Alternative Sessions:** Unlike Open Mics, we work around each others' songs and songwriting, traditional folk and original songs creating instrument parts from the collective of musicians. By alternative, we refer to the spirit of alternative music in its non-commercial, non-saccharin lyrics and non-pop structure.\n\n**3\\. Alt\\. Folk:** we started off performing as folk musicians and love folk music by T Bone Burnett, Wovenhand, Jason Isbell and the Indigo Girls. We play loosely and openly embrace new twists and turns to folk music. We're definitely not oldtimer style!\n\n**4\\. London Chinese Music Instrument Meet up:** Private session. Interested players committed to performing and long term playing are welcome to enquire. From time to time we invite new members.\n\n**5\\. World Music \\[Acoustic\\] Meet up:** open to anyone who plays or sings (ethnic) world music acoustically. First meeting scheduled for Sunday 3rd May 2022 @ 2pm\n\n**Email: thefilmatelierse6@gmail.com**","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"17549802","name":"London Theatre & Film Meetup","link":"https://www.meetup.com/london-theatre-and-film-meetup","description":"**A Social group for People who enjoy WestEnd Theatre and Film Shows!**\n**Maybe a bit passionate... serious theatre and film goers needed!**\nWhat we do is to get a group of like minded individuals (That's YOU) to get together and watch Theatre and Films in London, with a **bit of socialising** throw in - I have met some really lovely interesting people. We are a **busy** group and see more than just one or two shows a month!\nWe love theatre in with A-listed stars in them, musicals, fringe, tear jerkers, films with George Clooney, serious dramas, indie films, cult classics, comedy, opera in fact anything goes. The only criteria for joining is you love the Theatre and Film, so become one of us!!!!\n*Often I have priority booking for shows and I will get tickets for the group -'cos its more fun sitting together.*\n*And of course if I hear of any deals, discounts or special events I will let you know!*\n\n***New Season booking has opened and I've got some extra tickets for sale!!***\nEureka Day stars Helen Hunt\n**Who Killed my Father Directed by Ivo van Hove**\nRose stars Dame Maureen Lipman\n**John Gabriel Borkman stars Simon Russell Beale (The Lehman Trilogy)**\nBlues for Alabama stars Samira Wiley\n**The Band's Visit- musical theatre Winner of 10 Tony Awards**\nJerusalem\nHandbagged\nThe Upstart Crow by Ben Elton\n**Matthew Bourne’s Sleeping Beauty - Ballet**\nThe Wife of Willesden\nImmersive Theatre Guys and Dolls\n**\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**\n**Some of the past shows:**\n**The Ferryman**\n**42nd Street**\n**Matthew Bourne’s Red Shoes**\n**The Truth**\n**Travesties**\n**Funny Girl**\n**When Father came home from the war part 1,2 and 3**\n**THE INTELLIGENT HOMOSEXUAL'S GUIDE TO CAPITALISM AND SOCIALISM WITH A KEY TO THE SCRIPTURES starring Tamsin Greig**\nMan and Superman/ Richard III and Master Builder with Ralph Finnes\nThe Father\nPeople Places and Things\nD H Lawrence's Husbands and Sons starring Anne-Marie Duff\nKinky Boots\nDeath of a Salesman\nLes Liaisons Dangereuses' with Dominic West\nHamlet\nFunny Girl\nLooking for Godot\nView from the Bridge\nThe Play that Goes Wrong\nAntigone with Juliette Binoche\nThe Ruling Class with James McAvoy\nHangmen\nThe Rocky Horror Picture Show *feat. Richard O'Brien*\nAnd a lot of Shakespeare!\n**New events are added on a regular basis - so come along join us and lets see a show together!**","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"33904113","name":"Berkhamsted & Tring Social","link":"https://www.meetup.com/berkhamsted-tring-social","description":"<p>Berkhamsted and Tring Social welcomes all friends and residents, new and established, to our social group. The aim of our group is to provide our members with opportunities to meet new people in the area with similar interests and to make new friends who want to get out and about in the local area. We will be offering a range of events and have a strong commitment to supporting our local community and local events. We will be aiming to offer a range of events, such as film nights, theatre trips, concerts, book club, the wine club, quizzes, pub nights, meals out etc. We will also be hoping to offer outdoor events such as walks and hikes and other physical activities in the beautiful Chilterns area around us. <br>Initially, due to lockdown, we will resume some of our regular events such as the book club (via Zoom) and walks (with limited numbers). <br>You will recognise our event hosts as the same people who made great efforts to provide members with a variety of events over several years in the former Berkhamsted Social group which has now come to an end. We will be looking for new, committed hosts with fresh ideas, too, to help our local group grow and develop, offering a range of regular and new events to suit the different interests and tastes of our members. Some events will have a small cost so that the organisers can cover the subscription fees, but many events will remain free of charge. We ask that all members keep their RSVP’s up to date and respect the efforts made by all hosts in offering local and varied events for our enjoyment. <br>Look forward to you joining us at an event soon! </p>","city":"Berkhamsted","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"32137170","name":"The Constant Readers Book Club: All Things Stephen King","link":"https://www.meetup.com/the-constant-readers-book-club","description":"In the words of the author himself \"Good books don't give up all their secrets at once\", so join us to enjoy and discuss the works of the King! \\\n\n\nStephen King has written over 70 books, so we won't run out material any time soon. We will meet once a month, possibly every 2 months if we are tackling one of the really big tomes (I'm looking at you The Stand). Books will be set in advance and we will have an online meeting and an in person meeting for most books.\nWe can also delve into movie and TV adaptations, have movie nights with Netflix Party plus social events and quizzes.\nI'm always open to ideas, so feel free to DM me with any suggestions!\nI also co-organise the Horror Book Club, so if you are a fan of the genre in general, please do join us as well\n[https://www.meetup.com/The-Horror-Book-Club/](https://www.meetup.com/The-Horror-Book-Club/)\nAnd always remember - monsters are real!\n\\","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18985592","name":"Ladies Who Brunch ...and pretty much do everything else too","link":"https://www.meetup.com/ladies-that-brunch-and-pretty-much-do-everything-else-too","description":"<p>This group is ideal for women who are time-poor and want to be able to drop in to social meetups with like-minded individuals at similar stages in their lives.&nbsp;</p><p><br /></p><p>Many women I know struggle with the same problem as they hit their mid-twenties/ thirties with most of their social network spread out all over the country.&nbsp;Many of us have moved from our hometowns, friends are scattered all over the place and long working hours make it pretty difficult to commit to hobbies.&nbsp;This Surrey-based member's group is designed to be low maintenance but there when you want it, as and when you are free.</p><p><br /></p><p>The group is always open to suggestions for things to do, but will start on the basis of all things from fitness (runs, yoga, walks, gym sessions, dance classes) to coffee catch-ups, new lunch venues, as well as golf, film, fashion and career conversations/ networking.&nbsp;We welcome anyone to host a meetup, so if you'd like to see more events near you or fancy a particular activity, why not have a go? Similarly, If you have any hobbies or passions we could incorporate that you would like to share or teach - we would be thrilled. Just let me, Charlie, know.</p><p><br /></p><p>Ultimately, this group is a great way to take a moment out of our busy lives, put the world to rights, share hobbies and skills, network, and enjoy those odd free evenings and weekends in the company of some amazing women.</p><p><br /></p><p>****************************************************&nbsp;</p><p><br /></p><p>Kindly Note:&nbsp;</p><p>- Please ensure first names and photos are included on your profiles for membership consideration&nbsp;</p><p>- We hope that this group will be full of fun, enthusiastic members, please contribute and RSVP where reasonable. It can be daunting attending an event for the first time - but please don't be nervous. The meetups are low-key and filled with genuinely amazing, friendly women.</p><p>- We welcome women of any age to join.</p><p>- Most of the meetups will be free, but to accommodate any charged events or visiting speakers/experts, some of the meetups may involve a small fee or deposit. Charged events include things such as theatre visits, cinema, lectures, exercise classes etc.&nbsp;Any fees will of course be communicated well in advance.</p><p>- To cover the cost of having the meetup group (currently £120/year), the meetup owner, Charlie, may negotiate with paid activity organisers for compensation, such as covering their ticket cost - this won't affect members and any fees will be communicated well in advance.</p><p>- If you would like to share a paid event with the group, where funds will go to yourself or someone you know, please ask the group owner, Charlie, in advance.</p><p><br /></p><p>Any questions, please don't hesitate to get in touch.&nbsp;</p><p>Looking forward to meeting you.&nbsp;</p><p>Thanks and enjoy!</p>","city":"Twickenham","state":"17","country":"gb","isPrivate":false,"isNewGroup":false}]