[{"id":"29633333","name":"GIN (Gay Indian Network) The LGBTQIA Indian Network in UK","link":"https://www.meetup.com/gin-gay-indian-network-london","description":"Connecting (and supporting) the LGBTQIA community of Indian Heritage and the wider Diaspora with each other and their friends and allies in London and the United Kingdom.\n\nGIN is a fun and sociable networking group for LGBTQIA community of Indian origin and their friends and allies that would like to get to know each other in a friendly group.\n\nWe have around 5 meetups per month (both physical and online). We also have a monthly “deeper connection” Saathi conversation group.\nWe organise trips to museums, places of interest, Indian restaurants, LGBTQIA social support events, Bollywood and Bhangra playing LGBTQIA clubs, And we also have the occasional fun party or two 😃\n\nThis group is open to all LGBTQIA people of any nationality or race that are interested in getting to know more about India and people of Indian origin.\n\nTo help our members stay connected, we also have:\n\n1\\. GIN & Lime Womens' group\\.\n\n2\\. GIN Book Club & GIN Film & Arts Club\\.\n\n3\\. GIN 1 to 1 Buddy Telefriending Service\\.\n\n4\\. GIN Midlands for members in Birmingham\\, Coventry\\, Leicester\\, Nottingham\\.\n\n5\\. GIN & Bombay Tonic Whatsapp Group with over 140 members\\.\n\nWebsite:\n\nhttps://www.gayindiannetworklondon.com\n\nTwitter: @GINindianUK\n\nInstagram: @ginindian\n\nLIABILITY WAIVER: GIN LGBTQIA Indian Network Meetup Group (\"GIN\")\n\nBy joining the GIN Meetup group and signing up for or attending any event, you acknowledge and accept the following Liability Waiver:\n\nI do hereby absolve, release and waive any and all civil or criminal liability litigation claims or demands against GIN (including its Organizer, Assistant Organizers, and event hosts), which may arise out of or be related to any injury, illness, damage or monetary loss to me, my guest(s), or any member(s) of my friends and family by reason of involvement in any group or group-related activities.\n\nBy joining GIN, I accept this waiver, and hereby acknowledge that I am solely responsible for my own safety during any event or group-related activity and that, if intoxicated, I will not operate a motorized vehicle after leaving any GIN meetup event.\n\nOur website is: \\\n\n[https://gayindiannetworklondon.com](https://gayindiannetworklondon.com)\nAnd you can follow GIN on Twitter: \\\n\n[https://twitter.com/GINindianUK/status/1329945689804206081?s=08](https://twitter.com/GINindianUK/status/1329945689804206081?s=08)\nAlso on Facebook: [https://m.facebook.com/GayIndianNetwork.UK/?ref=py_c](https://m.facebook.com/GayIndianNetwork.UK/?ref=py_c)","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"1754359","name":"Outdooraholics London Hiking, walking, Travel - 25 to 49ish","link":"https://www.meetup.com/outdooraholics","description":"London's largest and most active international outdoors group for hiking, walking, travel, day trips, holidays, and outdoor adventures for 25 to 49 (or young at heart) Adventure Travellers\n\nClick here to join us:\nhttp://www.meetup.com/Outdooraholics/join\n\nClick here to join our Facebook community of over 9000 hikers:\nhttps://www.facebook.com/groups/Outdooraholics\n\nClick here to see Outdooraholics hikes featured on the BBC:\nhttp://www.bbc.co.uk/programmes/p03z6qm4\n\nWe are London's largest and most active hiking group with hikes across the UK, Europe and the world. Come and join the adventure and find out why hiking has taken off!\n\n**See all of our events listed by type:**\n\nDAY HIKES:\nhttps://outdooraholics.co.uk/hikesbygrade.pdf\n\nUK WEEKEND TRIPS:\nhttps://outdooraholics.co.uk/weekendtriplist.pdf\n\nFOREIGN TRIPS & HOLIDAYS:\nhttps://outdooraholics.co.uk/foreigntriplist.pdf\n\n**Who we are**\nA group of people dedicated and committed to making the great outdoors more accessible to everyone. With over **44,000 members**, we have now **organised over 1,700 hiking trips** including day walks, weekend hiking trips and an increasing range of foreign hiking trips travelling to Europe and beyond for adventure travel holidays. We target ourselves at the 25 to 49 age group (or young at heart) and whilst most members are within this age group, we do welcome anyone over the age, as well as keeping fit hiking is a great way to make new like minded friends.\nBetween our 3 most senior hike leaders we have over 50 years of experience of leading hikes across the UK as well as an ever increasing range of international trips and tours. We have every corner of the UK covered from Snowdonia in Wales to the Lake District, the great Scottish Highlands and even the far off corners like Cornwall.\nPlease do take a look at our (over 400) independent group reviews:\n[http://www.meetup.com/Outdooraholics/about/comments/?op=all](http://www.meetup.com/Outdooraholics/about/comments/?op=all)\n\nWe have 47 different day and weekend trips that have all been pre hiked and meticulously planned. We organise all the logistics for our hiking trips so that you can just turn up, walk and have a great time and meet new people while enjoying the great outdoors.\n\nIf you enjoy hiking and are based in the UK and looking to meet new like minded friends, Outdooraholics is for you and we look forward to welcoming you to the group!\n\n**Who attends our events?**\nWe're mainly in our mid 20s to mid 40s, but age is no barrier as long as you are young at heart and over 18.\n\nMost of our members generally either live or work in London, although we have people from all over the UK attending and we've had several people visit from abroad for our trips and join us at our destination. After all you don't need to live in London to visit Cornwall, Wales or the Lake District!\n\nWe have a lot of international members - either here on work placements or to live and this brings a superb cultural variety and mix of life experiences to the group and helps to make our trips so interesting and diverse.\n\nWe get a lot of people who attend their first event on their own and we always go out of our way to make everyone very welcome on our trips. They have proven to be a great way to meet people and make new friends as well as to see this wonderful island\n\n**Can I really turn up alone?**\nYes of course - most people do! Please don't be nervous about attending your first event - we have all been in the same boat at some point of turning up at an event alone and knowing nobody. To help introduce people to the group and indeed hiking we have designed 27 different hiking day trips which are a superb way to come and meet the group and we can assure you of a very warm welcome whatever event you choose and there are bound to be others who are attending their first event too. Hiking is a great way of meeting like minded people and making new friendships whilst keeping fit and seeing wonderful places too.\nIf you are nervous about committing to a weekend trip, please don't be, almost everyone has turned up to an event before without knowing anyone and we all know what it's like. To help new members into the group we run 4 to 6 day trips a month which are an easy and low cost way to try our events.\n\n**What hiking trips do we organise?**\n**Day hikes**\nWe organise typically 6 to 8 day hiking trips a month and have 27 tried and tested routes that we use from London. All are pre walked and are picturesque routes that we carefully choose. All trips leave from a central London station and we arrange train tickets, so you can just turn up and enjoy a great day out with us.\n\n**Weekend hiking trips**\nWe organise 3 to 6 weekend trips a month to all corners of the UK, showing you the very best that this country has to offer. We typically rent an entire Youth Hostel just for our group and after a great days hiking then either go to a local restaurant or cook at the hostel. We have over 18 different weekend trips and are adding new ones all the time!\nWe have a professionally trained chef who joins many of our trips and we regularly visit all of the UK's National Parks and designated \"Areas of Outstanding Natural Beauty\"\n\n**Trips abroad**\nWe offer an ever increasing variety of trips from 3 nights up to a week and will be having a number of new trips added in 2022. Where possible we aim for twin bed rooms and put the meticulous planning into our foreign trips so that you can have a great time and get to see the best of the area that you're visiting. It is a legal requirement (as well as advisable for safety) in many foreign mountainous locations to have an internationally qualified guide and for many of our foreign trips we have a local or native speaking guide.\n\nWhat else do we organise?\n\n**Socials**\nAs well as walking trips, we organise several pub socials per year in central London locations as well as discount nights at outdoor stores in central London.\nWe do focus on the outdoor events more than socials but we can recommend a good social group who do the following events:\nPub crawls, social events, wine tastings, sightseeing, making new friends, dining adventure, new in town drinks, food and cooking related events, exploring London's night life, social drinks, 18s, Go Ape, Treasure Hunts, Go Karting and Paintball\n\n**Outdoor activities**\nWe've been offering multi activity weekends for several years and have both offered or will be bringing the following activities to our weekends - some in London and some that we have to travel to:\nSky diving, coasteering, camping, canoeing and hiking weekends, horse riding, paragliding, parachute jumping, pot holing, yoga breaks, fitness weekends, SCUBA, travel, sightseeing, travelling abroad, indoor and outdoor rock climbing, skydiving, cycling, trekking, backpacking, yoga breaks and tours, holiday getaway breaks, travelling, adventure weekends, sailing, coast walking, long distance walking, caving, fitness weekends, hiking abroad, rock climbing, Go Ape, zip wires, navigation training, historic sightseeing, countryside conservation, overseas trips, the 3 (three) peaks challenge, tennis, hiking and abseiling, go karting, exercise and activity weekends for hikers, treasure hunts, paintball, photograpy exhibitions, treasure and scavenger hunts around London, Paint-ball, charity trips and charity adventure nights with Hope for Homes, badminton, squash, recreation weekends, gorge walking, navigation courses, culture trips, community trips, sea kayaking, kayaking along the Thames, via ferrata walks, orienteering, sailing, exercise boot camps, target shooting and clay pigeon shooting, shopping discount evenings at Cotswold Outdoors. Not forgetting of course photography sessions!\n\n**Activity weekends**\nStarting with our first multi activity weekend to the Brecon Beacons nearly 3 years ago, we offer a variety of these weekends where you can try activities such as abseiling, cycling, caving, canoeing, scrambling, kayaking or surfing as well as hiking of course. We're affiliated with two London cheese and wine groups and have even hosted cheese and wine evenings on our weekends!\n\n**Where do we visit?**\nThe fun places we visit and travel to on our walking trips in the UK include:\nSouth Downs, North Downs, Devon, Cornwall, The Lake District, Wales - Snowdon, the Gower and the Brecon Beacons, Dartmoor, the Peak District, Yorkshire Dales and Moors, the Chilterns, Isle of Wight, Kent Downs, Surrey Hills, the Cotswolds, Dorset, the Lake District, The Yorkshire 3 Peaks Challenge, the National 3 Peaks Challenge, the Yorkshire dales and moors and on up to Scotland and Ben Nevis.\nWe also arrange some super foreign walking trips to hike to destinations such as:\nHigh Atlas mountains, Everest Base Camp, the Pyrenees, the Dolomites, Granada Mountains, Nepal, Goa, Kilimanjaro, Andalucia and as the group grows we will continue to offer many more too!\n\n**What trips are we planning for the future?**\nWe are forever expanding our trips and have some wonderful destinations that we will be hiking to in the future.\nWithin the UK we already visit most of its great national parks, but will be extending our trips to cover all of them:\nBrecon Beacons, Norfolk Broads, Cairngorms, Dartmoor, Exmoor, Lake District, Loch Lomond, New Forest, Northumberland, North York Moors, Dark Peaks, Peak District, Pembrokeshire Coast, Snowdonia, South Downs and the Yorkshire Dales.\nWe also visit designated Areas of Outstanding Natural Beauty which have included and will include:\nArnside and Silverdale, Chichester Harbour, Chilterns, Cornwall, Cotswolds, Cranborne Chase & West Wiltshire Downs, Dedham Vale, Dorset, East Devon, Isle of Wight, Kent Downs, Lincolnshire Wolds Malvern Hills, Mendip Hills, Nidderdale, Norfolk Broads and Coast, North Devon, North Pennines, Northumberland Coast, North Wessex Downs, Quantock Hills, Shropshire Hills, Solway Coast, South Devon, Suffolk Coast and Heathlands, Surrey Hills, Tamar Valley Lake District and the breath taking Wye Valley.\n\nWe have also hiked many of the national long distance paths including:\nCotswold Way National Trail, Cumbria Coastal Way, Highland Way, East Riding Heritage Way, Grand Union Canal Walk, Hadrian's Wall Path National Trail, Herriot Way, Hertfordshire Way, Mendip Ring, North Downs Way National Trail, North-West Coastal Trail, Offa's Dyke Path National Trail, Peak District High Level Route, Norfolk Coast Path National Trail, Pembrokeshire Coast Path National Trail, Pennine Way National Trail, Snowdonia Round, Solent Way, South Downs Way National Trail, South West Coast Path National Trail, Southern Upland Way, Thames Path National Trail, Wainwrights Way, Wales Coast Path, Wessex Ridgeway Trail, West Highland Way, Westmorland Way, White Peak Way, Wilts and Berks Canal Towpath, Winchcombe Way, Offa's Dyke (near the River Wye and Forest of Dean) and Wye Valley Walk\nWe also run and are planning a number of trips abroad including: Kilimanjaro, Nepal, hiking to Everest base camp, Tenerife, Croatia, Slovakia, France, Poland, The High Tatras, Russia, The Alps, Gran Canaria (Canary Islands), the Dolomites, Morocco and the High Atlas Mountains, Norway, Italy, Iceland, The Fjords, the Pyrenees, Andalucia, The Pyrenees and the Amalfi Coast.\n\n**Why do we do it?**\nQuite simply - we all share a passion for the great outdoors and with all of our trip leaders being born and raised in the UK with a life long love of hiking, we can't wait to show you this great country!\nWe have so many wonderful experiences on our trips and many people have found a new love of the outdoors, met their partners through Outdooraholics and made what are likely to be lifelong friendships.\nOur organisers can't wait to show you this great country and why we all developed such a lifelong love of hiking here all those decades ago\n\n**Yoga health and wellness retreats**\nWe offer a range of superb value yoga retreats in the UK, which we call Yogaholics trips. We take your safety and the great reputation of our yoga/hiking trips very seriously and we only ever use professional full time yoga instructors. We also typically have a professional chef to ensure we have wonderful, healthy and revitalising food. We follow the same great formula as with our hiking weekends - great organisation, great home cooked food, pre planned and hiked routes and highly experienced hike leaders and using hostels allows us to do this at a great price too. We look forward to bringing you an even more expanded range of Yogaholics trips as we enter our 4th year of these Yogaholics trips in 2015!\nWe have created a great range of hostel based yoga trips on this wonderful concept, but if you would like more luxury hiking/yoga trips also run by a professional yoga instructor, we can highly recommend the excellent Yoga Trails\n\n**Why Outdooraholics?**\nA very good question. There are some superb London based walking groups on Meetup - Backabush are well known for over a decade of organising superb hiking weekends and brought the whole concept of great value hiking trips to Meetup and Trailblazer have been organising an excellent and huge range of days hikes for over 5 years now. Both groups we highly recommend and regularly hear great things about their trips and both have inspired many other groups to offer similar events to theirs. 1000 Foot Hiking club is also highly recommended - run by some inspirational people on a non profit basis with all money raised going to a water aid charity.\nExcept for Outdooraholics most of the major London hiking groups on Meetup have evolved out of Backabush and Trailblazer and generally run the same format as their trips. Whilst we'd be lying if we said we weren't inspired by the great trips these groups run, we wanted to do something different and new and created Outdooraholics from scratch and we believe giving our trips a quite different flavour. We get you out of London on aaa rated trips. We took a very simple idea as our basis - of organising all of the logistics for our hiking trips so that you don't have to. We advise you what to bring, you turn up and you'll have a great time. All of our trips are run by trip leaders from that particular country so we believe they can show you the country and culture like only a local can. We organise an equal mix of day hikes and weekend trips and put the same detailed planning into both.\nWe also try to use local tour guides for the majority of our trips so that you can get a proper insight in to the history, culture and country that you're visiting - after all you wouldn't expect to visit Russia for example and be \"shown\" the country and it's cultures by a British person!\nWe plan all of our trips in advance including the routes that we take to ensure that we show you the best of an area and also that we know what the risks are on the tracks and indeed that the trails are passable and safe. All of the photos on our trips are taken by one of our hike leaders, from that trip, on the paths that you will actually be hiking so that you can best decide which trips appeal to you. The great outdoors does carry risks which is why we pre walk and plan all of our routes and trips.\nWe believe we offer the most diverse range of both day hikes and weekend trips available in the UK.\nWe only offer superb trips and we even have a professional chef who joins us on many of our weekend trips to offer great food, which is much appreciated after a tough days hiking.\n\n**Safety**\nOur main hike leader has undertaken both a four day [Walk Group Leader](http://www.mountain-training.org/award-schemes/walking-group-leader-award) course accredited by the MLT (Mountain Leader Training) and a six day [Mountain Leader](http://www.mountain-training.org/award-schemes/mountain-leader-award) course (also accredited by the MLT) as well as having a two day outdoor Activity First Aid course and over 20 years of extensive and diverse hiking and leading experience. All of our trips are run by very experienced hikers with Outdoor Activity First Aid qualifications and most of our trip leaders are a minimum of Mountain Leader trained with 2 of our trip leaders having a military background. Sadly the outdoors always presents risks but through our experience, training and careful planning as well as pre planning and walking all of our routes we do our best to minimise those.\n\n**Further information**\nYou can email us at: info@outdooraholics.co.uk\nOr you can follow us and our hiking adventures on Facebook:\n[http://www.facebook.com/outdooraholics](http://www.facebook.com/outdooraholics)\nWe sincerely look forward to meeting you at one of our weekend or hiking day trip adventures soon and can ensure a warm welcome from the Outdooraholics team to you\n\n**Joining the Team**\nWe are looking for experienced hike leaders (ideally with at least Mountain Leader level training) and whilst we demand a lot from people, working with the largest hiking group in London and one of the largest in Europe brings a lot of advantages too. Safety and enjoyment of people attending our trips is paramount. You don't have to be based in the South East or London as we have a demand for people in all locations. If you share these values, please email us for more details along with a summary of your experience: info@outdooraholics.co.uk","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false}]