[{"id":"25631232","name":"Practice Jazz Jams | London","link":"https://www.meetup.com/practice-jazz-jam-sessions","description":"*If you're getting started with jazz, looking to build up a repertoire of standards and learning to improvise with other musicians in a relaxed environment - try out the 'novice setlist' sessions*\n\n*If you're already comfortable with the above, but are looking to improve the more nuanced aspects of your playing and over more challenging standards - then check out the 'intermediate' sessions*\n\nThis group is open to all levels of musicians who would like to learn and explore jazz standards & improvisation with others in a friendly & supportive environment\n\nIf you're new to the group and had some questions on how it all works just drop me (Xie) a message!\n\nA contribution is charged to cover payment of the room hire, meetup's monthly organiser fee, and my time in organising the sessions.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36372722","name":"Greater London All Pubs","link":"https://www.meetup.com/greater-london-all-pubs","description":"This is a meeting for people looking for friends or to enhance their social network. The meetup is open to professionals living and residing in London, so there are questions to fill in before applying. We will meet inside all the pubs of greater London. Pubs with too strong music or too thematic or little will not be selected, but we will endeavour to get inside all of the pubs. We will endeavour to visit all the pubs of London, so we will meet within the same pub only if the pub is very little and there will be a limited number of spots. In this case the people that have already been at that pub will not be allowed to join again to give to other people the opportunity to see that pub. Every week we will meet inside a certain pub and we will explore a different area only when we have called at all the pubs of the previous one. For example if we start with the pubs in Shepherds Bush we will get to all the pubs within the shepherds Bush area. There will be a charge only for selected meetings.\nPlease note : you don't have to purchase alcohol if you don't want to, the important thing is that you purchase something that appeals to you. At the end of the year or so you can say that you have visited all the pubs of London at least the ones within zone 1 and 2. Please note : we will only go inside public houses. Discos and bars are not included.\nThis Meetup group is not open to un respectful people, and is open to diversity, the attitude of members will be monitored by the organisers that pay the fees. Members will be monitored. Membership of other members requires approval.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36273542","name":"LOVE: Events & Services","link":"https://www.meetup.com/love-events-services","description":"I am Patience: meditation guide, energy healer, plant medicine practitioner, musician, artist, multi-dimensional being. Welcome to my Meetup page where you can find all my events. I run daily evening guided meditation trips on all different aspects of spiritual healing, and regular group sessions and ceremonies in London, Hertfordshire and Sussex.\n\nIf you want a 1-1 session, to look at this year's courses and spiritual retreats, and to discover all my services and offerings, please check out my website: https://love19962021.wixsite.com/love\n\nI look forward to journeying with you soon! 👁🙏❣️\n\n-Patience (Love)\n\nInstagram: @andlifeisparadise\nTwitter: @livingaslove","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36316952","name":"London Skate Group","link":"https://www.meetup.com/london-skate-group","description":"Welcome, all rollerskaters and rollerbladers ❤️\n\nThis is a group for people who want to meet other skaters regularly in London parks. It doesn't matter if you're a new skater or a seasoned veteran - this is for ALL of us to meet, have fun and skate our mighty hearts out.\n\nWe can teach each other new tricks, skills and techniques and of course, build new wonderful friendships too.\nOn days when the sun is out, we can picnic + skate, music + skate, laugh + skate - as long as there is skating involved we're good.\n\nI started this group because I want to get back into rollerskating after a 20year hiatus 😅and I just couldn't find a community where I felt relaxed enough to release my anxieties.\n\nAlso, I want this to ideally be a free group so that everyone can join without financial restraints.\n\nTo join the group you must have your own skates, protective helmet and wrist guards (at least).\n\nI look forward to skating with you soon.","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"4721202","name":"Up In The Cheap Seats - Enjoying London Theatre","link":"https://www.meetup.com/up-in-the-cheap-seats","description":"Welcome to **up-in-the-cheap-seats**. This group aims to bring together people who share a common aim - to *see theatre at reasonable prices*.\nAll are welcome at our events - We've met so many lovely people and everyone has been so friendly and enthusiastic. Group sizes vary so we can meet up before and get a chance to talk to each other. We have a great group of organisers with varied tastes and interests; which keeps our calendar filled with mainstream and more eclectic events.\nWith over **2,200 events** in the 10 years we've been going, the variety of shows we've seen is immense. We see a mixture of musicals, plays, opera, ballet, music, comedians and films and are always open to new suggestions! A calender of our events can be found here: [https://www.meetup.com/Up-in-the-cheap-seats/events/calendar](https://www.meetup.com/Up-in-the-cheap-seats/events/calendar)\n**There is a one-off joining fee of £2.50** to be a member of **up-in-the-cheap-seats**. These funds will be used to cover the meetup fees and cover expenses associated with running the group. \n\nPlease note, if you are an inactive member for many months (i.e. if you don't log into the website or don't attend any events), you will be removed from the group as we encourage this group to be as active as possible.\nSo......how does it work? \n\n**We buy our own tickets.** Your event organiser will add a link on the event invitation so you can buy your ticket at the same price that they enjoyed. Obviously the price is not guaranteed especially if the show is popular or you wait a few days before booking.\n\n**Please update your RSVP to confirm that you are joining us.** The organiser will normally add a comment to the event page saying which seat they have purchased. This isn’t mandatory but helps others decide on their seat selection – it is always nice to be sat near or next to another member of the group! The group does not charge to attend individual events (just the one-off £2.50 joining fee). Therefore Meetup states that the event is free. This does not mean that your ticket is free - you will need to purchase this yourself.\n\nThe event host will post the meet up details a day or two before the show.\n\nWe usually meet outside the theatre or in one of the theatre's bars around 30 minutes before the show.\n\nIf there is an interval we will meet up again in the bar at the interval so we can all share our opinion of what we have enjoyed (or not!) so far.\n\nWe will also usually meet up afterwards for a brief chat about the show but sometimes (depending on how late it is and the day of the week), we may go on somewhere for a drink and a longer chat.\n\n**If you are unable to make an event, please change your RSVP** so that your host knows not to wait for you.  \n\nHope to see you at an event soon,\n**Your UITCS Oraganisers**\n\\*Please note, this group does generate a lot of email, but the good news is these settings are customisable, and can easily be changed by going to 'My Profile', then 'Emails' and 'Notifications'.","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"1600796","name":"Social Buddies (Middx Area)","link":"https://www.meetup.com/socialbuddies","description":"> **Are you looking to improve your social life and make some new friends?**\n\n**Then come along to Social Buddies!**\nSocial Buddies is a lively, fun, social club for the 35+ age group with many events each month, mainly in the Middx area.\nOur events include quizzes, pub nights, meals, live music/tribute bands, comedy nights, theatre, cinema, coffee mornings, craft events, days out and walks to name a few.\nAs well as attending events we especially welcome new members who are keen to host events themselves. The more people that do this the more events we can offer!\nThere is a joining fee of £10 which helps to cover admin and website costs. This fee is payable no later than 8 weeks after joining.\n\nPlease use your real name when joining and have a recent photo of yourself (clearly showing your face) as your profile picture. This helps members put a face to a name at events and know who to look out for.  Failure to do this will result in your membership being rejected.\nIf you require further information please email socialbuddies@gmail.com.\nWe look forward to meeting you at an event soon.\n**Don't sit at home on your own - come out and have some fun with Social Buddies!**","city":"Ruislip","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36451284","name":"Queer Neurodivergents and Alternatives","link":"https://www.meetup.com/queer-neurodivergents-and-alternatives","description":"This is a social group for queer people who are also neurodivergent and/or alternative (as both neurodivergent and alternative people are often in the minority in the queer community). We are not an official support group but people are welcome to talk about what's happening in their lives, both good and bad. Our events are intended as a space where queer people can socialise and/or form connections with other like-minded queer people without worrying about being judged for being \"different\".\n\nQueer covers people who identify as:\n\n* Gay/Lesbian\n* Bisexual/Pansexual\n* Transgender/Non-binary/Agender/Genderqueer\n* Intersex\n* Asexual/Aromantic\n* Any other minority of gender/sexual orientation covered by the \"queer\" umbrella term\n\nNeurodivergent covers anyone who feels their brain is wired differently (no diagnosis required). A non-exhaustive list would include:\n\n* ASD/Asperger's\n* ADD/ADHD\n* Dyspraxia\n* Learning difficulties\n* OCD\n* Borderline Personality Disorder\n* Bipolar Disorder\n* Schizophrenia\n* General Anxiety Disorder\n* Anyone who feels that they don't \"fit in\" at conventional queer groups, finds them overwhelming\n* Anyone who finds small talk exhausting\n\nAlternative covers people who identify as:\n\n* Goth\n* Metalhead\n* Punk\n* Anyone who feels that their aesthetic and/or music tastes don't \"fit in\" at conventional queer groups\n\nWe are hoping that strict rules will not be required, but in general, try to be kind and compassionate towards others, and if someone tells you that your behaviour or words are making them uncomfortable, please stop.\n\nWe will aim to seek out quieter venues whenever possible as a lot of neurodivergent people are uncomfortable with noise. We will also endeavour to book venues which are accessible for people with mobility issues, and will make it clear in the event description whether the venue is accessible.\n\nAs we are starting out, we may need to try out several different venues to find one that works well. If you have suggestions for venues, especially queer ones, that are quiet and accessible, please do let us know.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":true},{"id":"1403494","name":"Chillout London","link":"https://www.meetup.com/chilloutlondon","description":"Bringing like-minded people with the same passions together in a fun social setting for FREE. Whether it's a particular genre of music/club night/dancing,  theatre/acting, food, singing/rockaoake, sports/fitness, comedy, art, pub crawls, cutting edge science, spirituality actvities - we host free fun themed events to ensure only like minded people with the same passions get to meet and particpate as life is too short to spend time with people who do not excite and or engage you.\n\nOur membership is biased towards successful but unpretentious career professionals with highly engaging personalities who are are socially skilled, outgoing, intellectually curious and creative with outstanding sense of humour! We value quality over mediocrity so attempt to constrict attendees to people with an authentic love of the event theme to both foster good engagement dynamics & keep attendees to a manageable size.\n\nOur London events are hosted by a born Londoner who know the city and hidden gems inside out! We also avoid holding events in touristy/sleazy venues so attendees get to enjoy authentic London venues & experiences and meet native brits anf form long lasting connections easily. Typical past events have included stargazing, rockaoke, music themed clubbing events (80s, 90s, 70s, 50s, Hip Hop & Reggae nights), sports events (badminton, rounders, tennis), Halloween pub crawls/tours, exhibitions, dinners/food tasting/supper club, lunches/brunch, coffee, firework displays, talks/seminars, concerts - you name it - we've done it!\n\nWaiting lists wise - when places become available, preference will be given to people with complete profiles who can demonstrate a genuine passion for the event theme, to the most loyal members and those with a close proximity to event location so it is parmount you fill out your profile!!\n\nAnd here at Chillout, our philosophy is you shouldn't have to pay a premium to enjoy the things that you love so in accordance with the fundamental founding tenet of Meetup - the vast majority of our events are free - no profit motive here! However in rare cases, where direct or venue hiring costs are incurred for putting on a specific event, there maybe a small charge.\n\nSo, whether you’re originally from London or brand new to the city, here's to enjoying some memoriable crazy times out with a select audience and even forming strong new authentic long lasting connections along the way.\n\nLucas - Founder & Organiser (and essay writer!)\n***Please note, if you are identified to having different motives for attending events other than for socialising around a shared theme that you are truly passionate about or found to be harassing members or seeking sexual conquests you will be removed. For security screening and protecting our members - everyone must have a full face pic prior to attending an event so they can be indentified in the case of any issues. If any ladies recieve unsolicited contact from random people they have never met please feel free to report to me (so I can remove) and contact meetup site directly.*** \n\nFeel free to follow us on Twitter to Keep updated with new events here:\nhttps://twitter.com/Chillout_London\nhttps://twitter.com/LucasBulsara\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\nAnd now for some blatant testimonial marketing (generous bank transfers on way):\n\n\"His energy, event passion, beauty and brief conversation shifted my mindset tremendously in less than a few minutes which is very rare when attending meetups\" Clare\n\n\"I went to Chillout London when I was new to the city from the USA and I always had a really great time. Everyone was super friendly. Lucas always has cool captivating themes and I always felt deeply engaged, never bored. I would definitely recommend!\" Staci Schidmt\n\n\"The organiser is late often and as a former teacher I have no idea how he made it through school or university without being expelled but his events are so novel & addictive I just can't stay away\" Reena Teacher\n\n\"Meeting Lucas and attending his event was a lovely experience. He had so much knowledge and passion. It was really good. Very impressive\" Komal\n\n\"It's about time Lucas grew up, got a girlfriend/got married like the rest of his mates instead of wasting his time on this meetup nonsense. He should be hanging out with his real friends!\" Adam Joslin\n\n\"The organiser is one of the funniest entertaining people I've met. He is really passionate about all his event themes and so there is always an air of excitement and never a dull moment. Now I'm a semi regular - I always leave either learning something new or laughing on the way home\"  Lorraine Norton\n\n\"Organiser jokes around a lot but I love him. When he was DJing at his club event party he refused to play Never Tear Us Apart for me so if you like good music I suggest you avoid Chillout events\" Dominika Abel (Assitant Organiser)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36419841","name":"Bored in West London. Ages 35 to 55, all of 40s","link":"https://www.meetup.com/bored-in-west-london","description":"Enjoying life without breaking the bank.\nKeeping it local but Posh.\nStylish and smart.\nLet's enjoy the summer together.\n\nCome along to any of our meetups all around West London and beyond.\n\nFun and lively Picnics. \nCocktails and drinks. \nMuseums/houses/castles. \nEaling Festivals. \nComedy Nights. \nDickings Yard. \nTheatres. \nHammersmith Apollo. \nMore random Picnics. \nMid morning coffee/cold juice. Westfield or other trendy locations. \nSlow motion dating/getting to know you picnics. \nFriday evening hangouts. \nRunning. \nWalks. \nLive Music. \n\nMembers are encouraged to suggest activities so that we can have a variety of events.\n\nLet's get together for activities in our neighbourhood, feel free to message and suggest anything that looks like fun.\n\nTo serve different members of the group, we will aim to schedule a diverse range and types of meetups. This can be at weekends or evenings, daytime or weekdays. Everyone's life is different and not everyone is 9-5 and free at weekends and evenings, so we will endeavour to schedule events to cater for different folks.\n\nLooking for members to get involved with planning! 4 co-admins needed, message me.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":true},{"id":"7373422","name":"45+ Not grumpy old Londoners!","link":"https://www.meetup.com/45-not-grumpy-old-londoners","description":"<p>This is a group for those of us who accept who we are and like who we are - do things alone however would prefer to share some of our leisure time with like-minded. We are interesting and interested in so much...walking in the countryside, travel, week-end breaks, playing cards, theatre, opera, dining, visiting galleries, exhibitions, playing tennis perhaps, book club, art.......it would be good for members to come up with ideas that we can join in with...we're not necessarily 'grumpy old' but do not like loud music, gum chewing or bootcamps!&nbsp;</p>\n<p>Please note that photographs and/or video recordings may be taken at a 45+ Not Grumpy event. If you do not want your photo/video published online, please notify the group leader of this.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"27645682","name":"London Music Showcase - Gigs & Drinks 🙂🍻","link":"https://www.meetup.com/london-music-showcase-gigs-drinks","description":"https://linktr.ee/londonmusicshowcase\nhttps://youtu.be/pNDpgayHt8Q\nhttps://www.facebook.com/LondonMusicShowcase\nhttps://www.meetup.com/London-Music-Showcase-Gigs-Drinks/\nhttps://www.meetup.com/london-Bands-social-drinks/\n\nThis is for friends who like to see Live Music around London. We pick a location to meet for drinks, watch some live bands and then maybe out to a Bar/Club around Central London. It’s a mix of male and female, English and International friends - everyone’s welcome. French, Portuguese, Italian, Spanish, Japanese and English people so I’m sure you will meet someone that shares a passion for Rocking Music.\n\nIf you are new to the city and are looking for a good night out in London then feel free to join us. Some events are Free Entry and some are paid gigs with a cheap Guest-List. It's a group for friends to meet people and organise nights out together :)\n\n\\-\\-\\-\n\nThe Live Music Industry is unfortunately not what it used to be 20 years ago - Nowadays, an Artist is judged on how many ‘Likes’ and ’Thumbs-Up’ they can get on a Facebook page…\n\nWe live in London the MUSIC CAPITAL OF THE WORLD\n\nIf you don’t believe that there are amazing nights of music playing all-night long, then you haven’t been paying attention.\n\nI am offering any Band or Artist currently performing around London an Instagram ‘Follow’ if they want it. I have lived here all my life and I know great music events happen everyday because I’ve been there, seen it and I am happy to support it. Last year has probably been the hardest for many Musicians - Nearly all the best Live Music Venues have closed down - BIG RED / LOCK TAVERN / THE MONARCH and many others. Most Alternative Music has been pushed to East LONDON and It's pretty hard getting gigs. So, I will be hosting a few MUSICIANS MEETUPS and I welcome anyone playing music or searching for fellow musicians to come down for a drink 🙂🍻\n\nOver the last 5 years of running this Group, I have had a lot of people come and express an interest in meeting other musicians to form bands. It’s difficult meeting the right people so if you are a Singer, Guitarist, Bassist or Drummer, have a band or think there’s anything we might be interested in then this might be a good group for you.\nWe put on our own nights and are always looking for great bands to see around London. If you are looking for Gigs or reliable promoters, then we can probably help point you in the right direction.\n\nAt the very least, we can talk music and then watch some bands :)\n\nDISCLAIMER:\nWe are not responsible for you or your belongings. By attending events you agree to waiver liability for the Host :) Please bring ID to all events 18+ Thank you","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"9839452","name":"Social in St. Albans (20s and 30s)","link":"https://www.meetup.com/social-in-st-albans","description":"Welcome to the Social in St. Albans Meet Up group! If you are new to St Albans, have been here a while or are just looking to expand your circle and meet people your own age, please come along to our group.\nWe are a very friendly and active group, aimed at getting young people together for fun and laughter. Our events include pub trips and nights out, sport events, country walks, music events...etc...we would love to have your suggestions for events!\nIn order to join the group we do ask for you to complete the profile questions and to include a real photo. This helps us to spot you when you come to your first event!\nThere is an **annual fee of £5 per person** to be in this group, but this does not need to be paid until you have come to a couple of events, so you can make sure you like the group first. This payment simply goes towards the admin fee which the website charges us and any additional funds are used towards group events.\nUnfortunately meetup charge us fees depending on the size of the group, so if we do not receive payment, or you have not been active on the site for some time, we will be required to remove you from the group to ensure that it's fair and reasonably priced for all members.","city":"St Albans","state":"F8","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36152115","name":"Encore: Theatre and Events for Friends to Enjoy","link":"https://www.meetup.com/meetup-group-gdjepjbm","description":"Encore: Theatre and Events for Friends to Enjoy is a friendly and sociable not for profit group, primarily based around South Bucks, Gerrards Cross, Chalfonts, Amersham, Chesham and surrounding area. However, if you don’t live in that area you can still request to join if able to travel to and from events.\n\nIf you are 40+ and looking for new friends and things to do why not give us a try?\n\nTheatre has always been a key aspect of our group and we have been to numerous performances over the years since the group started in June 2016. We have had some challenging times during the Covid Pandemic but we are now beginning to look at putting on more events as people begin to venture back out on the social scene.\n\nApart from Theatre our events can be anything from comedy nights, party breaks, quiz nights, outings, music nights, cinema, meals out, walks, guided tours, picnics, informal parties etc.\n\nThe extent and number of events will depend on what people are prepared to offer to the group. The organisers are not able to do everything so we are particularly interested in new members who are willing/able to host/organise events.\n\nWe appreciate not everyone is comfortable with uploading a face photo but this is preferred if possible as it does help with identification when meeting up for events (especially new people). However, if you prefer just add a photo of anything to get through the photo required section.\n\nAlso with new members there is an admin/joining fee required (currently £5 for individual membership or £10 for plus one membership) to go towards MeetUp fees.\n\nEncore: Theatre and Events for Friends to Enjoy is a Closed Group (acceptance for membership is at the discretion of organisers subject to availability). Please do not be offended should it not be possible to accept a request to join. This is more likely if you already belong to 10 or more other MeetUps as we are looking for active members and if you already belong to loads of other groups that's unlikely. If accepted you will need to attend at least one event every year (but hopefully you will want to join us at many more that). Current members can also recommend people to join the group.\n \nWe hope you will enjoy being a part of Encore and if you have an idea for a show or event please let me know and we will investigate, or better still have a go and organise it yourself as it will be possible to add extra organisers to Meetup.","city":"Chalfont St Peter","state":"F8","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36321250","name":"Socialising everybody welcome.","link":"https://www.meetup.com/socialising-everybody-welcome","description":"Hi I thought I'd create a group purely for socialising and making new friends.no shouting over the music in loud bars where people can really shine and make new friends in a conducive environment.\ni aim to bring all races age groups nationalities together no inclusiveness here after all people of all types can be a great friend.\nI will host pub events eating out picnics walks and dating events.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34562524","name":"West Herts AAA Social","link":"https://www.meetup.com/west-herts-aaa-social","description":"<p>Welcome to a new Meetup group, for people who live in Hemel Hempstead, Watford, St Albans, Berkhamsted, Bovingdon, Tring, Rickmansworth and surrounding areas. It’s for people who’d like to take part in social activities on a regular basis, meet new friends and lead an active social life.</p> \n<p>We aim to discover unique and unusual local activities and events, together with regular, more traditional Meetups like pub nights, meals, cinema/theatre, live music, semi-guided walks etc. Our aim is to compliment activities to your own social calendars. </p> \n<p>We welcome new ideas and always encourage members to share with us your thoughts for future events.</p> \n<p>Most events will be free however occasionally we may suggest members make a voluntary (not mandatory) small contribution (for example £1 on a walk) to help cover the cost of having this group on the Meetup site. (Sadly it’s not a free service to the Organisers!)</p> \n<p>In addition, we ask that all members keep in mind the fact that our Event Organisers are hosting their events completely voluntarily, in their own time and we need to make the events as straightforward as possible for them to run. The absolute basic requirement of all members is therefore to ensure that you keep your RSVPs up to date. If you put your name down to attend an event and later cannot make it, you need to be fair to all parties involved and click on ‘Edit your RSVP’ to ‘Not going’ ahead of the event. Try not to leave it to the last minute if possible as there will quite often be people on a waiting list wanting to go, should a place become available.</p> \n<p>The most important thing about this group is to feel safe, relaxed, included and above all, have fun 😇</p> \n<p>Risk Disclaimer:<br>Please note that all members take part in all activities solely at their own risk, should any personal loss, accident, illness or physical injury occur during an event.</p>","city":"Hemel Hempstead","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"315983","name":"The London Cultureseekers Group","link":"https://www.meetup.com/london_cultureseekers","description":"**Welcome to the London Cultureseekers Group!**\nIf you're interested in exploring London's history & culture with other like minded people, then this is the only group you need to join! We are London's largest cultural and history group!\n\nWe meetup 2-3 times a week to explore museums, art galleries, historical buildings, go on guided walks and history talks. We also have historic treasure hunts, visit the theatre, have coffee evenings, social evenings, meals and attend classical music concerts. In the summer we also have day trips outside of the capital by train or coach to explore historical towns and walks in the countryside.\n\nThe group is very friendly, we have members from 20 to 80 years old, across all backgrounds. The group has been running for over 15 years and is a great way to meet and make new friends. Plus after events we generally head to a local pub or cafe to chat.\n\nYou can either pay as you go at events or we do have an optional annual membership fee (details below).\n\n**Membership Fee**\nThe group charges an optional annual membership fee of £13 per person.\n\nBenefits of paying the membership fee and becoming a Full Member are:\n\n* *Discounted entry at 11 museums and galleries around London (You can view them here: [www.meetup.com/london_cu­ltureseekers/sponsors](http://www.meetup.com/london_cu%1fltureseekers/sponsors))*\n* *10% discount on any purchases at Foyles bookshops or from their website*\n* *All treasure hunts we do will be FREE (normally £6 each)*\n* *The 'Wren City Churches', 'Charlie Chaplin', 'Roman Wall', 'Have I Got Mews For You', ‘What’s in a Name’ and 'Shakespeare's London' Guided Walks will all be FREE (normally £6 each)*\n* *All talks the group does will be FREE (normally £6 each)*\n* *All Thames foreshore visits will be FREE (normally £6 each)*\n* *Guided highlights tour around the Museum of London & Museum of London Docklands will be FREE (normally £6 each)*\n* *All ‘London’s Lost Rivers’ hikes will be FREE (normally £6 each)*\n* *All day trips by train out of London will be FREE (normally £6)*\n* *All coach day trips out of London will be discounted by £6 per trip*\n* *All the Blue Badge guided walks we do will be discounted by £2 per walk*\n* *Entry to 20-30 paying museums & historical buildings that we visit across the year will be discounted by £2 each*\n\nOnce you pay the membership fee, you will receive a membership card, go to ([https://www.meetup.com/london_cultureseekers/dues](http://www.meetup.com/london_cultureseekers/dues)) to pay online or you can pay cash at an event.\n\n**Events**\nHave a look at the page below to see what's coming up and where we have been. Cultureseekers is a brilliant place to make friends in London whilst experiencing some of the very best areas of culture and history which the city has to offer. We keep costs low and the quality high.\nOur events always go ahead, regardless of the weather. Feel free to email or text me if you have any questions or would like to suggest somewhere we can visit.\n\nClick on the video clips below to view our day trips to Bath and walking the Seven Sisters:\n[https://youtu.be/WAXipRxXtnc](https://youtu.be/WAXipRxXtnc)\n[https://youtu.be/06scGec8CcY](https://youtu.be/06scGec8CcY)\n\n**RSVP'ing**\nClick on the 'Join Us' button below, enter your details and then RSVP Yes to any events that you would like to attend, it's that simple! All new events get sent out on Friday evenings, so keep a lookout then.\nWhen you turn up for an event, look out for the red & blue 'London Cultureseekers Group' flag and then come over and say hello.\n\nPlease be aware of the groups rules, which you can read here: [https://www.meetup.com/London_Cultureseekers/pages/26449165/Group_Rules/](https://www.meetup.com/London_Cultureseekers/pages/26449165/Group_Rules/)\n\nHope to see you at an event soon!\n\nRobert - 07905 901 834 (text only please) / [general@cultureseekers.org](mailto:general@cultureseekers.org)\n\n**Follow us on:**\nFacebook: [https://www.facebook.com/LondonCultureseekers/](https://www.facebook.com/LondonCultureseekers/)\nTwitter: [@Culture_Seekers](https://twitter.com/culture_seekers)\nYouTube: [Cultureseekers channel](https://www.youtube.com/channel/UCnnip7xQzYaJ5u-Q4RRLj3w)\nThe group blog: [www.cultureseekers.blog](www.cultureseekers.blog)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18094372","name":"Hemel Hempstead Social","link":"https://www.meetup.com/hemel-hempstead-social","description":"Hemel Hempstead Social Meetup welcomes all, to meet new people, socialise, have fun, try new things and make new friends.\nOur social activities could include meeting for coffee or a drink, eating out, pub nights, live music, dancing, theme nights, cinema, theatre, comedy, arts & crafts, day trips, race days, bowling, quiz nights, games, book club, walks, picnics, afternoon tea, escape rooms, footgolf, bike rides, skating, trampolining, snowboarding or any other sports & leisure activities, museums, galleries and much more. We welcome all ideas. Events can be daytime, evening, midweek or weekends. Members are also encouraged to host events. The more event hosts we have the more events there will be for you to attend. Contact one of the organisers if you are interested & want help with this. All members are required to keep their RSVP's up to date.\nJust get involved, give ideas and organise your own events as well. Don't just sit at home on your own, come out, have some fun & start making new friends.\nPam, Karen & Steve","city":"Hemel Hempstead","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"23191778","name":"WYBTD? Will You Be There Darling? Gay Men Who Wanna Have Fun","link":"https://www.meetup.com/wybtd-will-you-be-there-darling","description":"<p>WYBTD (Will You Be There Darling?): Gay Men Who Wanna Have Fun</p><p>A free all-encompassing Meetup group for gay men who like to go out, be entertained and socialise. No more missing out on fun events because you have no-one to go with or are reluctant to go alone.</p><p>Covering all tribes from the pretentious culture vultures to the unapologetic trashy queens and everyone in between. Whether you are single, partnered or polyamorous there is something for everyone! We don't believe in gender stereotypes (such as masc/fem) or slut-shaming or body-shaming. We are all 'good gays' just maybe some are more shy or socially anxious than others.</p><p>All Meetups are organised by a friendly host whose prime responsibility is to ensure all new members are welcomed, introduced to the group and not excluded. We have very quickly built a great reputation for making everyone feel comfortable and welcome.</p><p>We don’t believe in boxes, labels or tribes - we are all QUEER! We welcome all MSM (men who have sex with men) regardless of where you belong on the GBTQ+ spectrum. So you are welcome to join us regardless of your social background, income, colour, ethnicity, disability, HIV status, size, age, shape or even hairiness. None of us are equal until ALL of us are equal.</p><p><br /></p><p>We have been called the “non-judgemental” Meetup group and we are rather proud of that!&nbsp;We love ‘teenagers of all ages’ but we also love queers who want to act either their age or even older, which is why we have events for all ages and personalities. So let’s go out and do more things that make you forget to check your phone!</p><p>We believe in disconnecting (at least temporarily!) from our mobile-enabled, click-bait geo-social networks and reconnecting in a meaningful way through face-to-face socialising instead. After all, we live in our brilliant London culture bubble, where we're used to having access to the crème de la crème of entertainment every night of the week, so let's take advantage of it!</p><p>We organise Meetup events of all kinds such as art galleries, cabaret, cinema, comedy, dance, museums, music concerts, spoken word poetry and theatre - as well as clubbing nights, cruising bars, drag shows and even sex parties!</p><p>A typical weekend's activities might look like this:</p><p>Friday: WYBTD Social in a private members club in Soho</p><p>Saturday: Art gallery in the afternoon. Off-West End play or independent cinema in the evening, followed by Clubbing</p><p>Sunday: Brunch, comedy cabaret afternoon at the Royal Vauxhall Tavern followed by Horse Meat Disco at the Eagle.</p><p>So regardless of whether you prefer Hard On or Kylie (or both at the same time!) join one of the most all inclusive Meetup groups for gay men.</p><p>Here is an article about WYBTD published recently by Gay Star News:&nbsp;<a href=\"https://www.gaystarnews.com/article/will-you-darling-meetup-london/#gs.972e1z\" target=\"_blank\">https://www.gaystarnews.com/article/will-you-darling-meetup-london/#gs.972e1z</a></p><p>Here is a discussion thread for members to write some short comments about their first time experiences with WYBTD: <a href=\"https://www.meetup.com/WYBTD-Will-You-Be-There-Darling/discussions/5665472998014976/chat/\" target=\"_blank\">https://www.meetup.com/WYBTD-Will-You-Be-There-Darling/discussions/5665472998014976/chat/</a></p><p>If you need to know more - check out the testimonials on the 'group reviews' section here:&nbsp;<a href=\"https://www.meetup.com/WYBTD-Will-You-Be-There-Darling/about/comments/?op=all\" target=\"_blank\">https://www.meetup.com/WYBTD-Will-You-Be-There-Darling/about/comments/?op=all</a></p><p>WYBTD's founder and main host, Michael, is a veteran of over 1,700 Meetup events! You can now find him on Instagram: michaelgaylondon</p><p>WYBTD started on 7 April 2017 and has already more than 6,500 members and a plethora of upcoming events - we have something most days, and sometimes three or four!</p><p>Will you be there darling?</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"2042272","name":"Chinese / Korean / Japanese Society Meetup Group","link":"https://www.meetup.com/chinese-korean-japanese-society-meetup-group","description":"<p>We are the biggest Far East Asian meetup group in London.&nbsp; This group is for those who want to experience everything that life has to offer to the fullest, whilst at the same time have fun and make new friends. Perhaps most importantly, the aim of the group is to enjoy ourselves! All are welcome to join provided you share the same ethos!</p>\n<p>Planned activities will include: Dim Sum / Yum Cha | Sushi | Language Exchange (Mandarin, Cantonese, Korean, Japanese, Taiwanese, English) | Cinema | Badminton | Sports (Exercise) | Picnics / BBQ / Dinner Nights / Movie Nights | |Day Trips | Holidays Abroad | Camping | Hiking | Sight Seeing | Parties / Clubbing / Drinks | Business Networking | Investment/Finance | Computer Games | Board Games | Anything Else That Members Suggest!</p>\n<p>Depending on the number of volunteer organisers and numbers that join, we can have more than one event going on at the same time. Events and activities will be organised once every 1 -&nbsp;3 weeks and will be based around the themes of food, culture (movies and music), language exchange, keeping fit and healthy, exploring new places and sharing/developing new ideas.</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36224067","name":"London Singles live music Meetup","link":"https://www.meetup.com/london-singles-live-music-meetup","description":"https://linktr.ee/londonmusicshowcase\nhttps://youtu.be/pNDpgayHt8Q\nhttps://www.facebook.com/LondonMusicShowcase\nhttps://www.meetup.com/London-Music-Showcase-Gigs-Drinks/\nhttps://www.meetup.com/london-Bands-social-drinks/\n\nThis is for friends who like to see Live Music around London. We pick a location to meet for drinks, watch some live bands and then maybe out to a Bar/Club around Central London. It’s a mix of male and female, English and International friends - everyone’s welcome. French, Portuguese, Italian, Spanish, Japanese and English people so I’m sure you will meet someone that shares a passion for Rocking Music.\n\nIf you are new to the city and are looking for a good night out in London then feel free to join us. Some events are Free Entry and some are paid gigs with a cheap Guest-List. It's a group for friends to meet people and organise nights out together :)\n\n\\-\\-\\-\n\nThe Live Music Industry is unfortunately not what it used to be 20 years ago - Nowadays, an Artist is judged on how many ‘Likes’ and ’Thumbs-Up’ they can get on a Facebook page…\n\nWe live in London the MUSIC CAPITAL OF THE WORLD\n\nIf you don’t believe that there are amazing nights of music playing all-night long, then you haven’t been paying attention.\n\nI am offering any Band or Artist currently performing around London an Instagram ‘Follow’ if they want it. I have lived here all my life and I know great music events happen everyday because I’ve been there, seen it and I am happy to support it. Last year has probably been the hardest for many Musicians - Nearly all the best Live Music Venues have closed down - BIG RED / LOCK TAVERN / THE MONARCH and many others. Most Alternative Music has been pushed to East LONDON and It's pretty hard getting gigs. So, I will be hosting a few MUSICIANS MEETUPS and I welcome anyone playing music or searching for fellow musicians to come down for a drink 🙂🍻\n\nOver the last 5 years of running this Group, I have had a lot of people come and express an interest in meeting other musicians to form bands. It’s difficult meeting the right people so if you are a Singer, Guitarist, Bassist or Drummer, have a band or think there’s anything we might be interested in then this might be a good group for you.\nWe put on our own nights and are always looking for great bands to see around London. If you are looking for Gigs or reliable promoters, then we can probably help point you in the right direction.\n\nAt the very least, we can talk music and then watch some bands :)\n\nDISCLAIMER:\nWe are not responsible for you or your belongings. By attending events you agree to waiver liability for the Host :) Please bring ID to all events 18+ Thank you","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34921556","name":"Sapphists Hertfordshire","link":"https://www.meetup.com/meetup-group-vmefrdsa","description":"This is a social group to bring Women Who Love Women together,  build a friendly, active over 18s WLW network in Hertfordshire and have fun!\n\n\n\n\nMeet-ups are a great way to meet new people and connect so come along to one of the social events and say hi. We are a really friendly, welcoming bunch!\n\n\n\n\nWe have a great group of organisers, of varying ages, all of whom bring very different life experiences and perspectives to the mix.  In 2022 we are combining Sapphists Hertfordshire with Hitchin Sapphic Socials, and have added a mid Herts event organiser, so we hope you can find something for you not too far from home.  During the last couple of years, spurred on by the desire to address social isolation amongst our Herts LGBTQ+ community, we have enjoyed pub and meal nights, picnics, beach volleyball, book groups, walks, theatre trip, Hertfordshire Pride, North Herts Pride picnic etc.  Some great friendships have developed between some members, and we have been supportive just by being there for each other.\n\n\n\n\nWe hope that the group will grow and develop over time so please do chat to us about your ideas. If there is something you would like to see as part of this group then let us know.\n\n\n\n\nWe look forward to meeting you soon!\n\nEvent Organiser Jacqui - Living in Brighton for almost 15 years I always felt part of a community as LGBTQ+ is part of the fabric of the city. It felt different when I moved to Hitchin so I started a local group to help people feel connected to a wider community and have fun!\n\n\n\n\nGroup Organiser Gillian - After discovering I am lesbian in my 40s/50s, I met and married a woman and moved to another county.  Returning alone to Watford a few years ago, I began to realise I had absolutely no connection with women who love women here!  I joined Meetup and Facebook groups, have enjoyed some great events, and have made many valuable new friends.\n\n\n\n\nEvent Organiser Sharon - I joined the group to socialise with like minded people and have made some lovely new friends.  I’ve enjoyed various nights out with the Sapphists ladies, from meals out, karaoke, book clubs, music to Prides.  Lots of fun and laughter to be had.\n\n\n\n\nEvent Organiser Jenny - I realised I was gay later than most people my age and then felt like I was the only gay in the village.  It seemed like all Lesbian/Bi events were in London and there was nothing in the countryside.  Going to my first LGBTQ+ Meetup was a game changer for me and this group has played a wonderful part in my journey.  So for me helping organise events is my way of paying it forward.  You couldn’t ask for a nicer group of people.","city":"Watford","state":"F8","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36086242","name":"THE FILM ATELIER  Folk Indie Classical Music Jam, Gigs Meets","link":"https://www.meetup.com/musicians-london-southeast","description":"**For: Acoustic musicians, singer-songwriters, classical musicians and musical instrument & world music players!**\n\n(Not for: Drum N Bass, Rap, RnB, Soul, Funk, Electronica or X factor style commercial music)\n\n**Who Should Join: Solo acoustic instrumentalists, singer-songwriters, session players, keen musicians who know their way around their instrument; those looking for ensemble playing experience and performance. We are not an Open Mic. Meet-up is just one platform we use and we currently trial Meet-up to see whether this is worth continuing with.**\n\n**What we do at events:** We are a new independent start-up! Acoustic Music is core to our emotional well-being, down the the rhythm of our heartbeat. We promote being well and healthy through music and developing a small local community of budding musicians who are otherwise isolated and disconnected from growing with other musicians.\n\n2 hours long acoustic music sessions limited to a max of 8 musicians. We work on shared and agreed music repertoire and play as an ensemble or session. We have our own performance space and audience in the acoustic cafe coffeehouse style.\n\nWe currently run 5 acoustic music meet ups:\n\n**1\\. Classical Chamber Meet\\-up: Saturdays 3\\.00pm \\[sessional depending on players\\]**\n**2\\. Singer\\-Songwriter Indie Alternative Session: Saturdays 5\\.00pm**\n**3\\. Alt\\. Folk Acoustic Session: Wednesday 6\\.00pm**\n**4\\. London Chinese Music Instrument Music Meetup: Sundays 2\\.00pm \\[Private\\]**\n**5\\. World Music \\[Acoustic instruments only\\] Meet up \\[NEW\\]: Sundays 2pm** \n\n**1\\. Classical Music & Chamber Music Meet\\-up:** If you know your way around your classical instrument (cello, violin, flute, clarinet etc), and are interested in meeting like minded instrumentalists to grow and nurture classical ensemble playing- drop us a message with your instrument and repertoire interest! We work out scores with parts we can rehearse and put together.\n\n**2\\. Acoustic Indie Alternative Sessions:** Unlike Open Mics, we work around each others' songs and songwriting, traditional folk and original songs creating instrument parts from the collective of musicians. By alternative, we refer to the spirit of alternative music in its non-commercial, non-saccharin lyrics and non-pop structure.\n\n**3\\. Alt\\. Folk:** we started off performing as folk musicians and love folk music by T Bone Burnett, Wovenhand, Jason Isbell and the Indigo Girls. We play loosely and openly embrace new twists and turns to folk music. We're definitely not oldtimer style!\n\n**4\\. London Chinese Music Instrument Meet up:** Private session. Interested players committed to performing and long term playing are welcome to enquire. From time to time we invite new members.\n\n**5\\. World Music \\[Acoustic\\] Meet up:** open to anyone who plays or sings (ethnic) world music acoustically. First meeting scheduled for Sunday 3rd May 2022 @ 2pm\n\n**Email: thefilmatelierse6@gmail.com**","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"17549802","name":"London Theatre & Film Meetup","link":"https://www.meetup.com/london-theatre-and-film-meetup","description":"**A Social group for People who enjoy WestEnd Theatre and Film Shows!**\n**Maybe a bit passionate... serious theatre and film goers needed!**\nWhat we do is to get a group of like minded individuals (That's YOU) to get together and watch Theatre and Films in London, with a **bit of socialising** throw in - I have met some really lovely interesting people. We are a **busy** group and see more than just one or two shows a month!\nWe love theatre in with A-listed stars in them, musicals, fringe, tear jerkers, films with George Clooney, serious dramas, indie films, cult classics, comedy, opera in fact anything goes. The only criteria for joining is you love the Theatre and Film, so become one of us!!!!\n*Often I have priority booking for shows and I will get tickets for the group -'cos its more fun sitting together.*\n*And of course if I hear of any deals, discounts or special events I will let you know!*\n\n***New Season booking has opened and I've got some extra tickets for sale!!***\nEureka Day stars Helen Hunt\n**Who Killed my Father Directed by Ivo van Hove**\nRose stars Dame Maureen Lipman\n**John Gabriel Borkman stars Simon Russell Beale (The Lehman Trilogy)**\nBlues for Alabama stars Samira Wiley\n**The Band's Visit- musical theatre Winner of 10 Tony Awards**\nJerusalem\nHandbagged\nThe Upstart Crow by Ben Elton\n**Matthew Bourne’s Sleeping Beauty - Ballet**\nThe Wife of Willesden\nImmersive Theatre Guys and Dolls\n**\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-**\n**Some of the past shows:**\n**The Ferryman**\n**42nd Street**\n**Matthew Bourne’s Red Shoes**\n**The Truth**\n**Travesties**\n**Funny Girl**\n**When Father came home from the war part 1,2 and 3**\n**THE INTELLIGENT HOMOSEXUAL'S GUIDE TO CAPITALISM AND SOCIALISM WITH A KEY TO THE SCRIPTURES starring Tamsin Greig**\nMan and Superman/ Richard III and Master Builder with Ralph Finnes\nThe Father\nPeople Places and Things\nD H Lawrence's Husbands and Sons starring Anne-Marie Duff\nKinky Boots\nDeath of a Salesman\nLes Liaisons Dangereuses' with Dominic West\nHamlet\nFunny Girl\nLooking for Godot\nView from the Bridge\nThe Play that Goes Wrong\nAntigone with Juliette Binoche\nThe Ruling Class with James McAvoy\nHangmen\nThe Rocky Horror Picture Show *feat. Richard O'Brien*\nAnd a lot of Shakespeare!\n**New events are added on a regular basis - so come along join us and lets see a show together!**","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"19487288","name":"Saturday Guitar Jam","link":"https://www.meetup.com/saturday-guitar-jam","description":"<p>A friendly, relaxed jam with guitarists (or other musicians) in a private room upstairs in a pub <br></p>\n<p>The format is fairly laid back, we encourage folk who come along to share a song with the group via the medium of our whiteboard and we'll attempt to play and sing our way through it as a group. <br></p>\n<p>We don't have a fixed song list as it tends to change depending on who comes along week to week, and the ability of the people attending. (If no-one has songs to share it ends up being a lot of Neil Young, Beatles, Dire Straits or stuff from the 90's, be warned!) <br></p>\n<p>If you fancy getting out and playing with others, come along. It's a good way to work up the courage towards going to an open mic and a great way to get over that difficult bump of practicing alone in the bedroom to sharing your talent with the world.</p>\n<p>None of us are teachers so this is not a substitute for taking lessons (we'd only teach you bad habits), if you're more of a beginner you may want to consider these guys - <a href=\"https://theguitarsocial.com\">https://theguitarsocial.com</a></p>\n<p>We're mostly guitarists but we're open to other musicians coming along - just as long as it's not too loud and portable (bagpipes or church organs might be a bit tricky!) <br></p>\n<p>Our events are very often oversubscribed, and a waitlist system operates. If you do end up being on the waitlist, please don't come along on the off chance that you'll get a space - you won't.&nbsp; The pub still operates while we are there and we keep numbers to those advertised to respect the wishes of the pub, so as not to affect their patrons.&nbsp;</p>\n<p>Anyone drawn here by the word 'jam' who is a big fan of fruit based preserves to put on your toast, sorry, but I'm sure there's a meetup out there for you somewhere <br></p>\n<p> <br></p>\n<p> <br></p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"32511274","name":"London Philosophy Collective","link":"https://www.meetup.com/london-philosophy-collective","description":"<p>Connecting people into Philosophy.&nbsp;</p>\n<p><span>Encouraging conversations and discussions of everything from Politics to Pop Music, Ideology to Identity, Markets to Marxism, </span><span>Feminism to Faith, </span><span>Aesthetics to Anarchy, Capitalism to Consciousness and beyond...&nbsp;</span> <br></p>\n<p>We're open to everyone.&nbsp;<span>From beginners to experts.&nbsp;</span></p>\n<p>Our ethos = Be excellent to each other. Define your terms. Try to admit when you're wrong. And have fun and try your best.&nbsp;</p>\n<p><span>All you need is an open mind and a curious heart.&nbsp;</span></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35986859","name":"Surrey Women's Social 20s & 30s","link":"https://www.meetup.com/surrey-womens-social-20s-30s","description":"The purpose of this group is to meet other women in their 20s and 30s in Surrey, and take part in a variety of activities while enjoying all this beautiful county has to offer.\n\nWhether you're a local, newcomer, single, or married, we all know how tough it can be to meet new people outside of work and existing social circles. If you're interested in meeting new people, making new friends, and attending fun, laid-back events, then this is the group for you!\n\nIt seems like a lot of the Meetup events geared towards women are always full, so I decided to start my own. Events might include: country walks, brunch, dinner, playing tourist, live music, picnics, theatre, art exhibits, museum visits, and more.\n\nI know everyone has different schedules, so I plan on setting up at least one event every month- come to as many or as few as you'd like!\n\nI look forward to meeting you at an event soon 🌸\n\nGroup etiquette:\n-The events are mostly held in smaller groups.\n-Please RSVP only if you are certain you can attend (of course things happen sometimes, and you might have no choice but to cancel, in this case please make sure you update your RSVP ASAP). Members who RSVP and don't show up will be removed from the group, to be fair and respectful to members who are on the waiting lists and do want to come to the event.\n-Unless it's a 'show up whenever you want' event, please aim to arrive on time.\n-Thanks for being considerate!","city":"Guildford","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36005618","name":"Arabic Music, Dance and Party Meetup Group","link":"https://www.meetup.com/arabic-music-dance-party-meetup-group","description":"<p>This group is for those who love Arabic Music, Dancing Food and Culture. Events  will include live music and dancing. Join also for Arabic language meetups &amp; Cultural events.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1738311","name":"South Bucks Social","link":"https://www.meetup.com/south-bucks-social","description":"Hi and Welcome to the wonderful world of South Bucks Social Club aka SBS. We are a very friendly & inclusive bunch, who enjoy everything from pub quiz's, to walks, to meals, to music, to cinema, to talks, to theatre events and everything in between, in and around the South Bucks area. But we are not a singles or dating group.\nThe club is run by Brian, Dawn & Mary, plus has a whole bunch of wonderful Event Hosts, hosting a wide variety of events. \nWe do charge a small subscription fee of £5.00 per year, however we do not charge a \"per event\" attendance fee. We are a non profit organisation and all subscription fees goes to cover the cost of using the Meetup web platform.\nWe look forward to welcoming you to one of the many SBS events soon!\nAll the very best, \nBrian, Dawn, Mary and all at SBS :)","city":"Burnham","state":"B9","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36408420","name":"Female Friends in SE London 35+","link":"https://www.meetup.com/female-friends-in-se-london-35","description":"This is a female only group for 35+ women in SE London (Crystal Palace, Dulwich, Peckham)\n\nHi everyone,\n\nI started this group to meet new people and hopefully make new friends! Join me if you enjoy coffee, picnics, cinema, dog walks, live music…\n\nSee you soon :)","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"21075569","name":"Marianna's Events : London Nightlife Social 20s, 30s, 40s","link":"https://www.meetup.com/mariannas-events-london-nightlife-social-20s-30s-40s","description":"<p>We are inviting you to join Marianna's events in London! Having an extended experience of organising events, we started organising events on 2010, we are promising to create fun social experiences to help you explore London nightlife and connect with people/ make new friends in a fun and relaxing way/ atmosphere. Events that we are planning to organise include, but are not limited to, social nights out, live music, cabaret, comedy, games nights (ping pong, beer pong, card and board games), clubbing and business networking events. Our events are hosted by friendly hosts, which are there to welcome you, and make introductions, so there is nothing to worry about coming alone, most of the people come alone to meet new people. Of course friends are always welcome. The more- the merrier! Our social adventures are mainly targeting people in their 20s, 30s and 40s. We hope to see you soon, in one of our events!&nbsp;</p>\n<p>For more events feel free to join our facebook group:&nbsp;<a href=\"https://www.facebook.com/groups/453202104877514/\">https://www.facebook.com/groups/453202104877514/</a></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36463180","name":"Creative & Social London: Creative Projects on a Dime","link":"https://www.meetup.com/creative-social-london-music-projects-on-a-dime","description":"**Tired of Uncreative Social Gatherings!?**\n\nNo more. Make songs & movies & musicals as a way of **meeting** new super creative interesting people ! All in a single day.\n\nSure. Playing sports or going out is *hella* fun; sitting in a park is great when the sun's out. But sometimes you just want to get *creative*. We help you with that: Connect with others through **MUSIC** making, **FILM** shoots, and **more**.. That includes singing & songwriting, acting directing & script-writing - then discuss what you learned through the process. (Awesome, we know.)\n\n--\n**Where is it?**\n\nA fully-equipped music studio with shooting space and group privacy, in a heart-of-bustling-**Central-London *cottage* (Waterloo!)**, with **566 sq ft of space**, running water and an outside area to chill n vibe. Benefitting from ground-floor access, it's comprised of 4 rooms and equipped with all you need for a music business to make their own (and some cheeky on-site film shoots).\n\nOutside of this beautiful space, you will also have the benefit of an independently run **on-site cafe, music venue & bar.** Check the photo album!\n\n**Why Join?**\n\nYou're creative. Or adventurous. Or curious about music. It's in your blood whether as as a listener, fan, or maker. Fear is usually what stops us. But **this group is for all people:**\n\n* Casual music & movie fans and listeners 🎧 🎥\n* People who just want to try something cool\n* People who secretly write songs or think up ideas 🎹 📹\n* Actual musicians & directors who get paid to create **[FIND YOUR TEAM!!!**]\n\nWhatever your background, the focus is on **coming together** in a chilled way, to make something:\n\nSilly 👽\nFun\n🔥 🚒 Ambitious\nSuper Casual...\n\nIt's easy to spend lots of time talking about a project. Or eternally waiting for the right finances, to back it. Or being too scared to approach to just **try something hella new & cool**.\n\nWhat makes this group **very different to the others** is...wait for it: **THIS IS WHY WE'RE GREAT**:\n\n* We pay attention to the ***deeper*** *meaning* of a song & film & scene.\n* We ***discuss*** about what we made, after the session.\n* You can meet your **long-term** TEAM (💍 or boo).\n\nCreating alone is important for self-development but being part of a community is also important.\n\nWouldn't it be cool to approach fear head-on in a relaxed **group setting** where everybody is new and meeting each other for the first time?\n\n**You're in the right place.**\n\n--\n***FAQs***\n\n**What is this group about?**\n\\- Making music & movies as a way of meeting new people\\! Having fun\\. Exploring the meaning of a song & film\\.\n\n**Is this only for professionals?**\nNope. Come as you are. Relax. Have fun. It'll be a bit nerve-wracking but everyone is new and meeting for the first time.\n\n**Can I network (I'm a songwriter, filmmaker, actor, etc)?**\nYES. Find your team. But focus on the day on creating something beautiful with everyone. Make sure your '**allow others to message**' setting is turned on in your Meetup profile ! (Otherwise, they won't be able to connect after the session!)\n\n**Is this a dating group?**\n\\- If you meet someone you meet someone\\, no big deal\\. Say hi if you like someone\\, or message after \\(make sure your setting above is enabled\\)\\.\n\n**Will we actually write a whole song or film in a day?**\n\\- YES\\. And no\\! Depends on what the group wants to do and the session length\\. Some events will be about making a full thing in one day together\\. BE AMBITIOUS BABY 👶\\.\n\n**Why is it fun to create with others?**\n\\- My friend\\.\\. It's what we were made to do\\. Be there or be ⬛","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":true},{"id":"23914696","name":"London Baroque Music Lovers","link":"https://www.meetup.com/london-baroque-music-lovers","description":"You love classical music from the Baroque period, such as **Bach**, **Vivaldi**, **Telemann**, and **Handel**, and you're **not** alone! So why attend Baroque concerts alone, when you could do so with your fellow London Baroque music lovers!\nIf you see a concert coming up that interests you, please create a meetup event here so that your fellow enthusiasts can join you!\n\nAnd if you also like World Music – check out our sister group London World Music Lovers at https://www.meetup.com/London-World-Music-Lovers/","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35880421","name":"London Band and Musicians Instagram-Meetup :)","link":"https://www.meetup.com/london-bands-social-drinks","description":"https://linktr.ee/londonmusicshowcase\nhttps://youtu.be/pNDpgayHt8Q\nhttps://www.facebook.com/LondonMusicShowcase\nhttps://www.meetup.com/London-Music-Showcase-Gigs-Drinks/\nhttps://www.meetup.com/london-Bands-social-drinks/\n\nThis is for friends who like to see Live Music around London. We pick a location to meet for drinks, watch some live bands and then maybe out to a Bar/Club around Central London. It’s a mix of male and female, English and International friends - everyone’s welcome. French, Portuguese, Italian, Spanish, Japanese and English people so I’m sure you will meet someone that shares a passion for Rocking Music.\n\nIf you are new to the city and are looking for a good night out in London then feel free to join us. Some events are Free Entry and some are paid gigs with a cheap Guest-List. It's a group for friends to meet people and organise nights out together :)\n\n\\-\\-\\-\n\nThe Live Music Industry is unfortunately not what it used to be 20 years ago - Nowadays, an Artist is judged on how many ‘Likes’ and ’Thumbs-Up’ they can get on a Facebook page…\n\nWe live in London the MUSIC CAPITAL OF THE WORLD\n\nIf you don’t believe that there are amazing nights of music playing all-night long, then you haven’t been paying attention.\n\nI am offering any Band or Artist currently performing around London an Instagram ‘Follow’ if they want it. I have lived here all my life and I know great music events happen everyday because I’ve been there, seen it and I am happy to support it. Last year has probably been the hardest for many Musicians - Nearly all the best Live Music Venues have closed down - BIG RED / LOCK TAVERN / THE MONARCH and many others. Most Alternative Music has been pushed to East LONDON and It's pretty hard getting gigs. So, I will be hosting a few MUSICIANS MEETUPS and I welcome anyone playing music or searching for fellow musicians to come down for a drink 🙂🍻\n\nOver the last 5 years of running this Group, I have had a lot of people come and express an interest in meeting other musicians to form bands. It’s difficult meeting the right people so if you are a Singer, Guitarist, Bassist or Drummer, have a band or think there’s anything we might be interested in then this might be a good group for you.\nWe put on our own nights and are always looking for great bands to see around London. If you are looking for Gigs or reliable promoters, then we can probably help point you in the right direction.\n\nAt the very least, we can talk music and then watch some bands :)\n\nDISCLAIMER:\nWe are not responsible for you or your belongings. By attending events you agree to waiver liability for the Host :) Please bring ID to all events 18+ Thank you","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"8220792","name":"UK Trance Society","link":"https://www.meetup.com/uk_trance","description":"<p>Hi there! Welcome to the UK Trance Society (UKTS)!</p>\n<p>We aim to unite trance fans from all corners of the UK and to make this a great community for trance music meet ups, discussions and to make new raving friends. :)</p>\n<p>Have a look at our upcoming events and RSVP. We would love to meet you. After you have attended three Meetup events you can be added to our Whatsapp groups. We have several running, one for everything trance related and a bunch of others for everything else!&nbsp; <br></p>\n<p><b>***THINGS TO KNOW BEFORE JOINING:</b>&nbsp; <br><span> <br>1.&nbsp;Please upload a profile picture with a clear face (without sunglasses etc.) so we know who to look for at events.&nbsp; <br> <br></span><span>2. &nbsp;UKTS is about bringing people together, so please treat your fellow trancers with love and respect. Racism, threats, harassment or other forms of violence/abuse will not be tolerated.&nbsp;Spam, references to drugs or any other inappropriate posts will be removed and may result in a ban.&nbsp;&nbsp; <br></span><span> <br>3. To maintain our close group we are encouraging people to attend our pre meets. If you are unable to attend the pre meet please update your RSVP on Meetup to let our hosts know. Whatsapp groups will be created for every event so everyone can coordinate and meet each other on the day. :)&nbsp;If you are only able to make the main event that's also fine, don't forget to tell the host so the group can pick you up later.&nbsp; &nbsp;</span></p>\n<p>4. We may remove members who (repeatedly) RSVP and then fail to show up for the event or people who have been inactive on Meetup for more than 6 months.&nbsp;</p>\n<p><span>We look forward to seeing you on the dance floor!&nbsp;</span></p>\n<p><span>Meanwhile... c</span><span>heck out our socials:</span></p>\n<p><a href=\"https://www.facebook.com/UKTranceSociety/\">https://www.facebook.com/UKTranceSociety/</a> <br><a href=\"https://www.facebook.com/groups/uk.trance.society/\">https://www.facebook.com/groups/uk.trance.society/</a> <br><a href=\"https://www.twitch.tv/uktrancesociety\">https://www.twitch.tv/uktrancesociety</a> <br><a href=\"https://www.youtube.com/UKTranceSociety\">https://www.youtube.com/UKTranceSociety</a> <br></p>\n<p>We also have a podcast series: <br></p>\n<p><a href=\"http://uktrance.podbean.com/\" class=\"linkified\">http://uktrance.podbean.com/</a> <br><a href=\"http://www.mixcloud.com/uktrancesociety\" class=\"linkified\">http://www.mixcloud.com/uktrancesociety</a> <br></p>\n<p>And head here for your UKTS merchandise! :) <br></p>\n<p><a href=\"https://shop.spreadshirt.co.uk/uktrance/\">https://shop.spreadshirt.co.uk/uktrance/</a></p>\n<p>If you experience any issues/problems feel free to contact us and we will be happy to help out.</p>\n<p><b>***UKTS MANAGEMENT: <br></b><span>Alan Gay&nbsp;&nbsp; <br></span><span>Ells Hamblin&nbsp;&nbsp; <br></span><span>Michael Paske&nbsp;&nbsp; <br></span><span>Paul Roberts&nbsp;&nbsp; <br></span><span>Rachel Page&nbsp;&nbsp; <br></span><span>Sebastiaan Zijl <br>Tim Hollins</span></p>\n<p>***NOTABLE MEMBERS: <br>Hon Pang (Founder), Roxie Pandrea, Birgitte Gorholt,&nbsp;Scott Archer,&nbsp;Beatrix Hegedus, Rathin Sawhney, Eric Nuyen, Ed Stannard, Ann Brown.</p>\n<p><b>-----&nbsp;</b> <br></p>\n<p><b>***THINGS TO KNOW WHEN HOSTING A MEETUP:</b></p>\n<p>If you agree to host an event and be the main point of contact, you need to carry out the following tasks:&nbsp; <br> <br>&nbsp;1. Find a suitable meet up location, preferably somewhere nice and not too busy <br>2. Set a time when the group will be meeting and when you plan to move to the venue. <br>2. Create a Whatsapp chat one to two days before the event and post the link on the meetup page.&nbsp; <br>3. Please arrive on time – if you are running late please let people know.&nbsp; <br>4. Introduce yourself and new arrivals to group. Try and be friendly and accessible. Keep track of where everyone is during the night and keep an eye on the whatsapp to see if no one is lost etc. <br>5. We encourage members to provide feedback on their hosts so we can acknowledge what we are doing right and what we need to improve.&nbsp;</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"1476857","name":"London Country, Blues and Folk Gigs","link":"https://www.meetup.com/london-country-blues-folk-gigs","description":"<p><span>This is a group for people who love to hear live music - americana, country, f</span>olk, blues, bluegrass - but don't necessarily want to hear it on their own.&nbsp;<span>If you love live music and great people, join us!</span></p>\n<p><span>We go to a variety of gigs and sessions around London. Sometimes it's a set of new local bands we don't know about.&nbsp; Sometimes they're great, sometimes not - that's part of the joy of discovering new music! Sometimes we organise trips to big concerts by touring international artists too, or go to festivals. We even did a trip to Nashville!</span></p>\n<p><span>If we're going to listen to someone you like or if you want to take a chance and maybe discover some great new music, come along - we’d love to see you! <br></span></p>\n<p><b>What sort of music?</b></p>\n<p><span>We've been to see: folk, americana, blues, bluegrass, blues-rock, alternative-indie, indie-rock, honky-tonk, Cajun, world, roots, nu-folk, folk-rock, folk-pop, folk punk … just to name a few. Some of the artists, big and small, include: Sarah Vista, The East Lonesome Drifters, The Afrocelt Sound System, The Handsome Family, Yola, Neko Case, Roseanne Cash, Rising Appalachia, Danni Nichols, The Rails, Calexico, Tift Merritt, The Secret Sisters, Basia Bulat, The Lake Poets ... and a Johnny Cash impersonator. (He was awesome.)</span></p>\n<p><strong>How events work</strong></p>\n<p><span>Some events are cheap or even free. Others are pricier, big venue gigs.&nbsp;Tickets aren't provided by the group - everyone buys their own - but ticket links will be provided. Some of the gigs sell out fairly quickly so please try and buy in advance so that you definitely get to come!&nbsp;</span></p>\n<p>Every event will have a host. They'll give instructions on how to find them and the rest of event attendees. In return, look for them and make yourself easy to find.&nbsp;</p>\n<p>Can't make a gig? Cancel your RSVP and/or let us know.&nbsp;</p>\n<p><span><strong>Suggestions?</strong></span></p>\n<p>We're a member-run group. If you've got a suggestion for a gig, contact an organiser. Note, it has to be a gig you'd attend anyway. <b>Don't use this as PR for your events, your husband's band, your friends' act, etc. We don't do open mic nights either.&nbsp;&nbsp;</b>The more lead-time before the gig, the better.&nbsp;Your organisers don't have the time (or inclination) to go to everything, so if you're willing to act as host for other members, great!&nbsp;Don't be upset if no one seems interested. People are busy and maybe the gig is just not at the right place or time.</p>\n<p><span>Hope to see you soon! <br> </span></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35920130","name":"London Jam Sessions Meetup Group","link":"https://www.meetup.com/london-jam-sessions-meetup-group","description":"<p>This is a group for people to get together and play live music in London. Each jam session will take place at Pirate Rehearsal Studios in Notting Hill.</p><p>Sessions will loosely follow a setlist that anyone attending can suggest songs for. All music genres are appreciated, please feel free to suggest anything</p><p>This group is welcome to musicians of all skill levels!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36264229","name":"Jazz / Blues / Soul / Funk Band Rehearsals","link":"https://www.meetup.com/jazz-blues-soul-funk-band-rehearsals","description":"This will be a new group for intermediate level players who want to play this music together, improve their overall musicianship, aiming to (gradually) get to gig level standard on a wide-ranging set of tunes. You should therefore expect to spend some time working on the detail of various sections of tunes so as to get them down really tight, and also pay attention to making the whole band sound really good. So the intention is to provide a space for some disciplined rehearsal time, but still allow plenty of time for people to try things out and enjoy learning from each other. Here's a link to a list of songs/tunes we'll probably be starting to work on:\n\nhttps://docs.google.com/spreadsheets/d/1-0ywZMkjtGEmDSn7I3JOhY7Tg0YlWqcoAW7gHqapguM/edit#gid=0\n\nThe group would also suit any musicians who might want to write their own arrangements of tunes. My main instruments are tenor and alto sax.\n\nWe will (hopefully) get to play quite a wide variety of songs/tunes, across all the genres mentioned.\n\nThe aim is to get a relatively stable group together, build up a decent setlist to performance standard, then look for local gig venues to perform at.\n\nWe will start off with 3 or 4 hour rehearsal sessions, typically on Sun afternoons (perhaps once or twice per month to start with, depending on how keen everyone is), at a Studio in London.\n\nLooking forward to playing together ...","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18230470","name":"The Guitar Social","link":"https://www.meetup.com/officialguitarsocial","description":"<p>Hello and welcome to The Guitar Social. A place to learn guitar and meet new people.&nbsp;</p><p>We offer classes, workshops social events and holidays all linked to learning and making music.</p><p>Everything we do runs from our own bar in Bethnal Green which is very much the happy home for all of our many members who like nothing more than hanging out with other musicians, having a beer and getting better at music.</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"32378005","name":"Sociable Musicians and Live Music Enthusiasts in London","link":"https://www.meetup.com/live-music-lovers-in-london","description":"This group is for connecting people who love attending live music and stand up comedy, dancing events and aspiring musicians/comedians and dancers. We plan to organise live music, stand up comedy events, dancing (like salsa) events where we all meet, build connections and friendships and support talent. If you are an aspiring artist looking to connect with other artists or perform in front of a crowd or a person who just enjoy watching this is the group for you!\nIf you want you are very welcome to join our social facebook group: [https://www.facebook.com/groups/453202104877514/](https://www.facebook.com/groups/453202104877514/)\nIf you want to propose an event that you like to host feel free to do so!\n\nAlso if you are an aspiring artist and want to perform at our events feel free to drop me an e-mail at : benetoupromotions@gmail.com","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"255112","name":"The London Indie Music Meetup Group","link":"https://www.meetup.com/indielondon","description":"<p><span>If you're one of those who doesn't take part in a snowball fight because your converse will get wet, like watching some new undiscovered bands, coming to some indie club nights or just meeting new people into the same stuff as you, join me and the rest of the gang.</span></p>\n<p>See what we're up to: <br> <a href=\"https://www.meetup.com/indielondon/events/\">https://www.meetup.com/indielondon/events/</a></p>\n<p>See us having fun at past Meetups: <br>https://www.meetup.com/indielondon/photos/<br></p>\n<p>And if you're feeling genenerous, please donate to help pay the fees Meetup charges (Optional): <br>https://www.meetup.com/indielondon/dues/<br></p>\n<p>See you soon :) <br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"222799","name":"The London Jazz Meetup","link":"https://www.meetup.com/london-jazz","description":"Welcome to the London Jazz Meetup . This is a group for people who love jazz and live music in all its varied forms: from swing to be-bop, acid jazz to jazz-rock. If your friends are into R 'n' B or the latest in hard-house or Justin Bieber (!) and you're not, and you need to find a group in which you can feel at home, this is the group. We're about jazz music, socialising and having fun - this is not about jazz bores wearing turtle-neck jumpers! Membership is growing, so by joining you'll get a wide variety of music and get to meet some great people of all ages and backgrounds. *Jazz is increasingly popular; it is still most definitely cool!*\n\nSo our aim is simple. To provide an open forum for lovers of good music to meet and enjoy music in a range of venues across the city, from the large to the small and most of all to have fun. Think of it as **3400**+ friends you can call upon to go to great gigs and other events with. It's mostly about going to gigs, but we have social meetups too and, with enough support from members, other things like jam sessions, picnics and cinema visits. It also offers scope for musicians - or those learning jazz music - to hook up and share their passion. So introduce yourself and share why you joined. Do check the calendar for news about events - members are always on the lookout for suggestions for the best live jazz in London...and guaranteed fun.\n\n[This document sets out what the meetup is about and what you can expect from it.](http://files.meetup.com/222799/Statement%20of%20purpose.pdf)\n\nThere is a small one-off voluntary membership fee for this jazz meetup - the £2 helps with the running costs of the meetup website, but it's also there to encourage members to commit to contributing to the group. If you pay something, you're more likely to want to join in and get value from this - after joining up, all other meetups are free (other than paying for entry to any events, which is members' responsibility).\n\n[*NOTE - since the site re-design of meetup, they've removed from the front page the membership subscriptions tabs. So, just click on 'members'; on the left hand column of this page (the old design), you'll see about a third of the way down where it says 'Membership fee' - click on that, and you can pay through PayPal (no account needed)*]\n\n**How much is in the calendar is entirely down to the membership.** \nI cannot stress this enough. If there aren't gigs in the calendar you want to go and see, then think about running a meetup yourself. Meetups like this thrive on everyone joining in and contributing once in a while, and not just waiting for the organisers to, well, organise everything. If you want more variety in the calendar, then come up with ideas and suggest them. Get involved and help make this a successful meetup. Why not offer to become a 'host', so you can put gig meetups in the calendar that you want to see?\n\n**London is a fantastic city full of great music and friendly people - sign up and make the most of it** !","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35718586","name":"Aylesbury Out & About Social","link":"https://www.meetup.com/aylesbury-out-about","description":"<p>A Meetup Group for Aylesbury and the local area. If you're over 35 and want to be Out &amp; About then this is the group for you!</p><p>For an annual membership of £5.00 you have access to a variety of events including theatre, films, comedy gigs, live music nights, quiz nights, 10 pin bowling, day trips, bingo, Sunday lunches etc. When the group is more established we can add a book club and some walks. Suggestions for events and, importantly, hosts for them are very welcome!</p><p>To join please ensure you have a recent profile picture that clearly shows your face and you live within easy reach of Aylesbury as you will need to make your own way to events (unless stated otherwise in the event details). You will also need to pay the membership fee within 1 week of joining.</p><p>I look forward to meeting you all and being Out &amp; About!</p><p>Amanda 😀</p><p><br /></p><p>RISK DISCLAIMER: Please note that all members take part in all activities solely at their own risk should any personal loss; accident; illness or physical injury occur during an event.</p>","city":"Aylesbury","state":"B9","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"35881345","name":"London Live Get Together Meetup Group","link":"https://www.meetup.com/london-live-music-get-together-meetup-group","description":"<p>Bringing lovely people together to hang out together and discover the best independent artists and bands at the coolest music venues, bars and clubs. Cant wait to introduce you to exceptional new music and some great new places too! I have a live music discovery platform too - Success Express Music, so check it out!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"14618622","name":"London Chamber Musicians","link":"https://www.meetup.com/london-chamber-musicians","description":"This is a meetup for amateur musicians looking to play classical chamber music in a friendly and supportive environment.\nTo-date we have run regular ‘rehearsing’ sessions - generally in west London with 1-3 groups playing depending on numbers. We discuss online in advance what we might play, but we might also play a piece that someone brings along on the afternoon, so although we have a range of levels in the group, a good level of sight-reading skills are pretty important.\nThe Meetup is also very much a forum for meeting other musicians, so please do post a message on here or in our Facebook group (where discussions are a bit easier!) to suggest your own meetup or form your own group [https://www.facebook.com/groups/2180885818652244/](https://www.facebook.com/groups/2180885818652244/).\nP.S. We're running a survey at the moment to gather feedback and ideas on our Meetup to help you get more out of our sessions.\nWe'd love to know what you think, whether you’ve been with us for a while or are completely new. New ideas we’re considering include accommodating less experienced players better, running performance sessions, and running regular social events. [https://goo.gl/forms/rU8SkRWM3g4AHq4k2](https://goo.gl/forms/rU8SkRWM3g4AHq4k2)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"33214696","name":"Poetry & Music - organised by Different Planet","link":"https://www.meetup.com/poetry-music-open-mic-organised-by-different-planet","description":"<p>This group is for people who who enjoy delivering and/ or watching performances based on words, melodies and the creative craft. It is for performers and non performers alike. </p>\n<p>Cosmopolitan by nature, we embrace artistry from around the world. From styles reminiscent of Maya Angelou, The Beat Poets, Joni Mitchell to Xiaoni Wang, Gulzar (Sampooran Singh Kalra), Tracey Chapman, Simon &amp; Garfunkel and beyond…</p>\n<p>The spirit of this event is on embracing our shared humanity and bringing people together. It’s all about good natured fun and leaving divisive issues outside.</p>\n<p>Organised by Different Planet: art - culture - wellness network <br>www.diffplanet.net</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"25028275","name":"Live music!","link":"https://www.meetup.com/live-music-at-cafe-12","description":"<p>This is a group for anyone who love music!<br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18501431","name":"Songwriting for Beginners","link":"https://www.meetup.com/london-songwriters-workshops-for-beginners","description":"<p>Want to learn how to write powerful songs?&nbsp;<span>Our Evening Courses, Song Clinics, Countryside Retreats, Song Camps will teach you the tools used in writing great songs in any genre.</span></p>\n<p>The group is run by Murray Webster, an experienced multi-genre Songwriter, Educator, Songwriting Masters Degree Graduate &amp; Community Music leader.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"12889432","name":"Voice and Yoga & Circle Singing group","link":"https://www.meetup.com/vocalexploration","description":"<p><span>✨ Everybody’s welcome to create with us&nbsp;✨</span><br></p>\n<p> 🎊&nbsp;JOIN US!&nbsp;<br></p>\n<p><b><br></b></p>\n<p><b>CIRCLE SINGING LONDON (for voice and yoga info scroll down)</b></p>\n<p><i>Who loves to sing, treasures to stay in the present moment and wants to be part of a creative community?</i></p>\n<p><span><b>Circle Singing London,</b>&nbsp;formed in 2014, is&nbsp;designed to explore&nbsp;creativity&nbsp;through&nbsp;vocal improvisation;&nbsp;regularly collaborating with&nbsp;various&nbsp;music festivals&nbsp;in London&nbsp;and visiting&nbsp;unusual places&nbsp;to explore sound effects and acoustics such as Leake Street Tunnels, Queen Elizabeth Olympic Park's Bridges, the Stepney Green farm, London Bridge's railway arches...</span> <br></p>\n<p>No experience necessary! <br></p>\n<p>Do you love to sing but feel uncertain&nbsp;about your vocal abilities?&nbsp;Are you a professional&nbsp;singer who yearns to explore the possibilities of human voice?&nbsp;...<b>then this project is&nbsp;for YOU</b>.</p>\n<p><b>What to expect?</b></p>\n<p>Circle Singing London is different from a traditional choir. We start with body &amp; breath &amp; voice warm-ups, follow up by an exploration of vocal techniques and a basic improvisation vocabulary. &nbsp;We gradually move from silence, listening, toning, exploring rhythms and &nbsp;the vocal creativity of the group, towards guided vocal sound exercises, sound bathing and circle singing. We learn to trust that everything we need is already here, waiting to be discovered. These sessions are based on principle of integration of each participant.</p>\n<p>Find us on<a href=\"https://soundcloud.com/circlesinginglondon\"> Soundcloud</a><a href=\"https://soundcloud.com/circlesinginglondon/circle-singing-london-12-03\"></a>&nbsp;&amp; <a href=\"https://twitter.com/toCSLondon\">Twitter</a> &amp; <a href=\"https://www.facebook.com/circlesinginglondon\">Facebook</a>&nbsp;&amp; <a href=\"https://www.youtube.com/channel/UClD34h3RQauRHKovhoUKPgQ\">Youtube</a>! <br></p>\n<p><b>OUR WEBSITE:&nbsp;<a href=\"http://circlesinginglondon.wix.com/project#\">here</a>&nbsp;</b></p>\n<p><b>--------------------------------------------------------------------------------------- <br></b></p>\n<p><b> <br></b></p>\n<p><b>VOICE AND YOGA</b></p>\n<p><i>Would like to combine vocal techniques, specific yoga poses, breath-work, poetry, guided meditation and play to invoke creativity and free the body from habitual tensions to discover more authentic and spontaneous vocal expression?</i> <br> <br> We will combine specific yoga positions with contemporary vocal techniques. We uncover tools and exercises that encourage the flow of energy to open our breath and untangle knots in our body, mind and voice. <br> <br> All welcome! The process is applicable to all musicians, singers, actors, storytellers, teachers, yoga practitioners, public speakers, performers and anyone who is interested in authentic vocal expression. <br> <br> *EACH SESSION IS DEVOTED TO A DIFFERENT THEME* <br> <br><b> What to expect?</b> <br> <br> Each session will start with relaxation - to rest your mind, breath and body; follow up with muscles, breath and voice warm-ups. Main part of every session is a sequence of specially designed postures that are accompanied by unique guidelines that support your breathing, sounding and vocal exploration. <br> <br> There is no previous experience necessary. <br> <br> For more info visit our WEBSITE (<a href=\"http://tomovewithvoice.wix.com/london\">http://tomovewithvoice.wix.com/london</a>)&amp; FACEBOOK (<a href=\"https://www.facebook.com/ToMoveWithVoice\">https://www.facebook.com/ToMoveWithVoice</a>)&amp; TWITTER (<a href=\"https://twitter.com/tomovewithvoice\">https://twitter.com/tomovewithvoice</a>)</p>\n<br>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36337578","name":"London guitar jams","link":"https://www.meetup.com/london-guitar-jams","description":"Pupose:\nA guitarists' (mostly) meetup for jamming together socially, maybe some songwriting.\n\nWho should join:\nGuitarists (mostly), vocalists, anyone who loves music\n\nWhat will you do at events:\nMeet, jam (in parks perhaps to keep the events free) together, socialise","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36422421","name":"London International Choir","link":"https://www.meetup.com/meetup-group-fjpjpzrv","description":"We are **London International Choir**, a mixed a cappella choir of about 30 singers.\nOur mission is to unite people of all nationalities with a passion for singing and music.\nOur repertoire is as diverse as our membership – we sing pop, jazz, classical, rap, songs from musicals, medleys and more, in just as many languages.\nWe rehearse weekly in a central London venue with view to end of season performances over summer and winter. \nCome support us for our popular concert shows or look out for taster rehearsal sessions to join us for new season. Find us on Facebook, Instagram and Youtube!\nhttps://londoninternationalchoir.com/","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":true},{"id":"36374454","name":"London Classical Music and Culture","link":"https://www.meetup.com/london-classical-music-culture","description":"Classical Concerts, Opera, Ballet, Contemporary Dance, Theatre/Musical Theatre, Cinema, World Music, Jazz, Art Galleries & Exhibitions, Walks & general socialising.\n\nI live on the South Coast but regularly visit London for work & leisure - and would love to meet like-minded cultural types.\n\nDo visit my other meetup groups to get an idea of previous events I’ve successfully led:\n\n\\- Eastbourne & Brighton Area Culture\\, Social & Outdoors Meetup \\(Organiser\\):\n[https://www.meetup.com/eastbourne-brighton-area-culture-social-outdoors-meetup/](https://www.meetup.com/eastbourne-brighton-area-culture-social-outdoors-meetup/)\n\n\\- South Downs Mid\\-Week Walks Via Public Transport \\(Co\\-Organiser/Event Organiser\\)\n[https://www.meetup.com/south-downs-hiking/](https://www.meetup.com/south-downs-hiking/)\n\n\\- Discovering Sussex \\(just recently taken over as Organiser\\)\n[https://www.meetup.com/discovering-sussex/](https://www.meetup.com/discovering-sussex/)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36433843","name":"London Electronic Dance Music Meetup Group","link":"https://www.meetup.com/london-electronic-dance-music-meetup-group","description":"A place for people from London or anywhere to meetup and enjoy Electronic Music. Does not matter if you come with your friends or alone. Everyone is welcome!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":true},{"id":"36115889","name":"New Music Producers","link":"https://www.meetup.com/meetup-group-hcgikqzo","description":"We're a friendly group of new/early stage music producers who get together for drinks once a month to chat music, music tech and keep each other motivated. All genres & both hobbyists & aspiring professionals welcome, as long as you're actively engaged in music production (eg. production & recording) already. Just FYI, event details & attendance numbers will only become visible if you join since it's a private group.","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"31221932","name":"The Jam Music Meetup","link":"https://www.meetup.com/the-jam-music-meetup","description":"<p>Calling all live music performers looking to jam with other musicians and singers to improve those musical skills! <br> <br>This structured jam looks at blocking out half the session looking at standard songs and working on versions of covers and the second half is creative jamming. Sign up for either or both.&nbsp;</p>\n<p>Challenge yourself by learning<span>&nbsp;new tunes from the song list each month to jam out in the room, or put forward your favourite tunes for others to sign up with, learn and to jam with on the day.</span></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1461584","name":"London Songwriters","link":"https://www.meetup.com/https-www-londonsongwriters-org","description":"Discover the **Songcraft Secrets of Powerful Lyrics & Melodies** at our **Evening Courses, Song Clinics, Countryside Retreats, Song Camps, Performances, Charity Gigs, & Music Industry Talks**. Suitable for Beginners to Pros who want to demystify how to write great songs in any genre!\n\nOur Website URL is: [https://www.LondonSongwriters.org/](http://www.londonsongwriters.org/)\n\nIf you want to learn, practice & perfect your songwriting & consolidate what you already know then this is the group & the community for you. Our mission is to improve our song craft & support each other's self-expression through our shared passion for music!\n\nThe group is organised by Murray Webster, an experienced multi-genre Songwriter, Educator, Songwriting Masters Degree Graduate & Community Music leader - Latest Video, EP & 7\" Single '**[Blue Dansette](https://music.murraywebstersongs.com/releases)'**.\n\nCheck out the interview on London Live TV News about our **Charity concerts and Fundraising for Crisis At Christmas**:\n\nhttps://www.youtube.com/watch?v=q_5SpcETHD8&t=2s","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36372041","name":"Ukulele Club","link":"https://www.meetup.com/ukulele-club","description":"The Ukulele Club is a friendly group open to adults and children that are complete beginners on the Uke. A relaxed environment for those that always wanted to learn the Uke and never managed to stick to it. We break down the stigma that you need to learn music theory to learn how to play. In this class we will learn very basic music theory, just enough for you to understand basic terminologies, so no need to be scared!\n\nLearning in a group has numerous advantages and can give you the support and inspiration you need to get started! These sessions are oriented to absolute beginners, so if you are somewhere between improvers to intermediate level, I am afraid this won't be the session for you or you might get bored.\n\nThis is a high vibration session and our intention is to spread love, kindness and have fun through music! 💚\n\nWhat will we learn?\n\n* Instrument basic care\n* Parts of the instrument\n* Posture and good practices\n* How to tune\n* Basic knowledge of notes and chords\n* First chords\n* First strumming patterns\n* First easy songs\n* And most important... How to vibrate in love together through music! ✨🎼","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36008156","name":"Live Music in Oxford","link":"https://www.meetup.com/live-music-in-oxford","description":"<p>A group for people who enjoy live music in Oxford, be it Open Mic nights, World music, jazz, folk, or anything else.</p><p><br /></p><p>Meet up, have a drink, go to the gig, and enjoy. </p><p><br /></p><p>If you enjoy live music and would like to meet others who do too, then this group is for you.</p><p><br /></p><p>This group will not charge you to join or attend events, but of course, some gigs are ticketed in order to pay the musicians! In this case, none of the ticket money goes to MeetUp or the organiser of this group.</p><p><br /></p><p>This group is independent and is not affiliated with any business or organisation.</p>","city":"Oxford","state":"K2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"381967","name":"The London Rock and Metal Meetup Group","link":"https://www.meetup.com/rock-metal","description":"<p>Meet other local fans of Rock and Metal music to talk about the music scene, go to local gigs, nights out in London's many rock clubs and days out at rock festivals, etc. Up and coming local London bands, feel free to contact me with information and details of gigs and I'll see if we are able to promote.</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"22838743","name":"SAFO Music Group's Networking Night","link":"https://www.meetup.com/music-networking-night","description":"<p>SAFO Music Group hosts monthly Networking Evenings on the first Monday of every month. This is an amazing opportunity for artists and music industry professionals to build their network of contacts as well as learn invaluable industry advice.&nbsp;</p>\n<p>SAFO Music Group HQ is based in Crouch Hill, London and our team have worked with the likes of Sam Smith, Ed Sheeran, Pixie Lott, One Direction, The 1975, Becky Hill, Samantha Harvey, Ella Eyre and many more.&nbsp; <br> <br>Our meet up groups run from 18:00 - 21:00 and entry is completely free. We will also be running a speed listening sessions where artists will be able to play their music to our team to gain some valuable feedback.&nbsp;</p>\n<p>In addition to our 'Networking Evenings', we also host industry masterclasses which are £20 a head. The SMG Masterclasses feature A&amp;R's, Publishers, Managers, Artists, Agents, PR experts and more, providing expert advice to anyone wanting to get into the music industry so keep your eyes peeled for them!</p>\n<p>Check out a little taster of what to expect:</p>\n<p><a href=\"https://youtu.be/1CzfgY78CXQ\">https://youtu.be/1CzfgY78CXQ</a></p>\n<p><br></p>\n<p>We'll look forward to meeting you soon!&nbsp; <br> <br>The SAFO Music Group x&nbsp;</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36384085","name":"North London Vinyl Record Group","link":"https://www.meetup.com/north-london-vinyl","description":"Record Spinning / Listening /Vinyl Group for music vinyl enthusiasts\n\nFocus on Classic Rock , Prog Rock and Jazz Fusion\n\nWe will pick a theme for each meet up such as \"Great Bass playing\" or \"Great drum intros\"\n\nWe may also have focus on instruments such as Hammond Organ , Fretless Bass, Moog Synth etc\n\nPlease bring two albums each meet","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"4149162","name":"The Music Festivals Meetup Group","link":"https://www.meetup.com/the-uk-festivals-meetup-group","description":"<p>This is a group for festival lovers from all over the UK. Our aim is to meetup at various festivals around the UK throughout the year, hang out, have fun and make some new friends! Most of the festivals we'll be visiting will be music festivals (electronic, rock, indie, metal, etc) but we'll definitely organise some trips to other types of festival too and if you'd like to make any suggestions, please do!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18785876","name":"Brighton and Hove Acapella","link":"https://www.meetup.com/brighton-and-hove-acapella","description":"Every Monday irrepressible MC Stephen hosts up to 16 singers in his flat for a joyous evening singing in four part harmony, winding a way through a full repertoire from the 16th century via lyrical lines and toe tapping tunes to the present day. If you can read music proficiently and hold your line, drop us a note and come along for a taster session. ","city":"Hove","state":"E2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"30969706","name":"Female Music Producers Group","link":"https://www.meetup.com/female-music-producers-group","description":"<p>Do you produce music? Are you an artist or songwriter and want to improve your skills and be part of a community that inspires you? Or are you interested in music production and have no idea where to start?&nbsp;</p>\n<p>Then this is the group for you! Please note, everyone (not just female) is welcome and encouraged to join and come to our events!</p>\n<p>The percentage of female producers in the world is outrageously low which for me is hugely disappointing and I would love to see this change. So let's create a supportive community of female musicians who can help each other improve our skills and become better musicians.</p>\n<p>In this meet up you can expect to learn new tips and tricks from fellow producers, artists and songwriters by having a member share a project they are working on and how they have set this up. We will occasionally have talks from engineers and artists in the industry to also provide their expert knowledge. Expect to also meet many other talented artists and walk away with a few collaboration opportunities!</p>\n<p>If you'd like to learn to join our free intro to music production workshops, you can do so here:&nbsp;<a href=\"https://musicproductionforwomen.com/webinar-registration\">https://musicproductionforwomen.com/webinar-registration</a>&nbsp;and if you'd like to join the full course you can do so here:&nbsp;&nbsp;<a href=\"https://musicproductionforwomen.com/free-trial32736265\">https://musicproductionforwomen.com/free-trial32736265</a></p>\n<p>M<span>essage us if you have any questions at all :)</span></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1107449","name":"The London Electronic Music Meetup","link":"https://www.meetup.com/electroniclondon","description":"<p>London is a great place for electronic music. Clear your diary, come and listen to the future of music.</p>\n<p>Electronic music is Minimal, Techno, House, Electro, IDM, Glitch, Experimental, Breakcore, Detroit, Ghetto Tech, Grime, Dancehall, Synthpop, Krautrock, Hardcore. Anything synthesised is fair game.</p>\n<p>We meet, chill, drink, talk and listen to music. We do pick club nights to attend though, which makes things more fun for everybody.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"24230049","name":"London Classical Music & Theatre Group","link":"https://www.meetup.com/london-classical-music-and-theatre","description":"<p>This meetup group is for classical music, theatre and film lovers!! We aim to have meetings about once a week to attend concerts and plays all over London.</p><p>On previous meetups, we went to the Globe Theatre, Royal Festival Hall, Barbican, Wigmore Hall, Bridewell Theatre, Temple Church, Royal Albert Hall, Barbican, British Film Institute...</p><p>If you are interested in attending any of the events, you will have to buy your own ticket. We include the pricing information via website link.</p><p>We will usually meet before each performance to know each other. We may meet again afterwards, to have a little chat (and maybe a drink) about the play or concert.</p><p>Group members are also welcome to post info on concerts they are going to, or organising in Discussions. We are also interested in having additional event organisers.</p><p><br /></p><p>Hope to see you soon, and keep supporting classical music in London!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"26284555","name":"London Tropical House/ Deep House Meetup","link":"https://www.meetup.com/london-tropical-house-deep-house-meetup","description":"<p>Are these some of your favourite DJs?</p><p>Kygo, Robin Schulz, Lost Frequencies, Klingande, Matoma, Sam Feldt, Kungs, Alex Adair, Sigala.. etc.</p><p><br /></p><p>If anyone is unsure what this type of music is check out Spotify playlists provided by 'Melodic Nation' here: <a href=\"https://open.spotify.com/user/mdt8ojwlv7vb77n6s0vg1ffdh?si=gwlq3EbYRIeGPLg6h-qZgg\" target=\"_blank\">https://open.spotify.com/user/mdt8ojwlv7vb77n6s0vg1ffdh?si=gwlq3EbYRIeGPLg6h-qZgg</a></p><p>Great playlists for this type of music!</p><p><br /></p><p>Are you looking for cool friends who have similar taste in music? who can go to the same music event/ festivals like you?</p><p>This is the group for you my tropical house/ deep house fellas! :D</p><p><br /></p><p>We also now have a facebook page which you can join to keep up with the latest in what we are doing: https://www.facebook.com/groups/1518072301625540/?notif_id=1534963908783576&amp;notif_t=group_r2j_approved</p><p><br /></p><p>Also, message one of the organisers if you would like to join the WhatsApp group!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1766420","name":"London African Drumming","link":"https://www.meetup.com/london-african-drumming","description":"<p>Come along and join us for some rocking Djembe Drum fun in London E1 (near Stepney Green &amp; Bethnal Green tube station) with talented drummers leading the sessions.</p>\n<p>Relaxed, friendly, supportive and good feeling vibe. No previous experience needed as suitable for beginners or intermediate. You can't get it wrong!</p>\n<p>We are a 'not for profit' group.&nbsp;Our aim is to promote group rhythm as an uplifting, healing and bonding experience for all.</p>\n<p>Cost £20 inc drum hire</p>\n<p>£5 refunded on day if you bring your own drum.</p>\n<p>2 concession places at £10 available each session.</p>\n<p><span>When you arrive at as</span></p>\n<p>The Vatican Music Studios</p>\n<p>Railway arch 190</p>\n<p>Bancroft Road</p>\n<p>E1 4ET</p>\n<p>(Entrance via P&amp;A Motors garage-turn left and its arch with Gold cross on door)</p>\n<p> <br></p>\n<p><span>Out of respect for the teacher, myself and fellow participants and also for your learning and understanding of the basic techniques taught, it is important to arrive on time. If you miss the beginning it may affect your enjoymen</span><span>t of the learning and the rest of the group’s experience of the session. Our ethos is about working together as a team in a group rhythm so we ask you to be mindful of the part you play in the whole experience.</span></p>\n<p><span>Your voucher/fee includes drum hire and tea/coffee and biscuits!.</span></p>\n<p><span>Health and safety</span></p>\n<p><span>Please remove any rings or hand jewellery to protect you and our drums!</span></p>\n<p><span>It’s thirsty work so please bring a bottle of water with you and layers that you can take off as you warm up.</span></p>\n<p><span>Please note we have a one week cancellation policy.</span></p>\n<p><span>We look forward to drumming with you soon!</span></p>\n<p>Sue</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"6175072","name":"Brighton Electronic (UK)","link":"https://www.meetup.com/brighton-electronic","description":"<p><b>[beep]&nbsp;Brighton Experimental Electronic Party</b></p>\n<p> [beep] is a collective of electronic musicians, enthusiasts and dj's based in an around Brighton &amp; Hove. We have no musical genre agenda, we just love playing live electronic music !! <br></p>\n<p>Since 2013 we've been running a regular&nbsp;cabaret &amp; club night called [beep] usually on the first Saturday of the month in several venues around Brighton, and since 2017 at Speaker's Corner Cafe, and in 2018 at the Bee's Mouth, where we play our stuff live to an ever growing audience. <br></p>\n<p>We also have informal social meet-ups to chat about things, put on gig craft and music making workshops , and make grand plans, unless there's a not to be missed gig elsewhere in town, where we meet up as well. <br></p>\n<p>We have newcomers at every meeting :) Please join us creating and realising our musical dreams ... <br></p>\n<p>Want to play at [beep]? Great! Please register here so we have your details:-</p>\n<p> <a href=\"https://docs.google.com/forms/d/1s5eCOJpA0TMhTGeYH5v87CLm-buqFaX4rlRlhfWqVUg/viewform\">https://docs.google.com/forms/d/1s5eCOJpA0TMhTGeYH5v87CLm-buqFaX4rlRlhfWqVUg/viewform</a></p>\n<p><span>[beep] on Facebook:-</span></p>\n<p><a href=\"https://www.facebook.com/brighton.beep/\">https://www.facebook.com/brighton.beep</a></p>\n<p>[beep] on SoundCloud where you can find archive recordings of our live performances:- </p>\n<p><a href=\"https://soundcloud.com/groups/brightonbeep\">https://soundcloud.com/groups/brightonbeep</a></p>\n<p><a href=\"https://soundcloud.com/beep-stock\" class=\"linkified\">https://soundcloud.com/beep-stock</a> <br></p>\n<p>[beep] on youTube</p>\n<p><a href=\"http://www.youtube.com/user/brightonbeep\">http://www.youtube.com/user/brightonbeep</a></p>\n<br>","city":"Brighton","state":"E2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19324533","name":"The SAFO Music Group Networking Evening","link":"https://www.meetup.com/the-music-industry-networking-evening","description":"<p><span>SAFO Music Group hosts monthly Networking Evenings on the first Monday of every month. This is an amazing opportunity for artists and music industry professionals to listen to each others songs as well as&nbsp; building their network of contacts and learning invaluable industry advice.&nbsp;</span></p>\n<p>SAFO Music Group HQ is based in Crouch Hill, London and our team have worked with the likes of Sam Smith, Ed Sheeran, Pixie Lott, One Direction, The 1975, Becky Hill, Samantha Harvey, Ella Eyre and many more.&nbsp; <br> <br>Our meet up groups run from 18:00 - 20:00 and entry is completely free. We will also be running a speed listening sessions where artists will be able to play their music to our team to gain some valuable feedback.&nbsp;</p>\n<p>In addition to our 'Networking Evenings', we also host industry masterclasses which are £20 a head. The SMG Masterclasses feature A&amp;R's, Publishers, Managers, Artists, Agents, PR experts and more, providing expert advice to anyone wanting to get into the music industry so keep your eyes peeled for them!</p>\n<p>Do check out our video so you get a taste of the evening:</p>\n<p><a href=\"https://youtu.be/1CzfgY78CXQ\">https://youtu.be/1CzfgY78CXQ</a></p>\n<p><span> <br></span></p>\n<p><span>We'll look forward to meeting you soon!&nbsp;</span> <br></p>\n<p> <br>The SAFO Music Group&nbsp; <br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36178745","name":"funk jam!","link":"https://www.meetup.com/funkjam","description":"Do you like your music funky and want to meet and play with other musicians for fun? We meet for relaxed sessions in rehearsal studios, play some tunes and improvise together.\nIf you’re looking to develop or refresh your skills, these sessions just need you to have a willingness to listen to others and the ability to play as part of a band. Each session is unique, with different combinations of funk jam! members. Join us.\n\n**WHAT TO EXPECT**\nWe focus on playing and jamming with a selection of funk tunes, starting from the original recordings' structures but play around with arrangements and create space for improvising and ideas, making them into something of our own.\n\nWe play mostly by ear. Each person who signs up to come can nominate one tune/song and add that to a list so everybody can check out the tunes beforehand. Depending on time and interest, we might do some looser improvising or develop ideas for original material.\n\n**STUDIO PRACTICALITIES**\nEach session has a limit to attendees due to studio size and equipment. The studio will have a full-range PA (can handle vocals and things with lots of bottom end like synths), mixer, guitar and bass amps, microphones and a drum kit with cymbals. You just need to bring your instrument and any accessories (cables, drumsticks, lyrics, etc) that you need.\nThe cost per session covers three hours' studio hire, backline and running the group (Organiser fees charged by Meetup).\n\nDo get in touch or leave a comment if you have any questions, thoughts or ideas. Look forward to playing some funk with you soon!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18959784","name":"Music Friends Meetup","link":"https://www.meetup.com/music-friends-meetup","description":"<p>A Meetup for folks interested in popular music focusing on rock, folk &amp; blues. We go to festivals, live gigs and open mics. We host several open mic clubs. We want to attract intelligent and sociable people mostly in their 30s, 40s and 50s (but older and younger folks are welcome too). Members are welcome to give us ideas for events. We work closely with our parent club - London IVC. We share some events with friends in East London, North London, North West London and Greenwich &amp; Lewisham Meet Your Neighbour Meetup groups.</p>\n<p>We want to involve our members in organising our programme. If you have any ideas for events let us know.</p>\n<p>We prefer members to post their real name and a photo so that we can recognise you at events.</p>London IVC \n<a href=\"http://www.londonivc.com\">www.londonivc.com</a> is our parent club - London's oldest and best social and activities club.\n<br>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"35471935","name":"Shanty Singers Colliers Wood","link":"https://www.meetup.com/shanty-singers-colliers-wood","description":"Anyone who is of a participatory nature may join, one doesn't need a good voice, just enthusiasm. We sing about eighteen shanty songs each evening, and rotate them and add songs every week , so it doesn't get stale . The meetings are held in the Sultan pub in winter, and in my garden in summer. We light a small barbeque, cook sausages and sea biscuits, and drink rum, wine and beer, which are bought and brought by our members. Our dress code is casual naval.\nWe have an on line practice page of sound recordings of the songs, written scores and lyrics, so members can easily practice and become familiar with the choruses before they visit, if they want to, so it's easier for them to join in.\nWe have a professional leader, who coaches our singing, encourages harmonies, and accompanies our songs with an accordion or violin\nThis group only started in May 2021, and numbers are small.\nThe Sultan pub is ten minutes walk from South Wimbledon or Colliers Wood tube station and we meet every Monday at 6.15pm, start singing at 6.30pm, and pack up around 9 pm or later","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"1594985","name":"The London Hip Hop Meetup Group","link":"https://www.meetup.com/hiphopldn","description":"<p>Anyone passionate about good hip hop and live shows is welcome! Connect with other heads who want to attend gigs and events, explore the London rap music scene, discuss and share music, it would be nice to have a hip hop pub quiz team too.. but mainly it’s about attending shows/events.</p>\n<p><span>I started this group because I wanted company to go to gigs with and thought there might be people out there that felt the same way, I'd seen a Yahoo group similar to this but it wasn't around when I wanted to join and when I signed up to meetup I had missed the previous incarnation of the hip hop meetup, nothing was available so I started this group..</span> <br></p>\n<p>If you love Hip Hop and want to build, network, make friends, dance or just hang with like-minded heads, get involved! <br></p>\n<br>\n<p><span> <br></span></p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"3087022","name":"London Music Producers","link":"https://www.meetup.com/london-music-producers","description":"<p><b><span>This is a group for music producers to network on new production, exchange ideas and collaborate, listen to tracks, talk about business, etc.</span><span> Anyone with a dedicated interest in music production is welcome to join. It does not matter if you are a laptop warrior or have an SSL in your basement, as long as you have a passion for production. Producers of any genre are welcome - electronic, hip hop, pop, rock, etc, as long as they are open minded. We all can learn from each other. We also target both producers in the classic sense - the facilitators of the creative process for artists, and producers who create their own tracks.</span><br></b></p>\n<p><b>Musicians, singers, rappers who are looking to collaborate are also very welcome to join.</b></p>\n<p><br></p>\n<p>Check out our Facebook group as well:&nbsp;<a href=\"https://www.facebook.com/groups/340702712615281/\">https://www.facebook.com/groups/340702712615281/</a></p>\n<br>\n<br>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"31250227","name":"Bubblebath Open Mic Night","link":"https://www.meetup.com/bubblebath-open-mic-night","description":"<p>Welcome to Bubblebath, a showcase of London's finest raw and naked talent held on the first Tuesday of every month at the Fiddler's Elbow in Camden.</p><p><br /></p><p>This experimental open mic night welcomes everyone and every variety of performance art into its bubbling melting pot of creativity. Whatever your calling - musician, comedian, poet, artist, spectator - we want you, and we invite you to leave behind the mania of London's streets and to step across the threshold in this safe, creative space.</p><p><br /></p><p>The night will be social: there will be breaks every few acts to reflect / chat / mingle, and all attendees and performers will be part of collectively crafting the night into whatever form it takes.</p><p>If you are keen to take to the stage, sign up is at 7pm on a first come first serve basis. Alternatively, you can email bubblebathopenmic@gmail.com to book one of the limited number of advance slots. Performers have an 8 minute/2 song slot each. </p><p><br /></p><p>The performances  begin at 7.30pm and the running order will be selected out of a hat. We kindly request that all performers and friends stay for the entirety of the evening to give every act the support they deserve.</p><p><br /></p><p>The night is pay what you will - our running costs are those of the sound engineer and promotional material - so please do bring cash / change and donate what you feel watching the acts is worth. Any extra earnt will be fed back into the night.</p><p><br /></p><p>And remember, if you like bubbles and baths, you'll love Bubblebath.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35769176","name":"London Jazz Choir Meetup Group","link":"https://www.meetup.com/london-jazz-choir-meetup-group","description":"Social singers get together. If you enjoy jazz, blues, soul, want to meet new people with a shared interest and basically just love to sing, come and join us at Jazz Choirs. It’s open, inclusive, you don’t need to read music and it’s non-audition. Come along for a free taster session either in person or on Zoom.\nHere's a link to our website:\nwww.jazzchoirs.co.uk\nWe rehearse on Tuesday evenings with our MD Ben Cox and jazz pianist Jonathan Taylor at the North London Tavern on Kilburn High Road. Come along, grab a pint, G&T or coffee and sing through Earth Wind and Fire, Sinatra, Miles Davies, Tony Bennett, Stevie Wonder, Carol King, Tears For Fears, Mark Murphy hits.\nA group of us got together in 2019 and formed Jazz Choirs. Our first concert was a triumph. We hired a three-piece band and had an amazing evening. Then came covid. Like everyone, we’ve had to adapt and have been rehearsing on Zoom since the first lockdown. Although socially restricted, we’ve made three videos, performed in three online choir concerts and helped raise in the region of £3,000 for charities.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"34625398","name":"London Arab Jam Sessions","link":"https://www.meetup.com/arabjam","description":"Salam!\n\nThis group is for London-based musicians, producers, performers, singers and songwriters - with a deep rooted passion for Arab music - to come together and JAM! All experience levels, instruments, styles and tastes are welcome into our sessions :)\n\nWe will revive old classics, remake popular songs, explore musical traditions and music theory across different Arab regions, try new ideas, make mistakes without worry, groove and solo, share feedback with like-minded musicians, grow a network, and perhaps carry out some studio produciton or live performances. Our end goal is to enjoy the process of improvisation to its fullest!\n\nEach event will have a set theme posted in advance; this may be of a specific Arab artist, genre, era, region, song list, or idea. Until we have a permanent space, we will meet according to venue availability; this may be in a rehearsal studio, a theatre, a basement, a private premise, or a park. Wherever though, we aim to ensure a free, relaxed and welcoming atmosphere for all.\n\nOur meetup group is considerably new, independent, volunteer-led, and would benefit from co-organisers and collaborators. So if you have a vision for any particular aspect of this group, instruments to share or trade, links to suitable venues in London, or any suggestion, do get in touch!\n\nKeep jamming :)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35981687","name":"London World Music Lovers","link":"https://www.meetup.com/london-world-music-lovers","description":"<p>Do you love traditional music from different parts of the world? Or its blend with Jazz, Electro or Classical music? Do you love instruments like the African kora, the Middle Eastern oud, the Japanese shakuhachi, the Korean gayageum (to name a few), or the UNESCO recognised polyphonic singing from Georgia?</p><p>&nbsp;</p><p>You're not<strong>&nbsp;</strong>alone! So why attend World Music concerts alone, when you could do so with your fellow London World Music lovers!</p><p>&nbsp;</p><p>Browse through the list of upcoming events and join us, your fellow enthusiasts!</p><p>&nbsp;</p><p>If you see a concert coming up that interests you, please post a link on the group discussions page at https://www.meetup.com/london-world-music-lovers/discussions. Are you interested in suggesting and hosting events regularly? Contact one of the group administrators, and we will see how we can facilitate this.</p><p>&nbsp;</p><p>And if you also like Baroque music – check out our sister group London Baroque Music Lovers at&nbsp;<a href=\"https://www.meetup.com/London-Baroque-Music-Lovers\" target=\"_blank\">https://www.meetup.com/London-Baroque-Music-Lovers</a></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"21586832","name":"Reading Music Meetup","link":"https://www.meetup.com/reading-music-meetup","description":"Calling all musicians!\nThis meetup is a chance for local musicians who are or aren't currently practicing to come together and 'geek out' on music stuff! I'm not aiming to focus on gigs and attending concerts (but of course, we can do that too), but more to provide an opportunity to meet musicians and start your own practice sessions, bands and even performance groups.\nPlease feel free to post live music events in case anyone wants to attend with you and of course, let us know if you're playing anywhere so we can come and cheer you on.\n\nI do, however ask that members only join this meetup group if they are interested in actively taking part in live music sessions. The studio sessions which we arrange are in rooms too small to accommodate guests or those only wishing to watch, so it will probably not be suitable for those not wishing to participate.\n\nMany thanks for your interest, hopefully we will see you at an event soon!\n\nPaul","city":"Reading","state":"03","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"35717419","name":"London House Music Meetup","link":"https://www.meetup.com/meetup-group-vpfcrtjo","description":"<p>You should join if you like House Music and going to gigs. Meetups in the group will consist of going to gigs, for both big names and grass roots.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18377697","name":"London Sings! Choir","link":"https://www.meetup.com/london-sings-choir","description":"<p>Always wanted to sing but worried about performing in public? Looking for a group to help coach and support your singing at all levels...? Want to learn more about music technique and sight singing while having fun at the same time? Then London Sings! is the group for you. London Sings! is a no audition local community choir which is big in personality and looking to grow. We cater both for experienced singers and those fairly new to singing, with plenty of opportunities for interesting performances. We are even planning a trip to Madrid once things are a little more normal! We sing a wide variety of pieces ranging from jazz and musical theatre to classical, and from unison through to four part harmony, while having a lot of fun in the process. </p><p><br /></p><p>We rehearse every Monday evening from 7.30pm to 9.30pm at Mostyn Road Methodist Church, Mostyn Rd, SW9 6PH (near junction with Lawrence Way) and always welcome new members, whatever your level of experience. You are welcome to try us out for a few sessions at no charge while deciding whether you want to become a member. If you do join us, fees are a very reasonable £15 a month. We are a very sociable bunch, so usually go to the pub after rehearsals for a good chat and we also organise various social events. </p><p><br /></p><p>Please do not hesitate to contact us on chair@londonsings.org.uk or by telephone on 07785 905355 More information on who we are can be found on http://www.londonsings.org.uk/ Looking forward to seeing you...</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18408311","name":"LONDON LIVE BLACK MUSIC GIGS & CONCERTS MEETUP","link":"https://www.meetup.com/london-live-black-music-gigs-concert-meetup","description":"<p>A group for people who want to attend great Soul/RnB/Neo Soul, Hip Hop, Reggae, Jazz music gigs/concerts in London featuring current, mainstream and independent bands within diverse venues in London. Ideal place to meet concert buddies ever wanted to go to gig or a concert and you had no one to go with or someone let you down when you bought them a ticket. Then this is the site for you to make new gig buddies to share in a concert and gig experience.&nbsp;</p>\n<p>I would like all members to socialise with one another about gigs/concerts and music in general. I will meet and greet some events and other event will be non-hosted event, however, I will arrange a meeting point and time at each gig for those who wish to meet up and meet like minded gig lovers! Those who just wish to enjoy the music with their guest/s are more than welcome to get on and do their own thing! <br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"20053561","name":"Brighton Pianists Meetup","link":"https://www.meetup.com/brighton-pianists-meetup","description":"Come and enjoy an afternoon of music with us. Share you piano playing and hear ours in a non judgemental informal environment. The idea is to provide a space for people to both perform and listen, especially to encourage those who are nervous about public performance. There is no critique or teaching element to this. Everyone plays and therefore everyone goes through the same shared nerves.\nWe have players of all grades from around grade 3 to post grade 8. They play a huge variety of styles from classical to Jazz. We have had flute and piano duets and even pianist singing along. Though primarily we are about piano.\nThe Brighton Pianists Meetup Group operates as an unincorporated association, meaning it is not a company.  Consequently, the Brighton Pianists Meetup Group has no legal identity other than that of its members.  This means that members are personally responsible for any liabilities (debts and obligations) that arise. Members pay an annual subscription (around £10) to cover group administration costs. \nThe constitution of the unincorporated association can be found [here](https://docs.google.com/document/d/1WAUXqkqzv8orPxmFn8L8abrFvGXEBK0umBucX89JhLQ/edit?usp=sharing).\nNew members are welcome to come along to one of our regular events. Though you will be asked to pay for the event we won't ask you to subscribe to the association until after you have joined us for your first meetup.\nDue to the unincorporated association status we only operate within the UK and do not accept members resident outside of the UK.","city":"Brighton","state":"P6","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36080655","name":"Reading African Djembe and hand drumming with Tankata.","link":"https://www.meetup.com/tankata-african-djembe-and-hand-drumming-group","description":"Meeting every Wednesday evening Tankata Percussion is a friendly hand drumming group based at Readipop in Reading. Everyone is welcome.\n\nThe lesson is 2 hours long every Wednesday From 7pm-9pm with the chance to stay later for a more advanced session if there is enough of us. The cost is £10 for the main session.\n\nFocusing on mainly African Rhythms and adapting them we mainly play Djembe, Dunun, Congas, Bongos and shakers etc.\n\nEvery Rhythm we learn has parts suitable for beginners right the way up to advanced drummers so everyone is welcome.\n\nIf you're a beginner you can turn up 15 mins earlier and I'll go over the basics.\n\nIf you don't have your own instrument we have plenty we can provide here at the studio.\n\nWe have regular opportunities to perform and jam being part of the wonderful music charity that is Readipop with highlights being our annual performance at the Readipop Festival, our end of year Hootenanny and numerous woodland drum circles all of which is free to attend.\n\nReadipop Studios are a lively place with multiple music groups running simultaneously so a great place to socialise if you're interested please do come along or drop me a message.\n\nMany thanks.","city":"Reading","state":"03","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"30384063","name":"North London House Concerts","link":"https://www.meetup.com/north-london-house-concerts","description":"<p>The group is for people who enjoy hearing live classical music played by professional musicians in an intimate setting. Our first concert was in February 2018 and, prior to the lockdown in April 2020, we had been running concerts on an approximately monthly basis.</p><p><br /></p><p>We are excited to be able to return to staging live performances.</p><p>We pride ourselves on creating a convivial atmosphere in which we present varied, themed programs. The artists and audience retain traditional roles for the ‘salon' performance, in that there is applause and the normal rituals of a concert, but we strive to create a welcoming, informal mood around that. We serve complimentary drinks and canapés from 7.30. We usually try to theme the food with the music. (We always have vegetarian/vegan options.) The conversation usually carries on post-concert over wine and nibbles.</p><p><br /></p><p>The concerts start at 8.00 and generally last between 50 minutes and an hour. (Longer programmes may have an interval). Each concert has a distinct theme drawing on different European regions and traditions, which the musicians usually reflect upon during their performances.</p><p><br /></p><p><strong>Regular attendees please note that we have made some changes to our concert arrangements.</strong></p><p><br /></p><p>We want people to feel safe and secure at our concerts. In the interests of transparency we (that is Gina and Tim) are both double vaccinated. Neither of us have contracted COVID (to the best of our knowledge.) We think it is appropriate that people coming to our home have this information.</p><p><br /></p><p>However, we do not want to make any rules that impact on other people’s freedom and will not expect or request similar transparency from our audience. (No vaccination passports required here!)</p><p><br /></p><p>That said we hope that the following represent sensible arrangements:</p><p><br /></p><p>We will have hand sanitiser (fragranced!) available for anyone who would like to use it on entry (but it is absolutely not compulsory).</p><p><br /></p><p>We do not require that people wear masks, but if you feel more comfortable wearing one that’s absolutely fine. All we ask is that everyone shows respect for other people’s preferences.</p><p><br /></p><p>We will ensure that the concert area is ventilated. As ever people are welcome to use our garden to eat, drink and chat. The weather can’t be guaranteed but we do have a large garden umbrella that will be available on concert evenings.</p><p><br /></p><p>We will operate a maximum attendance of 18. (In the past we have often accommodated up to 25 people at our concerts – on one occasion we had 30 people!)</p><p><br /></p><p>You may book a place for yourself and guest(s) but please make sure you RSVP through the meet-up site.</p><p><br /></p><p>When we reach 18 confirmed places we will add people to a waiting list.</p><p><br /></p><p>Given the reduced attendance we would ask that if you book, but cannot attend, you let us know as soon as possible so that we can offer the place to someone on our waiting list.</p><p><br /></p><p><strong>Price:</strong></p><p><br /></p><p>The events have never been ticketed and in the past we have invited guests to make a £20 donation. Lockdown has been very difficult for gigging musicians and so we have decided to increase the cost to £25 and to make this an entry fee payable at the door. The cost includes complimentary wine and food.</p><p>We think that figure represents good value for the evening we provide. It also gives our musicians a reasonable fee for their performance (not forgetting their preparation and rehearsal time) and helps keep music ‘live’ during what has been an extraordinary difficult period for gigging musicians. (Please note that all of our musicians are professional and&nbsp;earn their living from live performance.)</p><p><br /></p><p><strong>Are you a musician interested in performing? </strong></p><p><strong> </strong></p><p>We always welcome enquiries from musicians who would like to perform. Please contact Gina directly ( londongina@yahoo.co.uk ) if you would like to discuss performing at a future event.</p><p><br /></p><p><strong>The Venue and how to find us: </strong></p><p>All house concerts are al: 51 Langham Road, London, N15 3LR</p><p><br /></p><p>We are an easy 5 minute walk from TurnpIke Lane tube / bus station (Piccadilly Line) and bus routes along nearly West Green Road. Alternatively free street parking is always easy to find directly outside on Langham Road.</p><p><br /></p><p>We also occasionally run concerts at local church venues. Indeed during lockdown we were able to run several ‘socially distanced’ church concerts. These events will be posted on the site from time to time alongside the house concerts.</p><p><br /></p><p>We look forward to meeting you at one of our concerts very soon.</p><p><br /></p><p>Gina &amp; Tim&nbsp;</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"473853","name":"The World Music Meetup","link":"https://www.meetup.com/worldmusicmeetup","description":"<p><strong>Please note that this group has No Show policy. If you fail to turn to 2 events you'll be banned from the group.</strong></p><p>\"The truest expression of a people is in its dances and in its music\"</p><p>From traditional ethnic music to foreign language pop music, the phrase \"World Music\" covers a lot of ground. From Reggae to Ragas, Celtic to Klezmer, Salsa to Paris Cafe, world music pretty much encompasses everything that doesn't fit comfortably into an typical 'Top 40' pop chart.</p><p>All in all, world music is considered just plain music to the vast majority of people in the world. Music is universal, and to discover the music of a culture is to discover the culture as a whole.</p><p>---</p><p>This group is primarily for fans of world music to get together and enjoy concerts, performances and other music-related events in and around London. Musicians / artists / performers are also welcome to promote their work, share resources, etc. via the message board / group profile.</p><p>If you have any queries, comments or suggestions relating to the group feel free to post to the message board or at the following link: <a href=\"http://www.meetup.com/WorldMusicMeetup/calendar/suggest/\" target=\"_blank\">http://www.meetup.com/WorldMusicMeetup/calendar/suggest/</a></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36155628","name":"Brighton Acoustic Music Meetup Jam","link":"https://www.meetup.com/brighton-acoustic-music-meetup-jam","description":"A fun acoustic jam welcoming players and singers of all levels of experience and ages for Meetups playing covers. We will play three songs each session with song choices suggested by the people who are signed up for the jam, these will get chosen if there is someone willing to sing the suggested song so Bohemian Rhapsody probably wouldn't make the cut! We will practice each song a couple of times then go for a live recording. The recording will be posted after the meetup to Dropbox for downloads. \n\nLink to previous recordings - [https://www.dropbox.com/sh/yborl2m26rbskch/AAClaLU2AIsch__JTHVlGdoza?dl=0](https://www.dropbox.com/sh/yborl2m26rbskch/AAClaLU2AIsch__JTHVlGdoza?dl=0)\n\nAll acoustic instruments although portable keyboards and bass can be amplified there will be an amp to plug into for these. The jam will happen on Tuesday nights at 7 for a couple of hours. We'll have a cup of tea and playback what we have done at the end of the session. If anybody wants to bring a beer or two along that's fine.\n\nThe room we play in has enough space for 6 people and the spaces are on a first come first served basis. If you book and don't come along it deprives someone else of a space so it would really good if you didn't do that!\n\nThese Meetups are about having fun and we don't want to get to hung up on getting everything perfect, it is just a good opportunity to play with other people! Each person who comes along will be asked to pay an optional £3 this is to contribute to the Meetup fees.\n\n\\* It goes without saying if you have any Covid symptoms don't come!","city":"Brighton","state":"P6","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"8679402","name":"Brazilian Samba Reggae Drumming Workshops","link":"https://www.meetup.com/samba-reggae","description":"<p>Come and learn the grooves which make Bahia swing with our Brazilian drumming sensation, Marcos Santana!</p>\n<p>Open to all interested in culture who want to learn how to play Samba Reggae instruments and who like to meet other people through music and dance.</p>\n<p>Join us in preparation for performing together with students from across Europe in carnivals and events, including Notting Hill and Salvador Carnival!</p>\n<p>For more info, make sure you check our our homepage here: <a href=\"http://www.triboband.com\">www.triboband.com</a></p>\n<p>And to see a video of us playing, take a look here: <a href=\"http://www.youtube.com/watch?v=IVEQuJETpH8\">www.youtube.com/watch?v=IVEQuJETpH8</a></p>\n<p><img src=\"http://photos4.meetupstatic.com/photos/event/3/4/8/2/event_241693442.jpeg\" style=\"max-height : 700px ; max-width : 700px ; display : block ; margin : 0px auto\"></p>\n<p style=\"text-align : center\">As featured in Time Out's \"1000 things to do in London for under £10\":</p>\n<p style=\"text-align : center\"><img src=\"http://photos1.meetupstatic.com/photos/event/7/f/8/c/event_243632652.jpeg\" style=\"max-height : 700px ; max-width : 700px ; margin : 5px\"></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18797275","name":"Play That Country Music!","link":"https://www.meetup.com/playthatcountrymusic","description":"<p>This group is for anyone who has a passion for country music. It's an opportunity to hang out and connect with like-minded people, including fans, musicians, and songwriters alike. </p>\n<p>The group is created to serve and support country music community, including both classic and modern country music. </p>\n<p>Play That Country Music will be the central hub for information for themed nights, gigs, social events, talks and news. </p>\n<p>The group is open to everyone who is proud in saying - I love Country!!</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"25368680","name":"London Old Skool House, Garage, Techno & Electronica Meetup","link":"https://www.meetup.com/meetup-group-nemslqzc","description":"<p>For Old Skool House, Garage, Techno and electronic music lovers and appreciators. Looking to meet like minded music fans from around central London and the surrounding Greater London suburban areas.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19524045","name":"London Singer-songwriters","link":"https://www.meetup.com/meetup-group-dyzqzjvm","description":"<p>We are a creative community of London based Singer-songwriters from beginner to professional level. We share music and learn from each other. We provide an encouraging and respectful space to grow. We are about celebrating what we love... music.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"25353209","name":"Harmonies of the Heart - Community Singing Group","link":"https://www.meetup.com/harmonies-of-the-heart-community-singing-group","description":"This group will be an opportunity to gather, open the heart and awaken the soul by sharing songs, our experiences, our journeys and light refreshments.\nWe will sing songs from many traditions around the world to connect us to our hearts and each other.\nNo singing experience needed. All songs will be taught by ear.\nMore information on the website www.harmoniesoftheheart.org.uk ","city":"Chorleywood","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18484603","name":"Institute of Rhythm & Blues","link":"https://www.meetup.com/institute-of-rhythm-blues","description":"<p>Get together with other musicians and singers to learn and play R&amp;B, Soul and Funk classics and rare grooves. Gain musical knowledge and skills through studying the music you have always loved.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"9261912","name":"Singers & Creatives London","link":"https://www.meetup.com/london-singers-creatives","description":"<p>London Singers &amp; Creatives have regular meet-ups of different kinds in East London: Soul Choir. Singing Courses. Vocal workshops. Songwriters night. Vocal lessons<br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"32444427","name":"Girls Like Techno Too (#GLTT)","link":"https://www.meetup.com/girls-like-techno-too","description":"**FEMALE GROUP ONLY:**\n(sorry boys, requests to join will be denied)\n\n**WHAT WE ARE ABOUT:**\nIf you are a woman and love techno then this group is for you.\n\n**HOW IT WORKS:**\nWe post two types of events: “**HOSTED**” MeetUps and “**UNHOSTED**” MeetUps\n\n**HOSTED MeetUps** are events run by Zoe and Liz and will usually include organised pre-drinks where you can get to know the group before going into the club. We will have a Whatsapp group chat for each event and you can guarantee either Zoe or Liz will be there to meet you. We also arrange a meeting point in each club so that you can wander off and dance etc and still be able to find us. \n\n**UNHOSTED** MeetUps will not have an \"official\" host. We will post the event, create a Whatsapp group and give you tips and information about each event where we can.  The groups will usually include women who have been to a Hosted Meet up before and will be happy to connect with you at the gig.  \n\n**UNHOSTED** MeetUps will be posted from general interest but Liz and Zoe will not be attending.   We have found that the wonderful techno loving women in this group have been very reliable and great fun, but for the UNHOSTED MeetUps there is a risk with of who you will be connected with and we give no guarantees to their behaviour or even attendance. \n\n**NEW MEMBERS’ DRINKS:** \nNew Members' drinks will run every few months and for those of you who would like to get to know us with the volume of music a little lower than usual. Hosted by Zoe and Liz, Locations change each time. \n\n**A WORD ABOUT BOYS:**\nPre-drinks are female only. This gives us girls a chance to chat and get to know each other, and hopefully encourages those who are perhaps a bit shy to come along. We can meet the boys in the club later. We have had many ladies comment that they like the nature of this set-up and we feel this is the best compromise for all.\n\n**COMMUNITY:**\nOnce you have been to an event and have met Zoe or Liz in person, we invite you to join the GLTT chat. This is to keep in touch about upcoming events etc. We must meet you in person before adding you to this chat, as we feel it keeps the personal touch helps build the community and create a safe space.\n\nWe have also created a variety of other groups for common interests that we have found along the way such as House and Trance, Networking, Culture and Food related events.  \n\n**JOIN US!**\nWe hope to meet you soon. If you have any questions or concerns at all - feel free to get in touch with the organisers and we will do our best to answer your queries.\n\nLove Zoe and Liz X\n\nPS: You can also find us on social media - Insta and FB @girliketechnotoo","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"23421377","name":"Surrey and South London Rhythm and Blues Club","link":"https://www.meetup.com/surreyrhythmandblues","description":"We are a group dedicated to a shared passion for live performance of Rhythm & Blues and related music. \nWe currently run a monthly live music night (usually the 3rd Friday) at Soper Hall in Caterham. Moving forward we may look to establish presence at other venues in the Surrey/S. London area, where club members can meet, socialise and watch live music. \nThe club has been running the live music nights at Soper Hall for a year now. We have established a reputation for running a super-friendly and inclusive club. Newcomers and solo visitors are extended a warm welcome (as indeed are our regulars). We have a good mix of audience members who like get up and dance and those who like to sit and listen. The hall is a great, atmospheric, intimate venue. There is a fully licensed bar. \nWe operate on a not-for-profit basis, with the lion's share of any \"door money\" being used to pay performers. We are also committed to keeping our ticket price as affordable as possible. \nA broad use of the label \"Rhythm & Blues\" applies here. Lovers, aficionados, performers of anything from classic 50's R&B, through to blues, beat, soul, jazz and funk etc. are all welcome here - and we will try our best to cater to that breadth of tastes. \nWe are particularly keen to hear from anyone who wants to help make regular live music at the club an ongoing concern. That includes bands and artists, potential venues, people who know of potential venues and volunteers to help run the club etc.\nAlso see our Facebook page: [https://www.facebook.com/groups/surreyrhyth...](https://www.facebook.com/groups/surreyrhythmandblues/)","city":"Whyteleafe","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"20942747","name":"Electric Dreams (electronic 80s / alternative 80s) Meetup","link":"https://www.meetup.com/electric-dreams","description":"<p>Anyone who is into electronic music should join our music group. We have regular club meetups in London where they play the very best of the electronic eighties up to the present day.</p><p><br /></p><p>Meet like minded appreciators of electronic music and dance the night away to classic tunes from the likes of Depeche Mode, The Human League, Goldfrapp, Ladytron, The Pet Shop Boys, Ultravox, Little Boots, Visage, Chvrches, The Cure and Simple Minds.</p><p><br /></p><p>Parties are hosted at The Cannick Tapps in Cannon Street.</p><p>More info at : www.facebook.com/groups/electricd</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"24704373","name":"SingSong Club","link":"https://www.meetup.com/singsongclub","description":"<p>We host a 21st century version of the traditional pub sing-song. Not only do we invite you to sing along but we also welcome you to join in with your acoustic guitars, ukuleles, shakers etc. (All instruments must be unplugged- please note however that the guide house band will be plugged in). Lyrics and chords are projected onto a screen so that everyone can follow along. Led by the mini SingSong Club band we play our way through the greatest songs ever written in their full formats, complete with key changes, solos, intros, bridges, etc. Expect to play side A of the Sgt Pepper album, Bohemian Rhapsody, 1999, Good Vibrations, Thriller, Space Oddity, My Girl etc or pick a song from our ever expanding list of over 200 songs. SingSong Club has been running since Dec 2015 and we have built up a great circle of friends and musicians. We have brought the event to meetup.com with the aim of building on this ever-growing community of like minded, music-loving, good-time folk.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36174672","name":"South Croydon Drum Circle Meetup Group","link":"https://www.meetup.com/croydon-drum-circle","description":"Are you looking for a local activity to socialise and learn new musical skills?\n\nJoin our weekly **African drum classes** where you will learn how to play the djembe: a traditional drum from West Africa. The class is delivered on **Thursdays** in **St** **Augustine's Centre, CR2 6BA**, South Croydon.\n\nChoose the slot that works best for you:\n6pm - 7pm or 7.30pm - 8.30pm.\n\nYou will learn the basics of playing drums: rhythm, beat, sound quality, and how to improvise. We welcome beginners.\n\nDrums are provided but if you have one at home, you can bring it!","city":"South Croydon","state":"N7","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"12819232","name":"Ederlezi: Balkan Music in London","link":"https://www.meetup.com/ederlezi","description":"<p>This meetup is for anyone who wants to participate in or to attend Balkan, Romani, Klezmer and general East and South European music events in London.</p>\n<p>The group is now under new management. Hi everyone, I'm Sarah Montague (Sarah Sljivovica on Facebook), I'm a music teacher and performer specialising in Balkan and Romani music. I am the conductor and musical director of the London Gypsy Orchestra as well as the leader of Balkan band shunTA!&nbsp;</p>\n<p>&nbsp;I hope you will join us in attending a variety of events including jam sessions, folk festivals, workshops and of course gigs!</p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"35904986","name":"African Drumming Group","link":"https://www.meetup.com/african-drumming-group","description":"<p>We meet weekly in Bethnal Green to learn West African drumming (Djembe, Dundun) and traditional African songs.</p><p><br /></p><p>The drumming teacher is from Burkina Faso and plays professionally with the Balimaya Project and Bantu Arts.</p><p><br /></p><p>Beginners are always very welcome.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"28036284","name":"Singing For Beginners - Learn the Basics!","link":"https://www.meetup.com/learnthebasicsofsinging","description":"<p>Hi there! </p>\n<p>Have you always wanted to give singing a try, but never really knew where to start? Look no further, as I would love to join you on your journey to becoming a skilled and confident singer. </p>\n<p>Singing is so much fun, but at the same time it can be quite daunting! Every single voice is unique and has its own sound. Every singer has to understand their vocal abilities and has to tackle different difficulties. Exactly for that reason, I love helping others discover their voice.</p>\n<p>I organise a few different classes, ranging from bigger 'choir' workshop where we sing together in group (although a bit more challenging these days as we are all singing together from our own homes, but it still seems to work!) and individual sessions tailored to your voice to music quizzes and social 'coffee' catch ups.</p>\n<p>If this sounds like fun and you would like to learn the basics &amp; get a better understanding of your own voice, then join me and let's help each other to become better singers!</p>","city":"London","state":"","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18663324","name":"London Live Music","link":"https://www.meetup.com/livemusiclondon","description":"<p>This is a group for Live Music lovers who love going to the best live music. We also have virtual tours tours and different events online and in person. We pride ourselves in choosing to host some of the best events in London and surrounding Counties for Festivals, Gigs and other great Music Events! We want to create solid relationships with like minded people.. so share your thoughts and enjoy these social occasions!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36318979","name":"Let’s Sing Community Choir (Peckham)","link":"https://www.meetup.com/let-s-sing-peckham","description":"Hey, thanks for stopping by!!\nThis group is for those who are enthusiastic about singing whether in the shower, at karaoke or at the top of their lungs in the car! Come and join this new and exciting community choir with like-minded people who also love singing. There are so many benefits to group singing and it's scientifically proven that it does us good! We will meet weekly to sing in person mostly gospel songs with some classic well-known tunes thrown in for good measure. You don't have to be religious, just a passion for singing is all that's required. This is for any and everyone!\nNo audition needed neither any past experience required, as long as you can hold a note, a warm welcome awaits!\nHope to see you soon!!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"23321885","name":"Baque de Axé Afro-Brazilian Drumming and Percussion","link":"https://www.meetup.com/brazilian-maracatu-drumming-and-percussion-group","description":"<p>Baque de Axé are a London based band playing traditional Maracatu Carnival percussion music from Recife in Pernambuco, Brazil. Affiliated with one of the oldest surviving Maracatu bands, Nação do Maracatu Porto Rico, <a href=\"https://www.baquedeaxe.com/events\" target=\"_blank\">we play in concert halls and clubs, parade in street carnivals, perform at private events</a>, <a href=\"https://www.baquedeaxe.com/teaching\" target=\"_blank\">teach workshops and classes in percussion and dance</a>.</p><p>We play a style of Maracatu called ‘Maracatu de Baque Virado’ Portuguese for ‘Maracatu of the turning beat', reflecting the syncopation and interaction of the beats. This traditional form of carnival parading, percussion and dance has deep roots in Afro-Brazilian traditions and is a major form of carnival in Recife, Brazil.&nbsp;The instruments of Maracatu are the alfaia (drum), abê (shekerê), gonguê (bell), caixa (snare drum), and atabaque (timbau).</p><p>We were formed by our leader Sam Alexander back in 2002 under the original name of Maracatu Estrela do Norte. During an extended trip to Brazil in 2017 Sam stayed with Nação do Maracatu Porto Rico in the community of Bode in Recife, spending 6 months immersed in thier music and culture. On his return to London our name was changed to Baque de Axé, and we became affiliated to Nação do Maracatu Porto Rico in the songs and rhythms we play.</p><p>We are a community based group that encourages people to participate from all backgrounds and levels of experience, and are&nbsp;always on the hunt for new members interested in participating in workshops about the music of the north east of Brazil, and performing as part of Baque de Axé in our shows and carnival parades.</p><p>There is more information&nbsp;<a href=\"https://www.baquedeaxe.com/teaching\" target=\"_blank\">here</a>, and we invite all those interested to get in touch.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18683914","name":"London Music Industry Meetup","link":"https://www.meetup.com/musicindustrymeetup","description":"London Music Industry Meetup is the premiere networking event for music professionals. Our events bring together the complete ecosystem - managers, producers, marketers, artists and more- to explore new technologies, products and revenue models that are creating new business opportunities for the music industry.\n\nExplore digital and interactive music technologies, business models, devices and creative approaches. We cover everything needed to know to create, market, engage fans and monetize music in the Web 2.0+ world.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"30510046","name":"The Sussex Drum! Circles","link":"https://www.meetup.com/the-sussex-drum-circles","description":"**The Sussex Drum!** Creating communities in rhythm. [https://www.thesussexdrum.com](https://www.thesussexdrum.com)\n**This group is ideal for** \\- Anyone who wants a great introduction or a deeper dive into the world of rhythm \\(percussion and hand drumming\\)\\. Anyone of any ability; a seasoned drummer or someone curious to explore rhythm for the first time\\. Anyone interested in learning world rhythms collected over 20 years from across the globe\\. Anyone interested in learning by doing\\, discovering new skills as they go\\. Anyone who wants to develop their musicality as a musician or novice\\. Anyone excited by rhythm as a communicator\\. Anyone longing to feel welcome and part of a group without having to engage with words\\. Anyone interested in personal expression and community music\\. Anyone who has come to a class or event run by Jamie Morgan & wants more\\.\n**Immersive Rhythm taster video:**\n[https://vimeo.com/320617159](https://vimeo.com/320617159)","city":"Seaford","state":"E2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"11844662","name":"Classical Music for Those in Their 20s and 30s","link":"https://www.meetup.com/classical-music-for-those-in-their-20s-and-30s","description":"Join us and pursue your love of classical music. Just come along to events, or suggest events of your own!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"22353360","name":"Song Lyrics Workshops and Workouts","link":"https://www.meetup.com/song-lyrics-workshops-and-workouts","description":"This is a group for people who enjoy writing lyrics, songs, poetry or just writing generally! It's a chance to share your creative with others, whether in song form, not yet in song form or otherwise and get encouragement, feedback and suggestions as well as a chance to connect with like-minded people.\n\nMany events will be held on Zoom but there will also be some live events, including lyric \"open mics\" for people to develop their self-confidence by trying out new material on a state.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"4745972","name":"Primrose Hill Choir","link":"https://www.meetup.com/primrose-hill-choir","description":"**Love to sing? Join one of London's most sociable choirs!** Before coming your 1st time email Matthew, subject heading PHC, at maestromattheww@yahoo.co.uk, and you will be sent pdfs of the music. **Full details,** including rehearsal dates, venue, payment and audio recordings, can be found **at [www.primrosehillchoirs.com](http://www.primrosehillchoirs.com/primrose-hill-choir)**.\n\nWe meet every Monday during term-time, 7.30-9.30pm, upstairs at the Primrose Hill Community Centre, 29 Hopkinsons Place, London NW1 8TN. About thirty people attend each week - **all ages and abilities are welcome** \\- and we sing **a great variety of music in all styles** (pop, classical, world and gospel). The musical director will teach you the songs (we also post rehearsal tracks on soundcloud so you can practise at home if you like) and explain the basics of reading music, and help you improve your singing technique. For more advanced singers there are **regular solo opportunities**. Afterwards **join us for a well-deserved drink** in a lovely Primrose Hill pub!\n\nAt the end of each term **experience the excitement of performing** in venues such as the Roundhouse, South Bank Centre, V&A museum and Camden market, often alongside up to three other choirs. PHC was formed in 2012 by the prize-winning conductor Matthew Watts, \"the Gareth Malone of Primrose Hill\" (Hampstead & Highgate Express).\n\nFor those with some experience who enjoy classical music (and perhaps want to sing a solo) we also run the [London Classical Choir](https://www.londonclassicalchoir.com/). And for any children who love to sing, there is the [Primrose Hill Children’s Choir](http://www.primrosehillchoirs.com/childrens-choir). We look forward to meeting you!\n\nMatthew Watts, musical director, tenor, singing & piano teacher","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"18189006","name":"Beginners Guitar with The Guitar Social","link":"https://www.meetup.com/beginnersguitar","description":"<p>Hi, if you're looking for The main Guitar Social meetup site, we have moved accounts to <a href=\"http://www.meetup.com/officialguitarsocial\">www.meetup.com/officialguitarsocial</a> this was to reduce the amount of spam you may have been getting. The Guitar Social is more alive than ever, you just need to redirect your search!</p>\n<p>The Guitar Social is a place to learn guitar and meet new people.&nbsp; <br>We offer classes, workshops social events and holidays all linked to learning and making music.</p>\n<p>We list some, but not all, of what we do here on meetup. Further information can be found by looking us up on&nbsp;<a href=\"https://www.facebook.com/theguitarsocial/?ref=bookmarks\">Facebook</a>&nbsp;or checking out our&nbsp;<a href=\"http://www.theguitarsocial.com/\">website</a>.&nbsp;</p>\n<p>See you in session soon.&nbsp;</p>\n<p>Thomas and The Guitar Social Mob.&nbsp;</p>\n<p> <br></p>","city":"London","state":"17","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"36385888","name":"Acoustic Jams in London Parks","link":"https://www.meetup.com/londonparkjams","description":"Let's all meet in a park and make music together!\n\nWe usually meet on Saturdays at 4 pm in Primrose Hill (close to Camden Town and to the Regent's Park).\n\nBring your instrument, your voice, food and drinks if you want, and your good vibes!\nAll genres are welcome, all levels are welcome, all (acoustic) instruments are welcome.\nPlease ONLY ACOUSTIC INSTRUMENTS, amplification of any kind is not allowed.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"5644412","name":"London Humanist Choir","link":"https://www.meetup.com/londonhumanistchoir","description":"**Like to sing but not religious? Based in or near London? Free on Tuesday evenings?**\nThen this is the choir for you! London Humanist Choir is the UK's foremost secular choir and a branch of the charity Humanists UK. We're a mixed-ability, non-auditioned group and aspire to high musical standards. \nOur singers are of all ages and walks of life with a love of music and humanist outlook in common. We sing to celebrate the joy (and occasional pain) of living. We learn a lot from each other, and when we get it right, we make quite a nice noise. We certainly have fun trying.\n\n**Origins**\nLHC was set up in May 2009 with a legacy dedicated to the composition of humanist songs and a choir to sing them. We have since performed in London and around the UK at humanist events, stand-up comedy gigs, private parties, our own concerts, and on the street. We've made several recordings and videos, and once performed at an international concert in Norway with a fellow humanist choir! \n\n**Rehearsals**\nWe rehearse on Tuesdays between 7pm and 9pm in central London. \n\n**Performances**\nOur rehearsals are geared towards performances throughout the year, and our diary is hotting up once again! During the early phase of the pandemic, we produced several videos of our music which you can find on YouTube. \n\n**Humanists UK**\nHumanists UK is the national charity working for non-religious people who seek to live ethical and fulfilling lives on the basis of reason and humanity. The choir is an active part of Humanists UK. You don't have to be a member to sing with us, but most of us are. Find out more about humanism at [www.humanism.org.uk](http://www.humanism.org.uk) ","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35589386","name":"A Capella in Motion","link":"https://www.meetup.com/a-capella-in-motion","description":"<p>A Capella in motion is a small a capella choir or group of singers based in the borough of Barnet in North London. We team up with dancers who create the beats to our songs using dance and body movement. We are currently looking for singers of all voice groups and meet on Tuesdays evenings. If you love to sing and have a good ear for parts and a sense of rhythm, we'd love to have you! (We also pay you a small amount per performance to cover your costs)</p>","city":"Barnet","state":"F8","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"23064831","name":"Folkmaster - Shoreham-by-Sea Folk Music Meetup","link":"https://www.meetup.com/shoreham-by-sea-folk-music-meetup","description":"<p>Shoreham-by-sea is a nexus for folk music. Regular Shoreham based events include a round-table session and a performance night each month, a two-day annual festival and a Christmas special. Keep in touch through this meetup if you want to perform, or if you are just an appreciative supporter who wants to listen. All are welcome.</p>","city":"Shoreham-by-Sea","state":"P6","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35856672","name":"Jamming & Musical Improv Sessions","link":"https://www.meetup.com/jamming-musical-improv-sessions","description":"<p>This is a group for musicians, music producers, singers and all out music fanatics to get together, jam with some music gear, make tunes and have some all out fun times together.</p><p>The idea of this group is to gather people with different musical styles, interests and levels of experience in the same room togehter and have some improvised jamming in an open, all inclusive, non judgmental environment, where people can try out different instruments, different styles all with the objective of having fun!</p><p>Our events will be hosted in Pirate rehersal rooms in their Camden branch where I will bring some synthasizers, drum machines, mics and guitars for all to play with. If anyone has their own instruments or some gear that they would be happy to share - the more the merrier. I can run most sounds through my DAW where the hope is that we will have some recordings to show for it at the end.</p><p>This group is for beginners and experts alike to enjoy the process of musical improvisation, interaction and some produciton too.</p><p><a href=\"https://pirate.com/en/locations/london-camden/\" target=\"_blank\">https://pirate.com/en/locations/london-camden/</a></p><p><a href=\"https://goo.gl/maps/Fgx86Y6yYe8TpknB9\" target=\"_blank\">https://goo.gl/maps/Fgx86Y6yYe8TpknB9</a></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19715511","name":"Musicians in London (Connect and Collaborate!)","link":"https://www.meetup.com/musicians-in-london-connect-and-collaborate","description":"<p>Lock-down...for now.&nbsp; But that shouldn't stop musicians and music lovers from creating and collaborating. Do you want to meet hobbyist and seasoned musicians, producers and songwriters to network, create, produce in a friendly online-space?&nbsp; &nbsp;</p>\n<p><b>Musicians in London</b> is a Collective - a group for musicians, solo artists and producers who want to meet, play and collaborate with others from varied musical genres, experiment with ideas and sounds and participate in open mics and gigs. <i><b>The purpose of this group is to build your community of musicians, create together and find others who may want to add their talents to your unfinished songs because ultimately music is built on collaborations.&nbsp;&nbsp;</b></i></p>\n<p>We're doing online events and song collaborations at the moment, so join us on Zoom (everyone's welcome - at all levels). <br></p>\n<p>We also host interactive podcasts where attendees can discuss with experts and producers/artists give talks and offer their advice based on their experience in the music industry today.</p>\n<p><span>We're talking about how to adapt in this new landscape, but experimenting with tools to not just survive but thrive on the online music space - albeit temporarily.&nbsp;&nbsp;</span></p>\n<p><b>We love to know a tiny bit about you, so when you become a new member don't forget to:&nbsp;</b></p>\n<p>1. &nbsp;Fill in your profile with a genuine photo.</p>\n<p>2. &nbsp;Tell us what instrument you play, or if you're a singer, producer, songwriter, MC, etc...</p>\n<p>Thanks and see you soon,</p>\n<p> <br></p>\n<p>Ian&nbsp;</p>\n<p> <br></p>\n<br>\n<p> <br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35239074","name":"London Singing Group - come together to find your voice","link":"https://www.meetup.com/london-singing-group-come-together-to-find-your-voice","description":"<p>Introducing you to a new way to approach singing - even if you're an absolute beginner. <br>Learn within a safe, fun, and friendly environment. <br>At London Singing Group we work on a number of variables including breath-work, support, technique, vocal exercises, vocal warm-ups, vocal range, and well, the fundamental 'tricks-of-the-trade.' Working on these areas will enable you to strengthen your voice, extend your range, build dynamics, enhance projection, and find your own voice as you grow in confidence as a singer, and a performer in general. <br>We sing a wide range of songs using techniques we have learned. We have fun fitting in harmonies, bass lines, musicality, and even some theory (time permitting) and based on your feedback.</p> \n<p>Anyone can join - amateurs, beginners and intermediate singers are most likely to benefit. Even if you are a performing singer, if you just want a more focussed practice session, then this will work for you too!</p> \n<p>We meet twice a week online, and after the summer we will be meeting face to face in jazz venues around London.</p> \n<p>We have free open days (online) on the 23rd and 25th of March 2021 so please get in touch for more details!</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36039636","name":"post punk experimental musicians","link":"https://www.meetup.com/postpunkexperimentalmusicians","description":"This welcoming group is a collective for all open-minded musicians with non-mainstream or 'alternative' tastes (think post punk, punk funk, experimental pop, dance punk, mixing electronics with other instruments, no wave, anything strange and unusual, for example). It doesn't focus on traditional blues and rock (there are other groups out there that cater for those genres).\n\nWe get together in jam sessions - creative spaces for improvising to make original material (rather than playing cover versions). The sessions might evolve e.g they might be open improv sessions or have a theme.\n\nWe like to have fun experimenting, blending genres and working collaboratively.\n\nThe aim is to have fun jamming and playfully experimenting. And cooking up some new music.\n\n**How it works:**\n\n* We meet in a rehearsal studio that I've booked.\n* The cost covers three hours of studio time including a full PA, guitar and bass amps, mics, drum kit with cymbals - just bring your instrument(s) and any accessories (e.g leads/cables/drumsticks) if needed.\n* We improvise / jam to see what emerges - always interesting!\n* Don't worry if you haven't done much improvising or collaboration - the sessions will be relaxed (and hopefully fun!) so everyone can find/contribute at their own level.\n* You just need to be able to listen to others, play as a part of a band and throw ideas into the collective experimental pot to be developed together.\n* Each session is unique, resulting from the mix of who comes.\n\nThe overall idea is to help musicians connect, have fun playing together, get creative and share/try out ideas in a supportive environment.\n\n\\*If you have any questions or thoughts, please get in touch or post on the Discussions board.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"20914946","name":"Oxford Tuneless Choir","link":"https://www.meetup.com/oxford-tuneless-choir","description":"<p>This is a group for anyone who loves singing but can't quite do it in tune. Every Wednesday, we sing well-known popular songs together 'like no-one is listening'.&nbsp;It is unlike any other choir you may have encountered: there is no audition, absolutely no pressure, no judgement, no intellectual challenge, no practising, no performance. We just have a ball and leave after an hour and a half with smiles on our faces having experienced the benefits of the pure exhilarating pleasure singing brings.</p><p>North Oxford Association Community Centre, Summertown OX2 7DP 8-9.30pm</p><p>https://www.tunelesschoir.com/join-another-tuneless-choir/oxford-tuneless-choir</p>","city":"Oxford","state":"K2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19296026","name":"Marmalade Music Jams London","link":"https://www.meetup.com/marmalade-music-jams-london","description":"<p>We have fun playing musical improvisation jams. The sessions are organised to be approachable to rusty and new jammers but also interesting and challenging for experienced jammers. We meet in a rehearsal studio and are excited to have all kinds of instruments and people.</p><p>We generally do not play songs.&nbsp;This is in order to keep things simple and maximize playing time. Musical themes in the form of chord progressions or ideas will be introduce one at a time by your host on the day but are also posted in advance on an external link video previews.&nbsp;</p><p>Each theme will be built up to three layers. The foundation layer is just the basic music theme. The groove layer allows players to get comfortable and explore the sound according to their abilities (no solos). The solo layer is for one person at a time. Each player will be queued in to soloing windows. The overall simplicity or complexity of the music will be determined by the players, but the three layers should ensure a comfort level for everyone. Players are advised to arrive early in order benefit from the orientation at the beginning.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"25901594","name":"Kent and London Music Meetups","link":"https://www.meetup.com/kent-london-music-meetup","description":"<p>This group is for all types of Music Lovers!&nbsp; <span> <br></span> <br>Whether its a concert you want to go to, a live band you want to see in a local pub,&nbsp;karaoke, a West End musical show, singing&nbsp;competition or a music festival. &nbsp; <br>Rock, Country, Techno, Classical, House, Indie, Pop - anything goes!&nbsp; <span> <br></span><span> <br></span>Music brings people together and hopefully this group will help you connect with like minded people :)&nbsp; <br> <br>Feel free to message me to add you as an Event Organiser if you want to host your own night out and find friends in your town who are into the same music as you.&nbsp; <br></p>","city":"Tunbridge Wells","state":"G5","country":"gb","isPrivate":true,"isNewGroup":false},{"id":"12501132","name":"Many Voices LGBTIQ singing group - London","link":"https://www.meetup.com/manyvoiceslgbt","description":"Come and sing for fun with Many Voices LGBTIQ (and allies) singing evenings. We meet on the last Sunday of most months at Essex Church, Notting Hill.\n\nThere's no need to read music; all songs are taught by ear. No auditions, no performances, no commitment required. We just sing for fun: spirited songs, fun ditties and rounds, and inspirational songs, nothing too complicated to pick up in a few minutes. We genuinely welcome lesbian, gay, bi, trans, queer, questioning, intersex and asexual people - and our allies.\n\nIf you would like to come and sing your heart out, but are maybe feeling a bit nervous, get in touch beforehand and we'll do what we can to help you across the threshold :-) You'll definitely feel better after a good sing!\nWe're also on Facebook ([https://www.facebook.com/groups/manyvoicesl...](https://www.facebook.com/groups/manyvoiceslgbt/)) and Twitter (@manyvoiceslgbt). Our website is [http://www.many-voices.co.uk](http://www.many-voices.co.uk). You can email us at sing@many-voices.co.uk.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36281992","name":"Let's Sing Community Choir (Crystal Palace)","link":"https://www.meetup.com/lets-sing-community-choir-crystal-palace","description":"Hey, thanks for stopping by!!\n\nThis group is for those who are enthusiastic about singing whether in the shower, at karaoke or at the top of their lungs in the car! Come and join this new and exciting community choir with like-minded people who also love singing. There are so many benefits to group singing and it's scientifically proven that it does us good! We will meet weekly to sing in person mostly gospel songs with some classic well-known tunes thrown in for good measure. You don't have to be religious, just a passion for singing is all that's required. This is for any and everyone! \n\nNo audition needed neither any past experience required, as long as you can hold a note, a warm welcome awaits!\n\nHope to see you soon!!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19632173","name":"Spanish LIVE MUSIC! London.","link":"https://www.meetup.com/spanish-live-music-london","description":"<p><b>LIVE SPANISH MUSIC!</b>, that's exactly what we like! Keep updated about bands and venues with real Spanish music (rumba, flamenco,...). MEET people sharing similar tastes, ENJOY friendly atmospheres and MAKE your own Spanish live music tour in London.</p>\n<p><span>This meetup was created with a main goal... people who like Spanish LIVE MUSIC (specially Rumba &amp; Flamenco) can choose a live music event, meet up THEMSELVES and enjoy that amazing atmosphere!</span></p>\n<br>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"33927745","name":"London Music Production lessons","link":"https://www.meetup.com/london-music-production-lessons","description":"<p>This group is for anyone interested in or already on their journey into music production, songwriting and musicianship.&nbsp;</p>\n<p><span>&nbsp;The long term goal of this group is to widen the community and connect learners with teachers and be on hand to answer any of your music production questions. We want to save you hours of time scrolling through forums looking for solutions to any technical questions you may have but instead connect you with other producers and enable you to remain energized, excited and in a state of flow with your musical journey.&nbsp;</span></p>\n<p><span> <br></span></p>\n<p><span>&nbsp;Currently we hold a weekly networking, Q and A night every Thursday evening, regular listening parties to gain feedback from other writers, producers and members of the group. We have guest teachers and industry professionals running workshops on mixing, vocal production, harmony, genre specific beat making. We have a regular beginners course into Logic Pro X, an ableton one coming up and are looking to expand across into others DAWS. So keep a look out for whats to come.&nbsp;</span></p>\n<p><span> <br></span></p>\n<p><span>&nbsp;In the mean time your feedback and input as to what the London music production group can help you with is always welcome.&nbsp;</span></p>\n<p><span>For more information and production tips please feel free to check out our socials:&nbsp;</span></p>\n<p><span> <br></span></p>\n<p><span>INSTAGRAM: @alphawavesmusicschool</span></p>\n<p><span> <br></span></p>\n<p><span>&nbsp;Wishing you a lovely day.&nbsp;</span></p>\n<p><span> <br></span></p>\n<p><span>Abbey&nbsp;</span></p>\n<p><span> <br></span></p>\n<p><span> <br></span></p>\n<p><span> <br></span></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"29358636","name":"Soul of the City Choir","link":"https://www.meetup.com/soul-of-the-city-choir","description":"<p>Soul of the City Choir is a fun and friendly choir singing pop, soul and gospel classics from Stevie Wonder to Florence and the Machine, The Killers to Bill Withers and much much more!</p>\n<p>We think that everyone can sing and whether you're a complete beginner, shower singer or pro this choir is for you!</p>\n<p>There are no auditions and no requirements to read music, it's all about the enjoyment of singing.</p>\n<p>If you've never experienced the amazing feeling of singing why not give it a try!</p>\n<p>We are following government guidelines by staying safe and staying at home so our usual weekly rehearsals are currently on hold.</p>\n<p>However, we are still celebrating 10 fantastic years of singing and will be taking choir online!!</p>\n<p>Nothing beats a good holler, wherever you are, it just feels good! There has always been singing in the car or shower or doing solo performances in the mirror with a hairbrush ... we're temporarily going back to those well-known times... we can still sing at the top of our voices, we can still feel good.&nbsp;&nbsp;</p>\n<p>Watch this space for further details!</p>\n<p> <br>Look forward to singing with you in some capacity soon!</p>","city":"Hove","state":"E2","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"11932682","name":"London Modular Synthesis","link":"https://www.meetup.com/london-modular-synthesis-group","description":"We are the music-tech and sound design obsessed people of London, a group of people with custom-built modular synthesizers.\n\nWe are interested in all things synth, digital, analogue, and DIY instrument building.\n\nOf course newcomers are welcome, if you are interested in modular synthesis join our next event.\n\n\\\n\nfollow Perimeter Jam on Instagram\nhttps://www.instagram.com/perimeter_jam/\n\n\\","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"12399352","name":"London City Voices","link":"https://www.meetup.com/london-city-voices","description":"\\*\\*PLEASE NOTE\\*\\*: There are LOTS of people who attend this, so don't worry if no-one from Meetup has signed up - there will always be a crowd at every rehearsal, and we usually have several new people every session.\n\nWe are a fun, **NON-AUDITION** community choir meeting from **6:30-8pm** in **Soho on Mondays**, **the City of London on Wednesdays** and **Waterloo on Thursdays**. We also run **online rehearsals on Tuesdays at 7pm**. The aim is to give people a place to sing their hearts out one or more evenings a week after work. LCV aims to bring people together to have some fun and make a great sound.\nHave a look at our [website](http://www.londoncityvoices.co.uk), [Facebook page](https://www.facebook.com/LondonCityVoices?notif_t=fbpage_admin), and [Twitter](https://twitter.com/londoncityvoice) for more information.\nWe try to hold at least two concerts a year, and lots of other events. Our concerts have been at such prestigious venues as the Royal College of Surgeons, the Grand Connaught Rooms and Troxy. During the first lockdown in 2020 we raised over £100K for Women's Aid with [this video](https://youtu.be/g7U7iYxHw2Q), and we also collaborated with Annie Lennox in [this video](https://youtu.be/f3DFaIovZxc).\n\nThe main repertoire is drawn from contemporary pop and folk/traditional tunes. Some examples of what we sing:\n\"Bohemian Rhapsody\" (Queen)\n\"Mr Blue Sky\" (Electric Light Orchestra)\n80s Pop Medley\n80s Dance Medley\n\"Runaway\" (The Corrs)\n\"Kiss From A Rose\" (Seal)\n\"Birdhouse In Your Soul\" (They Might Be Giants)\nNineties Mashup\n\"Toxic\" (Britney Spears)\nDisco Mashup \n\"Lady (Hear Me Tonight)\" (Modjo) \n\"Ghost Town\" (The Specials) \nMusicals mashup\n\"Black Velvet\" (Alannah Myles)\n\"You've Got a Friend\" (Carole King)\n\"Nobody Does it Better\" (Carly Simon) \n\"Go Your Own Way\" (Fleetwood Mac) \n\"A Little Respect\" (Erasure)\n\"Can't Help Falling in Love\" (Elvis)\n“One Day Like This” (Elbow)  \nYou can book a **free taster session** by registering on www.londoncityvoices.co.uk. After that, if you decide you'd like to join us we have a variety of membership options. Payment is by Direct Debit which you can, of course, cancel at any time. **Annual Membership** is £350 per year and represents the best value for money. **Monthly Membership** is £35 per month and is the most popular option. Both Annual and Monthly memberships entitle you to attend all weekly rehearsals as many times as you like, both in-person and online. We also offer an **Out-Of-Town Membership** for people who live a long way away and are unlikely to attend many live events or in-person rehearsals. The Out-Of-Town Membership scheme is £15 per month, billed by Direct Debit, and allows you to attend all online rehearsals, as well as four in-person rehearsals each term for £5 each time, with any further sessions you attend being charged at £15 each. Our fourth membership option is **Pay-As-You-Go**, which requires a monthly Direct Debit payment of £5 PLUS a payment of £15 by cash or card for every rehearsal you attend. There are normally 13-14 sessions in a term plus a concert.\nLCV has been running since the end of 2011, and for the first year it consisted of about 12 people meeting every week. In January 2013 we suddenly had 27 members, and since then it hasn't dropped below that - we now regularly have about 100 people at a City rehearsal. Our City membership is predominantly but not exclusively made up of people who work locally to Monument Station, and we always go to a pub after the rehearsal, where there is usually more singing (generally aided by the consumption of some Merlot). The Soho branch usually has around 70-80 attendees, again, we always go for a drink and a sing afterwards in a pub in Soho. Waterloo generally has around 60 in attendance and, once again, there is always a trip to the pub for drinks, chats and lots more singing.\n\n**It doesn't matter whether you are an experienced singer or you have never sung before** \\- there are **no auditions** and you don't have to read music (although we do make the sheet music available for everyone). We usually record the parts and upload them to the website so that people can listen to them during the week. About 50% of the members can't read music but this is not a drawback. Occasionally if you are having trouble pitching, Richard may offer you a little help, perhaps before the rehearsal or at a mutually convenient time. We are firm believers that no one is \"tone-deaf\" - some people just haven't learnt how to pitch accurately yet.\nWe have had five weddings so far between people who met in the choir. Some very firm friendships (and indeed, many long-term relationships) have emerged from LCV. \nYou can find out more about the choir by going to our [London City Voices website](http://www.londoncityvoices.co.uk). Hope to see you at LCV soon. Do feel free to ask questions here or email us at info@londoncityvoices.co.uk.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36193522","name":"Music Production Meetup Group (relaxed, open minded)","link":"https://www.meetup.com/music-production-meetup-group","description":"Hey, I am an amateur music producer and have been producing for 13 years as a hobby. I have been to many meetup events in my life. In the daytime, I am DPhil student at Cambridge in CS/maths/ai/philosophy, and at night a music producer. Whilst I have some time off studying, I am willing to teach free sessions on how one goes about using Logic Pro and synthesisers to create sounds. This will include tips on acoustics, mastering, mixing, and software plugins that one can use.\n\nThe sessions are there to be calming and very relaxed, but the music you make can be whatever you'd like. I'm not an expert, but it would be nice to figure out how to produce and make a song together.\n\nI aim to co-ordinate this at community centres in London or at venues that are receptive to charitable causes and have equipment for people to use.\n\nIf you've wanted to get into music production as a beginner, this will be a fairly relaxed and organic way of getting into it yourself, with myself there to provide a helping hand in familiarising yourself with tips and techniques. I do not aim to run classes but to provide a space for producers to be around each other, to learn from each other and to hang out.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"10312012","name":"SING IN SPANISH WITH THE LOLCHOIR -IN LONDON-!!!","link":"https://www.meetup.com/lolchoir","description":"After a few months break, we are finally back and ready to start our singing sessions in May 2022. This Spring is welcoming our voices to catch up and sing all we couldn't in the last two years!!! ☀️ 🌀 🌱 🙏 🥳\n\nSessions from 6:30 - 8pm (UK time).\n \n\\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \n**T H E   \" L O L C H O I R \"**\n**LOL = Landscapes Of Latin-America**\n\nAs the name suggests the aim of the LOLCHOIR is to paint the Landscapes of Latin-America (and Spain) through the sound of its music, from Mexico to Argentina and the Iberian Peninsula.\n\n**\\* WHAT?** The are plenty of choirs in London but no one -that I know- focused strictly on repertoire from Latin America. There are countless wonderful songs and melodies to sing so why not?\n\n**\\* WHY?** Singing is one of my favourite things in life and I love sharing that passion with people, it is fun, relaxing, healing, and very accessible to every one so why not? There is another aspect of the \"why\", and it is to create a space where people can either practice Spanish, learn it or basically get back to their roots if they are Spanish speakers but living in London there is not much space to sing in their mother tongue. Many more reasons exist, lets say we'll do it to feed our souls :).\n\n**\\* WHO CAN JOIN?** Everyone willing to sing and have fun. Maybe you want to practise your Spanish, maybe you are learning it or simply anyone who enjoys singing :). **NO AUDITION REQUIRED**. \n\n**\\* WHERE?**\nRight now we are meeting online, but in 'normal times' the rehearsals are just a 10min walk from KING'S CROSS station at \"Calthorpe Project\" 258 - 274 Grays Inn Road, London WC1X 8LH\n![](https://secure.meetupstatic.com/photos/event/9/8/7/c/600_453699036.jpeg)\n\\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\- \\-\n\n**More info: [www.lolchoir.com](http://www.lolchoir.com)**\n![](https://secure.meetupstatic.com/photos/event/8/1/4/1/600_445113089.jpeg)\n\nSee you soon! \nCamilo Menjura\n[www.menjuramusic.com](http://www.menjuramusic.com)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"33550039","name":"Not Another Karaoke Night, Camden","link":"https://www.meetup.com/not-another-karaoke-night-camden","description":"<p>Struggling to find a fun karaoke night without paying extortionate amounts of wonga for a karaoke booth? Want to meet up with fellow karaoke lovers whilst dancing and singing your favourite nostalgic bangers into the night?</p><p>Then this group is for you!</p><p>Every Tuesday Not Another Karaoke Night hosts Karaoke Camden in the heart of Camden Market.</p><p>There is a long booth sofa right next to the dance floor where you can meet, mingle, get together and sing your favourite hits with. Whether it be rocking out as Freddy, duetting a magic carpet ride, or Spicing it up with Wannabe, we have it all! All we need now is your vocal involvement.</p><p>There will be a table for 6 people booked each night for Meetup members, however if you would like to invite more of your friends drop us a message and tell us whether you want to extend it for big party times.</p><p>If you have a birthday coming up and you can get 8 friends together you will receive a FREE bottle of bubbly for the table. Once again, drop us a message to book.</p><p>This is such a great night in such a great venue, with regulars and newbies alike, so we look forward to forming a fun community of singers whatever your level.</p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36225010","name":"Gospeloke","link":"https://www.meetup.com/gospeloke","description":"Ever wanted to sound like Tina/Stevie/Whitney on the mic? Have you always dreamt of singing on a stage, unleashing your hidden diva in front of adoring fans with a live GOSPEL choir backing you up?\n\nWell GOSPELOKE; the capital’s 1st Gospel Style Karaoke knees-up, is for you.\nHosted by Shoreditch’s fallen angel, the ‘ludicrously entertaining’, Eleanor Conway, and from the makers of some of the capital’s best interactive producers, Jonny Unknown, you can expect one euphoric ceremonial singalong with soulful Toni Robinson and her 15 strong gospel choir backing you up all the way… It’s a ‘spirtual awakening with a pop concert feel’.\n\nThink Sister Act meets your school assembly via Top of the Pops, with classics such as Madonna’s ‘Like A Prayer’, Blur’s ‘Tender’, Bruno Mars’ ‘Uptown Funk’ and Mary Mary’s ‘Shackles’.\nOf course that’s not all… There’ll also be anthemic, big sing-alongs, congregational harmonies and we’ll be hearing your confessional tales along the way, awarding prizes for the night’s ‘Best Confessional’, ‘Best Solo Performance’, ‘Best Duet/Group Performance’ and much, much more…\n\nFB: www.facebook.com/gospeloke/\nIG: instagram.com/gospelokeofficial","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"32760048","name":"Red & Black Music","link":"https://www.meetup.com/redandblackmusic","description":"Red & Black Music is a music management label comprising 4 projects - Diáspora, Fiesta Latina, ﻿Phasma﻿ & Rory - all 4 of which started independently of one another and were brought together under the Red & Black Music banner covering 4 wide areas of music - Jazz, Latin, Soul & Brazilian.\n\nDIÁSPORA (est. 2009)\nDiáspora\nLarge Latin/salsa band, Diáspora lends itself to an expansive big band sound without losing the dynamism and spark of a small group, and combines sensuous vocals, sophisticated horn lines and explosive percussion solos. Available as a 5-12 piece.\nDiáspora Brasil\nDiáspora Brasil is the alter-ego of Diáspora, a separate setup specialising in the myriad of styles emerging from Brazil; from Samba and Bossa Nova to MPB and Sertanejo, from Partido Alto to funk. Available as a 5-10 piece.\n\nFIESTA LATINA (est. 2013)\nFiesta Latina\nSmall Latin/salsa band, Fiesta Latina is the smaller sister act and “instant coffee” alternative to the filtered coffee beans of its big brother Diáspora, comprising piano, vocals, cajon and trumpet, creating an explosive spark of musical interplay, with an emphasis on live dynamic interaction. Available as a 1-4 piece.\nFesta Brasileira\n​Festa Brasileira is a subset of Fiesta Latina, a separate setup specialising in the myriad of styles emerging from Brazil; from Samba and Bossa Nova to MPB and Sertanejo, from Partido Alto to funk. Available as a 1-4 piece.\n\nPHASMA (est. 2017)\nPhasma\nThe soul band. ​A band delving deep into the Great American musical subconscious, Phasma brings out the best of soul, funk, rhythm and blues. Its lineup (lead vocals, backing vocals, piano, bass, drums, percussion, sax/flute and trumpet) lends itself to a slick, sophisticated sound coloured by the unique concept of soul that arose out of the African experience in America. Available as a 5-10 piece.\n\nRORY (est. 2008)\nRory Jazz\nThe Jazz Quartet, formed in November 2008 whilst studying at the Royal Northern College of Music, draws upon a wide range of influences from swing and bebop to Afro-Cuban and Brazilian jazz to Motown, soul and funk, with a heavy emphasis on improvisation and live, dynamic interaction. Available as a 1-4 piece.\nRory Bossa Nova\nThe Bossa Nova Trio grew out of Rory's love of Bossa Nova and Brazilian music. Blending the warm, breezy tones of the strummed acoustic guitar and the crisp, bass notes of the cajon with saxophone, flute and vocals, the trio interpret a diverse range of repertoire by the likes of Tom Jobim, Ary Barroso, Baden Powell, Carlos Lyra, Chico Buarque, Durval Ferreira, Ivan Lins, Luis Bonfa, Marcos Valle, Roberto Menescal and Toquinho, and contemporary jazz-Bossa fusions such as Azymuth, Bossacucanova and Toninho Horta. Available as a 1-3 piece.\nRory Solo\nRory can be booked as a Solo Saxophonist (+ opt. flute, clarinet and vocals) performing with backing tracks. Offering a wide wealth of music spanning multiple genres that can be hand-picked according to the requirements of the event, Rory's extensive backing track repertoire is split down into set lists and play lists. Available as a 1-piece.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"26035085","name":"SING with the \"WORLD MUSIC CHOIR\"!!! -[Hybrid sessions]- 🗣","link":"https://www.meetup.com/london-choir-for-music-of-the-world","description":"**WELCOME!!!** \nWe are the -previously called- \"SOAS WORLD MUSIC CHOIR\" 😃\nThis is a choir that welcomes anyone interested in singing music from different countries, in different languages, with rich harmonies and groovy rhythms! \n\nThere are no auditions so \\*\\*\\*EVERYONE IS WELCOME TO JOIN\\*\\*\\*. \n\nWe usually meet at SOAS University near Russell Square / Euston (Tube) but now due to the current circumstances, we'll be running the sessions also online via Zoom so you choose if you join us in person or online. \n\nAfter such a long break (2 years already!!!), we are re-starting our singing sessions this March on Wednesday 9th, 16 & 23rd. \n\n\n\n\n**REPERTOIRE:**\nFolk tunes from different parts of the world, in different languages. Taught by ear. \n\n**OLD RECORDINGS:**\nAt the end of the term we usually make a recording of all the tunes we have learnt so everyone can have a memory of the tunes :). Here two links to our previous recording sessions:\nLINK #1 (2018)\n[http://www.menjuramusic.com/soas_cd_2018.html](http://www.menjuramusic.com/soas_cd_2018.html)\nLINK #2 (2017)\n[http://www.menjuramusic.com/soas-recording.html](http://www.menjuramusic.com/soas-recording.html)\n\n**REGISTER & FEES:**\nhttps://docs.google.com/forms/d/e/1FAIpQLSf-eLSJToXZxwE5e21u5pSUElAxmQdJnmaa4kS73Y8bk4-eAw/viewform?fbclid=IwAR0ztywubWK4k45e35EWLzbK0u1razm4EyYbm1T2kBXvlLLYqJ9iEL9yjm8\n\n[Facebook new page](https://www.facebook.com/soaswmchoir/) here. \n\n\n\n\nZOOM LINK:\n[https://us02web.zoom.us/meeting/register/tZ0lcu6pqD0iGNbJrZdeXLjYfGtoj9lw6xuD](https://us02web.zoom.us/meeting/register/tZ0lcu6pqD0iGNbJrZdeXLjYfGtoj9lw6xuD)\n\n\n\n\nHope to see you there, \n\n\n\n\nCamilo Menjura\n[www.menjuramusic.com](http://www.menjuramusic.com)\n\n\n\n\n\\* If you have any question please do not hesitate to contact me and I'll reply as soon as I can. \n\n\n\n\nBest, \nCamilo","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"29204548","name":"London Classical Choir","link":"https://www.meetup.com/london-classical-choir","description":"JOIN THE LONDON CLASSICAL CHOIR! You will be made very welcome.\n\nBefore coming the first time email Matthew, subject heading LCC, at maestromattheww@yahoo.co.uk, and you will be sent pdfs of the music. For rehearsal dates, venue, payment (half-price for students, concessions available) and recordings see [londonclassicalchoir.com](https://www.londonclassicalchoir.com/).\n\nDo you love singing **great classical music** **from all periods**, and enjoy interesting programmes such as *From Darkness to Light* and *Music from the Americas*? Would you like to **join a friendly, multicultural group** of about thirty people and **take your singing to the next level**? Would you like to take part in **regular concerts with the London Classical Orchestra** and perform in venues such as the V&A Museum and Trafalgar Square and to venues across the world via livestream? Are you interested in **solo opportunities**?\n\nWe meet two Fridays a month very near Chalk Farm tube and there are **no auditions**. Being able to read music helps, but if you pick up songs quickly by ear you are also welcome (we provide online practice tracks so you can practise at home). After rehearsals **enjoy a well-deserved drink** in a fine local pub. The choir was started in 2018 by the prize-winning conductor Matthew Watts, who will help you learn the music, improve your sight-singing and vocal technique.\n\nIf you are new to choral singing and enjoy music in all styles (pop, classical, world and gospel) then we recommend you try the [Primrose Hill Choir](http://www.primrosehillchoirs.com/primrose-hill-choir), and if you know any primary aged children who enjoy singing then there is the [Primrose Hill Children’s Choir](http://www.primrosehillchoirs.com/childrens-choir).","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"35762892","name":"Pandoras wine bar","link":"https://www.meetup.com/meetup-group-ionsrfjw","description":"This is a group dedicated to the appreciation of pre 2000 bands still touring today from the sixties right up to the late nineties.\nThe purpose of the group is to meet other music fans from back in the day. Attend live events and themed events.","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"22851766","name":"Angie A's Keep Calm & Sing Group","link":"https://www.meetup.com/angies-keep-calm-sing-meetup","description":"This group is for those who want to experience the power of singing and it's positive [health](https://keyword-assistant.com/s/?q=health) benefits. A vocal group with a holistic twist! A vocal group with an awareness of the power of the [BREATH](https://keyword-assistant.com/s/?q=BREATH) and an awareness of the THROAT CHAKRA. Breathing incorrectly makes conditions like migraines, asthma, low energy levels etc worse. The breathing techniques for singing can bring about positive [health](https://keyword-assistant.com/s/?q=health) benefits in just two weeks including relaxation.\n\n\n\n\nIf you join as a member, you are invited to attend a meetup within 4 weeks of becoming member. As this group will only have up to 50 members maximum, if there has'nt been any attendance [ either offline or online ] in the first 4 weeks of joining you will be removed to free up the space for those who want to attend and experience. You can always rejoin to attend a workshop.\nTo attend any workshop, a suggested donation of £2 -£4 is made either prior to or after attending an offline or offline workshop. A Justgiving page link is sent to the participant after the workshop. Those who request it prior to a workshop will be sent the Justgiving link.\nThis workshop is led by professional vocalist/ Songwriter and Entertainer Angie A. Angela has a wealth of experience and skills to share; she performed backing vocals for established artists including for Olive who got to number 1 in the national charts with the song 'You're Not Alone' [ see Top of The Pops youtube clip ]. Angie is also an ex Britain's Got Talent contestant and has experience leading choirs '. \n\nCome and relax body, mind and soul and sing out! Have fun and experience the positive [health](https://keyword-assistant.com/s/?q=health) benefits! Workshops will be in North Finchley, twice a month, free to attend, for 1 hour, 7pm - 8pm at the Arts Depot in North Finchley.\nHere's a youtube clip for inspiration - [ we work on the beginning of this performance -\n[https://youtu.be/1yUK0S_cEXY](https://youtu.be/1yUK0S_cEXY)\n] plus the song ' Something Inside so Strong'.....Come and uplift your soul :-)","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"19684377","name":"Sunday Assembly East End","link":"https://www.meetup.com/sunday-assembly-east-end","description":"<p><span>Sunday Assembly is a secular community that celebrates life... a global movement, now growing in the East End! We aim to help everyone live their lives as fully as possible... to Live Better, Help Often and Wonder More. We do this via regular congregations, where we share wisdom and stories, reflect on the joys and sorrows of life, and sing classic pop songs together with a live band, and then socialise in the cafe afterwards. Whats not to like?!</span> <br></p>\n<p><span>We aim to build up a community around these events where people support each other (e.g. via our Live Better peer support groups), as well as engaging with their local community and forming interest groups (e.g. book group, poetry, games group, or join our band...). We hope to provide a platform for people in this unique and diverse area to come together and discover what unites rather than what divides them.&nbsp;</span></p>\n<p><span>Find out more about the Sunday Assembly story here at&nbsp;</span><a href=\"https://www.sundayassembly.com/\">https://www.sundayassembly.com/</a></p>\n<p>Connect with us on facebook -&nbsp;<a href=\"https://www.facebook.com/SundayAssemblyEastEnd\">https://www.facebook.com/SundayAssemblyEastEnd</a>&nbsp;</p>\n<p>or on Twitter:&nbsp;<a href=\"https://twitter.com/SundayA_EastEnd\">https://twitter.com/SundayA_EastEnd</a></p>\n<p><span>So come along to an assembly, a meeting or a social if you'd like to find out more</span><span>.&nbsp;</span><span>If you're someone who thinks about the deeper questions in life, likes to spend time with diverse and interesting people united by a common cause, and enjoys a good sing song (not compulsory but recommended!), then this is for you!</span>&nbsp;You're also welcome to get involved in shaping this fun community.<br></p>","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false},{"id":"36101156","name":"Indiy - Music Industry Office Hours","link":"https://www.meetup.com/indiy-music-industry-office-hours","description":"Welcome to this space to help aspiring and established musicians realise their full potential.\n\nWe will be holding weekly online events so join us from anywhere in the world!\n\nWe aim to help people in the music industry talk through their biggest challenges when it comes to getting stuff done.\n\nThis space is for anyone interested in the music industry but specifically helpful for:\n\n\\- Artists\n\\- Singers\n\\- Rappers\n\\- Songwriters\n\\- Mix Engineers\n\\- Mastering Engineers\n\\- Studio Owners\n\nMy name is Chris and I will be running this time. I am the founder of indiy.com a community of over 14k musicians and I have over 10 years of industry experience. So if you need any help, guidance or just want to get something off your chest, stop by and see if I can help!\n\nTo get an understanding of Indiy, our Purpose and Mission check out the following articles:\n\n[40k Songs are uploaded to Spotify every day](https://indiy.com/how-many-songs-are-uploaded-on-spotify-daily/)\n[The 10 Thousand Hour Rule](https://indiy.com/the-10000-hour-rule-becoming-a-master-musician/)\n[Why done is better than perfect](https://indiy.com/why-done-is-better-than-perfect/)\n[The Music Industry is not designed for you to understand](https://indiy.com/the-music-industry-is-not-designed-for-you-to-understand/)\n[The 1000 True Fans Theory](https://indiy.com/the-1000-true-fans-theory-kickstart-your-music-career-now/)\n\nAlso for artists and producers, you can get some free stuff below\n\n[Free Vocal Presets](https://indiy.com/job/Vocal_Presets/free-juice-wrld-style-vocal-presets-for-fl-studio/)\n\nWe look forward to seeing you at a future event!","city":"London","state":"17","country":"gb","isPrivate":false,"isNewGroup":false}]