[
    {
        "id": "25899298",
        "name": "FRENCH LONDON EXPERIENCE - FLE",
        "link": "https://www.meetup.com/french-london-experience-meetup",
        "description": "\"You will love French, the French and France\". \n\nFrench London Experience is an intiative that I've launched to promote connections between French and British cultures. \n\nIt offers various ways to practise your French and to learn about French culture. We have a lot of events and services to improve your knowledge about France, its people, culture, history, political organisation, culinary traditions, way of life and way of working, and much more... \n\nThe activities take place in different forms - meetings, one-to-one, small groups, sessions, lectures, guided tours - in a variety of venues such as cafes, parks, companies, theatres, cinemas, gardens, exhibitions, museums, meeting rooms, and online.\n\nAttendees will be encouraged to engage in different ways along events.\n\nLast, a native French professional, I offer private tuitions and can reply to a various range of specific requests from lessons to works or any support in French (training, welcoming, writing, speaking, voice-recording,...)\n\nKeywords are ENTHUSIASM, ADAPTABILITY and PASSION\n\nAny question or request?\nDrop me a line frenchlondonexperience at gmail dot com\n\nWebsite\n[https://www.frenchlondonexperience.com/](https://www.frenchlondonexperience.com/?fbclid=IwAR3AqarNR1W5yav_DL1dCNuQddEOSgDju762CbuIV2HbknnrL4z8rB2Iqas)\n\nList of public events:\n[https://www.meetup.com/French-London-Experience-Meetup/](https://www.meetup.com/French-London-Experience-Meetup/?fbclid=IwAR3AqarNR1W5yav_DL1dCNuQddEOSgDju762CbuIV2HbknnrL4z8rB2Iqas)",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36320924",
        "name": "London Job Search Meetup",
        "link": "https://www.meetup.com/meetup-group-rswmpetp",
        "description": "This Group is for Job Seekers interested in Career Development, Job Search, Job Search Strategies and Networking where we can share knowledge, skills, experience and make friends...So anything career related this group is for you!!\nThis group is to assist people find their next job in UK.\n\nThis Meetup group is tailored towards all London area Job Seekers, Hiring Managers, and Recruiters/HR Professionals that are either looking for a job, looking to hire someone, or looking to expand their current network. Our events are mostly geared towards connecting Job Seekers with those Hiring Managers and Recruiters that have matching openings. This group is a great place for all professionals (including those that are already working), to network and build connections, which can be utilized to enhance long-term career growth and personal development. In addition, we will also collaborate with local nonprofit organizations to strengthen community ties and support the important services they provide to the people of the United Kingdom.\nWe invite speakers and conduct sessions around job search strategies, resume writing, interviews, LinkedIn profiles and all things important for finding that next job.\n\nI would like to personally welcome you to the meetup and look forward to seeing you at the next event.\nSimon",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36086242",
        "name": "THE FILM ATELIER  Folk Indie Classical Music Jam, Gigs Meets",
        "link": "https://www.meetup.com/musicians-london-southeast",
        "description": "**For: Acoustic musicians, singer-songwriters, classical musicians and musical instrument & world music players!**\n\n(Not for: Drum N Bass, Rap, RnB, Soul, Funk, Electronica or X factor style commercial music)\n\n**Who Should Join: Solo acoustic instrumentalists, singer-songwriters, session players, keen musicians who know their way around their instrument; those looking for ensemble playing experience and performance. We are not an Open Mic. Meet-up is just one platform we use and we currently trial Meet-up to see whether this is worth continuing with.**\n\n**What we do at events:** We are a new independent start-up! Acoustic Music is core to our emotional well-being, down the the rhythm of our heartbeat. We promote being well and healthy through music and developing a small local community of budding musicians who are otherwise isolated and disconnected from growing with other musicians.\n\n2 hours long acoustic music sessions limited to a max of 8 musicians. We work on shared and agreed music repertoire and play as an ensemble or session. We have our own performance space and audience in the acoustic cafe coffeehouse style.\n\nWe currently run 5 acoustic music meet ups:\n\n**1\\. Classical Chamber Meet\\-up: Saturdays 3\\.00pm \\[sessional depending on players\\]**\n**2\\. Singer\\-Songwriter Indie Alternative Session: Saturdays 5\\.00pm**\n**3\\. Alt\\. Folk Acoustic Session: Wednesday 6\\.00pm**\n**4\\. London Chinese Music Instrument Music Meetup: Sundays 2\\.00pm \\[Private\\]**\n**5\\. World Music \\[Acoustic instruments only\\] Meet up \\[NEW\\]: Sundays 2pm** \n\n**1\\. Classical Music & Chamber Music Meet\\-up:** If you know your way around your classical instrument (cello, violin, flute, clarinet etc), and are interested in meeting like minded instrumentalists to grow and nurture classical ensemble playing- drop us a message with your instrument and repertoire interest! We work out scores with parts we can rehearse and put together.\n\n**2\\. Acoustic Indie Alternative Sessions:** Unlike Open Mics, we work around each others' songs and songwriting, traditional folk and original songs creating instrument parts from the collective of musicians. By alternative, we refer to the spirit of alternative music in its non-commercial, non-saccharin lyrics and non-pop structure.\n\n**3\\. Alt\\. Folk:** we started off performing as folk musicians and love folk music by T Bone Burnett, Wovenhand, Jason Isbell and the Indigo Girls. We play loosely and openly embrace new twists and turns to folk music. We're definitely not oldtimer style!\n\n**4\\. London Chinese Music Instrument Meet up:** Private session. Interested players committed to performing and long term playing are welcome to enquire. From time to time we invite new members.\n\n**5\\. World Music \\[Acoustic\\] Meet up:** open to anyone who plays or sings (ethnic) world music acoustically. First meeting scheduled for Sunday 3rd May 2022 @ 2pm\n\n**Email: thefilmatelierse6@gmail.com**",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "35613159",
        "name": "Script Camp UK/Ireland",
        "link": "https://www.meetup.com/scriptcampuk",
        "description": "Welcome beginning and experienced screenwriters! We host regular screenwriting bootcamps, classes, script coverage and career coaching from professional, repped screenwriter Conor Kyle. Each week there are a few live & virtual classes, workshops, Q&As and intensive 6- to 8-week bootcamp sessions that take you from idea to first draft, to polished feature screenplay or TV pilot.\n\nSome of our classes are free and some are paid. There are no membership dues or fees required to attend our free classes.\n\nThis group is affiliated with Conor Kyle's Script Camp\n\nWebsite: [https://scriptcamp.net](https://scriptcamp.net)\n\nOur classes are taught live on Discord at: [https://discord.gg/Qy3E35DZna](https://discord.gg/Qy3E35DZna)\n\nUpcoming class schedule: [https://scriptcamp.net/events/month](https://scriptcamp.net/events/month)\n\n\\*About the Instructor\\*: Conor Kyle has written for Shudder's Creepshow (2019) and placed twice in the Nicholl Fellowship with his scripts “Peter and the Wolves” (quarterfinals, also Launchpad top 10) and The Tube (semifinals). His screenplays have also been featured on the annual Hit List, Young & Hungry List, Spec Book, and on Tracking Board’s “Best Writers of the Year” booklet. He writes everything from stage musicals to Westerns to horror movies. Watch Conor's previous classes on [Twitter](https://twitter.com/TheScriptCamp), [YouTube](https://www.youtube.com/channel/UCHTkV9mxO1_wqfUsoGe7mXg) and [Twitch](https://www.twitch.tv/scriptcamp)",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "260141",
        "name": "London Writers' Café",
        "link": "https://www.meetup.com/londonwriterscafe",
        "description": "**Dear writers, hello! If you're in need of a fiction writing group of like-minded individuals for writing encouragement, advice and support, congratulations you've found it.** \nAt its heart, London Writers' Cafe gives emerging fiction writers a place to find writing support and development for their novels, short stories and scripts. Join us and learn more about finding the right publisher, the motivation to write more frequently, editing your own work, story structure, and become more confident through our professional talks, critique and craft workshops with authors, editors and agents.\nOur writers are in the process of writing fiction at every stage so it doesn't matter if you've been writing for years, or just a few short months, we're here for every kind of writer and we'd love to meet you.\nLastly, we don't believe in groups where everyone is forced to contribute/offer feedback \\*shudder\\* so we'll never pressure anyone to read before they're ready. Read more from Lisa on [what makes a quality writing group](http://www.publishingtalk.eu/writing/thinking-of-joining-a-writing-group-ask-yourself-these-8-questions-first/). \nWe were founded in June 2006 in a lovely pub near Liverpool Street with only a few members and now we're a bustling community of 3,800+ members. **NOTE: All membership requests are reviewed by Lisa or Elizabeth before approval so please answer the questions we've asked in a sentence or two. You can do better than one word answers.**\n\n**Group feedback, writing advice & writing sessions** \nIn our regular CREATIVE WRITING WORKSHOPS, writers volunteer to read up to 3,500 words in a friendly, relaxed atmosphere. Reading spaces are 30 minutes long; time enough to read and hear feedback from the group. Feedback is moderated so it's practical, constructive and encouraging and we're not in the business of killing dreams. We're here to give each writer a place to improve their skills as a storyteller.\nWe also host regular WRITE TOGETHER sessions where it's all about getting words on the page and we offer quick exercises and writing prompts for those of you who need a kick up the bum.\n**Talks, workshops & socials with publishing professionals**\nIn addition to creative writing critiques and writing together sessions, we host an array of professional seminars and technical writing workshops on elements of craft and creative process i.e. characterisation, pacing, plot, tension and much more that are taught by literary agents, editors, book doctors, script writers and publishers. \nWe're also known for our memorable social events and parties. \nWe hope to meet you very soon and happy writing!\nLisa & Liz \nFollow on Twitter for more about us. We are: @LisasShare @ElizabethWaight \n\\*\\*\\*\n**Socialise with us**\nTweets about writing, publishing and competitions: [https://twitter.com/LDNwriterscafe](https://twitter.com/LDNwriterscafe)\nSee our pics on Instagram: \n[https://www.instagram.com/londonwriterscafe/](https://www.instagram.com/londonwriterscafe/?hl=en)\nThe place to find links to competitions, writing opportunities and invitations to submit on our Facebook group:  [https://www.facebook.com/groups/ldnwriterscafe/](https://www.facebook.com/groups/ldnwriterscafe/)\n\\*\\*\\*\n**A note about advertising, competitions and promotional requests:**\nIf you'd like to promote a competition, paid writing job or publishing opportunity to our writers, email us via londonwriterscafe[@]gmail[.]com\nNOTE: All proposals are reviewed by Lisa on their suitability for our writers, and many are rejected because they don't match their needs, but posts we love are shared on with delight. Please see our Twitter @ldnwriterscafe for examples of things we've shared. Thank you.",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "32729382",
        "name": "Shut Up & Write!® London",
        "link": "https://www.meetup.com/shutupandwritelondon",
        "description": "We’re looking for hosts to start more in-person events! Go to [https://shutupwrite.com/organizers](https://shutupwrite.com/organizers) to sign up.\n\nFor online events, check out our Online Events Meetup at [https://www.meetup.com/shutupandwriteonlineevents](https://www.meetup.com/shutupandwriteonlineevents).\n\nShut Up & Write hosts free in-person and online writing events for writers all over the world. Our goal is to ensure that every writer, regardless of genre or skill level, has access to the community, accountability, and resources they need to be successful in their personal writing goals. Our events use our proven formula: a few minutes of introductions, an hour of focused writing, and a final check-in to share the hour's progress.\n\n**What to Expect**\n\nRSVP and please arrive 10–15 minutes early to get settled at an in-person event. Our host will lead introductions and then everyone will write for a quiet, focused period of time.\n\nAfterward, feel free to get to know each other. Members often talk about their successes and challenges as writers. Our events are a safe space for writers to work on their craft. No one will read or critique your writing.\n\nFor more information, visit [https://shutupwrite.com](https://shutupwrite.com/), or email us at [questions@shutupwrite.com](mailto:questions@shutupwrite.com). To learn more about our events, check out our Getting Started Guide at [https://shutupwrite.com/getting-started-guide](https://shutupwrite.com/getting-started-guide).",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "20595541",
        "name": "Creators Write Club",
        "link": "https://www.meetup.com/london-write-club",
        "description": "**Welcome to Creators Write Club!**\nEverybody Writes!\n\nWe've been meeting weekly (apart from 2020/21 COVID lockdowns) since 2014.\n\n**What is Creators Write Club?**\nWrite Club is where you can write **anything** from a book chapter to a work email to a song or comedy script.\n\nPeople write academic papers, podcast show notes, pitches, film documentaries, social media posts and project plans.\n\n**Who comes to Creators Write Club?**\nEvery week authors, freelancers, artists, academics, comedians, gamers, marketers, bloggers, developers, podcasters, event managers, musicians, poets, lawyers and sailors gather around a table with one goal - to work on their writing for two hours.\n\n**How does Creators Write Club work?**\nCome and be ready to share what you intend to work on in the session.\n\nWe'll all write for around two hours and check-in again at the end, so share our progress.\n\n**That sounds scary?!**\nWe make extra effort to make sure everyone feels welcome and can do their work.\nYou only need to share what you are comfortable with sharing.\n\nThis group has always been relaxed, open and supportive.",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "19027733",
        "name": "London Science Fiction & Fantasy Writers' Group",
        "link": "https://www.meetup.com/science-fiction-fantasy-writers-group",
        "description": "<p><strong>Spectrum: The London Science Fiction &amp; Fantasy Writer's Group</strong> is a group of active writers in the Science Fiction, Fantasy, Horror and other speculative fiction realms, who get together to critique each others work, share knowledge, and generally encourage one another. Members are serious about their writing, open to honest criticism, and willing to offer critical insight to their fellow writers.</p><p>You can find our website at <a href=\"http://www.spectrumwriters.com\" target=\"_blank\">www.spectrumwriters.com</a></p><p><strong>Who this group is for:</strong> writers of speculative fiction working on short story, novel and similar formats, including the odd poem. We have the occasional screen writer, but note this group primarily focuses on the published format.</p><p><strong>Who should attend:</strong> both aspiring and published authors are welcome. It is a great arena to workshop your story, find out what is working, what might not be, and to gain insight from members with a wide range of perspectives and backgrounds.</p><p><strong>How often we meet:</strong> we are entirely online at the moment, using our very own Discord server for most of our activities. Critique meetings take place every two weeks, and we have monthly special events and daily write-together check-ins.</p><p><strong>What is expected of you:</strong> every meeting will have a work submitted by one or two members. The submission is usually a chapter from their novel or a short story. Members are expected to read the submission before attending, with an eye toward providing constructive feedback to the author. Each member will be given approximately 2.5 minutes to provide feedback, and can also provide the author with more detailed written comments as well.</p><p><strong>What you can expect:</strong> to get motivated and inspired, to improve your craft, to build confidence in your own work, to network with others, to learn about the publishing industry, and to have fun doing it!</p><p>For more details on how the group works, check out our website, and join our Discord server. See you there!</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "29480246",
        "name": "A WRITE & A PINT",
        "link": "https://www.meetup.com/write-and-pint",
        "description": "<p>Write and Pint is a warm and friendly social group for writers and non-writers alike. </p>\n<p>It's a relaxed creative writing workshop and a great opportunity to get to know new people by sharing creative ideas over a drink ( ... or two).</p>\n<p>We hold our sessions once a week in the upstairs room of one of London’s most historic and characterful pubs.</p>\n<p>Come inside (6:30pm) and get yourself a drink at the bar. Make your way upstairs and find a seat (7:00pm). Say hello to some lovely people, help yourself to the free snacks, then get out your notebook and pen and let the ideas flow with the beer/wine/lime and soda.</p>\n<p>Your session leader, Sean, is an experienced creative writing teacher with a degree in creative writing, a masters in literature, and fair bit of experience drinking good beer! </p>\n<p>Sean will take you through a series of quick, fun writing games and exercises that will help your writing flow.</p>\n<p>You’ll never have to read your work in front of the group. You can just relax. The focus here is on fun. </p>\n<p>If you're a serious writer, the sessions are also great for finding new inspiration and mining for new ideas.</p>\n<p>But no previous experience of writing is necessary. So if you haven’t put pen to paper in a creative way since primary school, this group is for you, too. </p>\n<p>At the end of each session you’ll go home with that lovely warm feeling that comes from sharing a drink and some new ideas among friends. </p>\n<p>You’ll also have a free Penguin book to take home with you to give you extra inspiration between sessions.</p>\n<p>If you like, you can even join the crew afterwards for a drink and a chat in the pub downstairs before you go home. </p>\n<p>Can’t wait to see you there.</p>\n<p>Cheers!</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "31196132",
        "name": "The Creative Writing Club | Hampstead & Highgate",
        "link": "https://www.meetup.com/hampstead-writers",
        "description": "We're a bunch of writers in Hampstead and Highgate who meet to exchange constructive feedback, socialising in the process.\nThe format: Those who want to share bring paper copies of their work to hand out. We read around four pieces. Each person has 30 minutes for reading and feedback (15 reading, 15 feedback). Try to arrive a bit earlier to meet the group, if you like. Don't forget your pen, so you can write down feedback!\nWhat to bring: We find 1500 words is about right, 2000 absolute max. Please format the text to Times New Roman, size 12 font, double spaced, for ease of commenting.\nAfterwards, those who want to stay for some socialising are most welcome.",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": true,
        "isNewGroup": false
    },
    {
        "id": "26429535",
        "name": "The Writers Initiative",
        "link": "https://www.meetup.com/the-writers-initiative",
        "description": "<p>A group where creative writers can gather to further cultivate their craft of fictional and non fictional writing. All are welcome from beginners to those with great experience.</p>\n<p>Meet-ups will cover different topics and be in held in different formats. Where attendees will further learn or share on how to engage, project and evoke desired emotions or interests with their readers.</p>\n<p>The idea for the group has come from not just improving and learning writing skills, but also to engage with other writers and enjoy the practice of creative writing. Writing can be challenging and feel hard work at times, but it is the writers initiative to push her or himself forward for what ever targets their have in mind. &lt;br&gt;</p>\n<p>Meet-ups will be held in or around London - and will mainly be on the Southbank or somewhere in central London. I also have plans for doing some over skype, so you can join from home.</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36323221",
        "name": "Women of Colour Science Fiction & Fantasy Writers Group",
        "link": "https://www.meetup.com/young-womens-science-fiction-fantasy-writers-group",
        "description": "Hello if you're reading this!\n\nI want to create a small group of, ideally, London based female SFF writers!\n\nThe writing journey is often started in isolation but is always richer when experienced with like-minded people who understand those midnight bursts of passion, frustrations with revisions or people who just get you and share the same dreams to publish.\n\nIf you're a woman of colour and an SFF writer who would benefit from support and friendship from like-minded women. Please consider joining! \n\nI'm open to suggestions for how we manage our time but ideally an in-person meet up where we can take a moment to destress from the pressure we put on ourselves as writers and get to bond with other nerds is what I'm hoping to create here! \n\nAs well as a place to receive writing feedback, advice and support. \n\nI'm open to all ages : )\nI'm 21 and based in London!",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "16102212",
        "name": "Greenwich Writers",
        "link": "https://www.meetup.com/greenwich-writers-group",
        "description": "<p>Greenwich Writers' Group is for adults (18+) interested in creative writing, living in or around the London borough of Greenwich. Writing can be an isolating process so this group has been set up to connect like-minded individuals. Meet-ups involve critiquing each other's work, discussing writing matters and upcoming competitions. We also have Saturday meetups where we simply bring a laptop and write in each other's company. As an aid to getting published we arrange meetups with Agents from time to time.&nbsp;</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "23805602",
        "name": "Green Ink Writers' Gym",
        "link": "https://www.meetup.com/writersgym",
        "description": "<p>Creative, practical and inspiring workshops and courses for every stage of Creative Writing, Rewriting and Editing. Build your skills, confidence and creative network and keep the momentum and sense of fun to guide you and your writing from ‘work-in-progress’ to ‘the end’.&nbsp;</p>\n<p>Freelance writer and teacher Rachel Knightley's sessions will help you make the most of your writing voice and find the space and time to make writing a regular habit in your life. Each workshop provides a mix of stimulus, exercises, discussion, feedback and classic and modern examples from across the literary genres.&nbsp;<span>Boost your writing, confidence and word-count with new skills and new writing friends.&nbsp;</span></p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "29861393",
        "name": "Caversham Writers",
        "link": "https://www.meetup.com/caversham-writers",
        "description": "<p>This is a group for anyone interested in writing and meeting other writers in the Caversham and wider Berkshire area. For our online meetings, we also welcome members globally.</p><p>All skill levels are welcome - published or unpublished, aspiring authors or enthusiastic hobbyists. We have members that write in all genres, so whether you write fiction or non-fiction, poetry or prose, fantasy or reality, you will fit right in.</p><p>We currently hold meetings in 4 different formats:</p><blockquote><strong>Writing Meetings</strong>. In which we'll either work on (or start) any writing project of our own choosing, or we'll set a theme or prompt for all to use as a starting point.</blockquote><blockquote><strong>Feedback Meetings</strong>. In which we'll provide feedback on excerpts of members work, either submitted in advance or read out to the group on the night. Feedback should be constructive, encouraging, and tailored to the author's directed instruction.</blockquote><blockquote><strong>Writes &amp; Bites</strong>. In which we meet for a social evening, usually at a local restaurant. No writing involved in these events, they are an opportunity to get to know each other better and, of course, to discuss all things writing.</blockquote><blockquote><strong>Writeshare Night</strong>. In which members get 10 minutes to read out some of their work to the group and get some spontaneous, first impression feedback.</blockquote><blockquote>We also have occasional one off special events, such as literary festival talks, book signings, launch parties, or author Q &amp;As. </blockquote>",
        "city": "Caversham",
        "state": "03",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "29515770",
        "name": "Write for your Life - Creative Group Journaling",
        "link": "https://www.meetup.com/life-writing",
        "description": "In creative group journaling workshops we use free-writing and discussion to explore different themes, for self-discovery, fun and creativity. Past workshops have had us describing ourselves as a sculpture, setting our theme for the year, creating new days of the week, exploring time and how you can’t waste it going forwards, wondering what happened next to the hare and the tortoise, and much more.\nUsing free-writing gets our pens moving. It can give us headspace, uncover different perspectives and sometimes surprising insights. It’s a lovely way to celebrate your ‘you’-ness, especially when shared with others. It helps us to see that we’re all in the same boat and gives us inspiration and encouragement. It can also surface creative nuggets and be a lot of fun. Yes, we’re allowed to have fun and write.\nWriting can be insightful, and we might share things we write (always optional), but please note, this is not a therapy group and isn't suitable for replacement of individual/group therapeutic work.\nFor more information, please go to [cpsdayoff.com](https://www.cpsdayoff.com/).\n**About Me**\nI’m a Facilitator and Coach who helps people find, come back to and express themselves through writing. I've been running writing workshops and coaching since 2018. \n\"The lovely Claire led the session, giving us a prompt and then setting us loose on the page for five minutes of free writing. Each of us read out our pieces at the end of each five minute writing slot (always optional), and it was amazing the range of thoughts and images that were produced. I’m not intending to use any of those pieces for another project. They existed in that moment and I’m glad to let them go. They reminded me of the joy of simply writing, going wherever my mind takes me, and not worrying about form, function, content or purpose. I will definitely be going back when I can, and I very much look forward to more random exercises in brain splurging with Claire and the other members.\" \n\"I have attended several sessions now and have left each time feeling inspired by what emerged from such simple prompts: so unexpected the different directions taken by each of us and so lightly held that we each felt safe to share or not each time...\"\nFor more testimonials, go to: [https://www.cpsdayoff.com/testimonials](https://www.cpsdayoff.com/testimonials)",
        "city": "Fleet",
        "state": "F2",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "22691224",
        "name": "The New Machine (Creative Writing)",
        "link": "https://www.meetup.com/the-new-machine-creative-writing",
        "description": "<p><span><b>THE GROUP</b></span> <br></p>\n<p>The New Machine (Creative Writing) is not just a workshop. It is a unique opportunity.&nbsp;</p>\n<p>Unlike detached, institutional writing programmes, it is a friendly space for writers to connect and stay connected: it is a regular FREE social event, a day of focus, a 5-week course, a platform for novel writing, a platform for short-story writing, a retreat for novelists, a day of poetry, etc., etc.</p>\n<p>The New Machine is a place for absolute beginners, as well as intermediate- and advanced-level writers.&nbsp;</p>\n<p>It is a commitment to you: a group you can attend and never read aloud if you don’t want to.</p>\n<p>It is a small class (*8 people, max.).&nbsp;</p>\n<p>It is you learning about narrative perspective, dialogue, tone, and narrative arc.&nbsp;</p>\n<p>It is automatic prose, in the surrealist style. It is the “Proustian Questionairre”, the profile, the hero’s quest of character-led fiction.</p>\n<p>It is a hook for the reader, the art of conflict, the dark nights and the bright mornings of plot-driven prose.&nbsp;</p>\n<p>The New Machine is literary; it is you writing science fiction, action fiction, romance, thriller, adult, and/or children’s.</p>\n<p>It is about *you* working on *your thing*.&nbsp;</p>\n<p>It is getting 1-to-1 feedback from a committed tutor and a group of&nbsp; dedicated peers.&nbsp;</p>\n<p>The New Machine is cost-effective. It is undercutting bigger institutions by half.</p>\n<p>It is an opportunity to sit in a café, to use the pomodoro technique: a structure and a discipline to get your writing done. &nbsp;</p>\n<p>It is an invitation to publish your work in an online journal.&nbsp;</p>\n<p>It is for you, getting closer, to you honing your craft, to you transcending the obstacles you need, to manifest publication.</p>\n<p>The New Machine (Creative Writing) currently offers the following MeetUps:&nbsp;</p>\n<p>A regular FREE social event (every 5 weeks)</p>\n<p>A Tuesday evening “Taster Class”</p>\n<p>**POD-1 (a 5-Week Beginners’ Course in Short Fiction Writing)&nbsp;</p>\n<p>POD-101 (a 5-Week **Character-Led** Course in Novel Writing)</p>\n<p>POD-202 (a 5-Week **Plot-Driven** Course in Novel Writing)</p>\n<p>A DAY OF POETRY (a 4-hour session in the poetry basics / writing poetry, for beginner- to intermediate-level writers)</p>\n<p>POETRY OF THE CITY (a 4-hour poetry session in reading, writing, and discussing poetry in the urban space).</p>\n<p> <br></p>\n<p> <br></p>\n<p>POD-1:</p>\n<p>This is a 5-week beginners’/crash-course in how to write good prose. It will focus on “Character Development and Plot” (week 1), “Perspective and tone” (week 2), “Dialogue + feedback” (week 3), “The Question + Feedback” (week 4), and “Where to go from here + Feedback + the Opportunity for Publication” (week 5).</p>\n<p> <br></p>\n<p> <br></p>\n<p>POD 101:</p>\n<p>This is a 5-week course in how to write a novel. It is a character-driven approach and is a counterpart to the plot-driven POD-202. In this course (POD-101) you will focus on “Stasis + Trigger / Inciting Incident / Chapters 1 &amp; 2” (week 1), “Dialogue / The Quest + Obstacles to Overcome /&nbsp; Chapters 3 &amp; 4” (week 2), “Midpoint / Rising Action / Surprises / Chapter 5 &amp; 6” (week 3), “Feedback on your work so far / Critical Choice / Climax / Chapters 7 &amp; 8” (week 4), Feedback / Reversal / Denouement / Chapters 9 &amp; 10 (week 5).</p>\n<p> <br></p>\n<p> <br></p>\n<p>POD 202:</p>\n<p>In this 5-week course, you will learn how to outline, plot, and structure a novel. POD-202 is a compliment to POD-101. Once you know how to construct a good, believable character, you can write you novel by plot and structure (or vice versa). In this course, you will focus on the fundamentals of good storytelling: “What makes a good story? / Premise (Week 1), then (once you have chosen your premise and hooked your reader) “How to generate conflict” (Week 2), “The keys to a satisfying climax” (Week 3), “How to flesh out the chapters of your outline” (Week 4), and “Putting everything together / Getting feedback on your outline” (Week 5).</p>\n<p> <br></p>\n<p> <br></p>\n<p>DAY OF POETRY:</p>\n<p>This is a 4-hour day, designed to introduce you to the basic elements of writing poetry, such as line breaks, stanza formation, rhythm, rhyme and free verse. By the end of the day you will have a handful of your own poems to take home with you.</p>\n<p> <br></p>\n<p> <br></p>\n<p>POETRY OF THE CITY</p>\n<p>This is a 4-hour day, designed to introduce your to some of the best city poetry, including poems by Frank O’Hara, Sharon Olds, Ted Hughes, and Erika Meitner. By the end of the day, you will have a small handful of your own “city poems” to take home and work on.&nbsp;</p>\n<p> <br></p>\n<p> <br></p>\n<p>ETHICS:</p>\n<p>The New Machine is proud to offer a writing and critique culture that is fundamentally supportive. Whilst it aims to cultivate incisive, critical feedback, the emphasis here is on friendly, positive discourse. Writers of all abilities and experience levels are welcome. Very often, professional creative writing institutions require their participants/customers to present or to read their work aloud. The New Machine is respectful of the quiet, less vocal writer: he/she who would like the critical feedback of his/her peers, but without having to face the perils of large, intimidating classes or pitching work to an audience.</p>\n<p> <br></p>\n<p> <br></p>\n<p>ABOUT THE ORGANISER:&nbsp;</p>\n<p>Sean is 33 years old. He graduated from Goldsmiths University in 2013 with a Distinction-grade MA in Comparative/World Literature. Prior to this, he studied English and American Literature &amp; Creative Writing at the University of Kent, where he managed to attain a 1st Class BA.</p>\n<p>As a reader, Sean is interested in 20th Century modernism, existentialism and postmodernism. However, he has also studied (and continues to enjoy) things as various as Shakespeare, Romantic poetry, 19th Century English, French and Russian literature, Post-Colonial Literature, and 21st Century American. Some of his favourite works are: The Double/The Gambler by Fyodor Dostoevsky, The Trial/The Castle by Franz Kafka, Bliss (and other stories) by Katherine Mansfield, The Love Song of J Alfred Prufrock by T. S. Eliot, The Great Gatsby by F. Scott Fitzgerald, The Outsider, by Albert Camus, Bonjour Tristesse by Francois Sagan, The Story of the Eye by George Bataille, David Golder by Irene Nemirovsky, Krapp’s Last Tape (and many others) by Samuel Beckett, In the Heart of the Country by JM Coetzee, Fantasia by Assia Djebar, and The Crying of Lot 49 by Thomas Pynchon.</p>\n<p>When Sean isn’t being pretentious and overly literary, he also enjoys action movies, thrillers, dramas, TV, cinema… and all kinds of narrative!</p>\n<p>Sean is currently working on his own short stories, a number of poems, and a novel.</p>\n<p> <br></p>\n<p> <br></p>\n<p> <br></p>\n<p>*Other creative writing classes tend to consist of between 12 – 15 people and can be more intimidating/less focused.</p>\n<p>**A “POD” is the name given by The New Machine to the group of 8 people; it is not an actual, physical pod!</p>\n<br>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36065448",
        "name": "Write Together North London",
        "link": "https://www.meetup.com/destiny-club-improve-your-health-luck-and-opportunities",
        "description": "**Write Your Story**\nWhat do you need to share with the world? \nAre you struggling to just sit and concentrate? \nA book? Essay? Play? A letter?\n\n**Write It Together**\nWrite it whilst socialising with other writers. \nGet inspired by the progress of others and get pushed along by other aspiring writers. \n\n**Learn From Pros**\nGet tips from writers/writing teachers/agents and publishers who will speak/teach at the start of events.",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "34838813",
        "name": "Women Writing Fantasy",
        "link": "https://www.meetup.com/women-writing-fantasy",
        "description": "<p>Women Writing Fantasy is for all women interested in writing fantasy novels, whether it be Young Adult, New Adult or Adult.</p><p>In our meet-ups we discuss our plots, characters and writing techniques. We encourage and support each other, brainstorm to overcome writer's block, and provide feedback and critique where needed. We also have writing sessions to ensure we put our money where our mouth is.</p><p>Meet-ups currently take place online, though we do hope to host some in person sessions in London soon!</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": true,
        "isNewGroup": false
    },
    {
        "id": "1828171",
        "name": "Write Together",
        "link": "https://www.meetup.com/writetogether",
        "description": "<p>Writing can be difficult and lonely. Sometimes we need to get out and away from our own distractions and excuses. Pubs, cafes and parks are nice but wouldn't it also be good to be part of a group of writers? So let's work quietly together, gently encouraging each other to soldier on, and minding each others things when we have to go to the loo... <br> <br> <strong>THE IDEA</strong> <br> Is simple. We are a group of serious writers that meet somewhere comfortable and write for 2, 3 or 4 hours straight. Each person works on their own and sets their own targets. What you write is entirely up to you. But here is the difference: you are not alone. Others are around you, typing, scribbling or looking out into the distance. Their company will help you stay focused, stop you from drifting, and keep on writing. <br> <br> <strong>MEMBERSHIP REQUIREMENTS</strong> <br> * A profile photo, preferably a real one <br> * A brief description of yourself <br> * A very short answer to the Micro Fiction question. Just a sentence or two. It shows us who's serious enough to give it a try and thus be more likely to attend meetings. <br> <br> <strong>PART 1: WRITING SESSION</strong> <br> This is the serious part of the meeting and we have strict rules to promote writing: <br> * Distractions must be kept to a minimum, so no mobile phones or talking. Just pretend you're in a library. Sssh! If you really have to be noisy then do it away from the group. <br> * Writers work on their own projects. No sharing or judgement of work. You measure your own progress and success. <br> * This is not a critique group. This is not a workshop with teachers/mentors or writing exercises. <br> * The show must go on! If the host is a no show then find other writers and get writing. There are no excuses for not writing. <br> * Keep your RSVP updated. It makes it a lot easier for hosts (who may be reserving tables). No shows will be recorded and possibly banned. <br> * When events are at a commercial venue (e.g. cafe or pub) buy something, anything to make us welcome there. Think of it as a venue hire fee. DO NOT bring your own food &amp; drink. This makes us look really bad. <br> <br> <strong>PART 2: SOCIAL (optional)</strong> <br> Whether this happens depends on the host. Check the event details. This is when you are free to talk, socialise and share experiences with fellow writers. Almost anything goes. It is also perfectly acceptable to come just for the writing and leave politely straight after. Your writing always comes first. <br> <br> <strong>WHAT YOU NEED</strong> <br> Bring your unfinished project e.g. novel, short story, screenplay, poem etc. <br> Bring pen &amp; paper, computer or whatever you like using. If it's electronic please check the battery will last because venues might not have power sockets available. <br> <br> <strong>MOTIVATIONAL RANT (in case you need it)</strong> <br> Writing doesn't happen by itself. It's a constant battle against procrastination, distractions and \"I'm too tired/busy/bored etc.\" Resist all this and commit to your passion. Attend our meetings as often as possible. They do get easier and you will get better. Just ask our members. <br> <br> I don't know how long these meetings will run for. They are free and we do it because we love writing. Do not take them for granted. Do not miss opportunities to attend. This is completely for you. I say this to push you a little. It feels wonderful to call ourselves writers, but let's not forget to do the writing. <br> <br> <strong>GROUPS <br> </strong> WriteTogether started in London and has inspired others across the globe: <br></p>\n<p>•&nbsp;<a href=\"https://www.meetup.com/WriteTogetherPerth/\">Write Together Perth</a><span>&nbsp;Australia</span></p>\n<p><span>•&nbsp;</span><a href=\"http://www.meetup.com/Write-Together-Sydney/\">Create Together</a><span>&nbsp;Sydney Australia</span></p>\n<p>•&nbsp;<a href=\"http://www.meetup.com/Pen-and-Note/\">Pen and Note</a><span>&nbsp;Osaka Japan</span></p>\n<p><span>•&nbsp;</span><a href=\"http://www.meetup.com/Write-Together-Tokyo/\">Write Together Tokyo</a><span>&nbsp;Japan</span></p>\n<p>•&nbsp;<a href=\"http://www.meetup.com/JustWriteIt-Tokyo/\">Just Write It - Tokyo</a><span>&nbsp;Japan</span></p>\n<p>•&nbsp;<a href=\"http://www.meetup.com/Montpellier-Creative-Writing-Montpellier-Ecriture-Creative/\">Montpellier Creative Writing</a><span>&nbsp;France</span></p>\n<p>You are welcome to start your own group and copy our text. All we ask is that you mention and link back to us, and send me your URL so that I can add it above :o)</p>\n<p><strong>BEING A HOST</strong> <br> Writers want to write as much as they can. Let's make it happen. With such a simple idea, it should be possible for lots of hosts to run regular meetings all over the place. The more choices the better. Read this page about <a href=\"http://www.meetup.com/WriteTogether/pages/Event_Host/\">becoming a host</a>.<strong> <br> <br> DONATIONS</strong> <br> <a href=\"https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&amp;hosted_button_id=PHXGSZHR5EHKS\">Donate</a> to help cover our Meetup subscription and keep the free events running. Our <a href=\"http://www.meetup.com/WriteTogether/money/\">financial records</a> are publicly available.<strong> <br> <br> QUESTIONS/PROBLEMS</strong> <br> We want these meetups to be enjoyable and productive. If any problems arise or you have an idea to share, please message me. <br> <br> </p>\n<p>Warm regards and good writing, <br> Joao</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": true,
        "isNewGroup": false
    },
    {
        "id": "36409836",
        "name": "Become a business author",
        "link": "https://www.meetup.com/become-a-business-author",
        "description": "This group is for you if you are a business person who wants to share your expertise with the world by writing your business book. Maybe you've just decided to do it or maybe you've been thinking about it for a long time. \n\nIf you're stuck on where to start, or you've started and ground to halt, then why not come along and find out what you need to get going. \n\nGet more ideas on how to make your book work for you and your business. Understand more about your publishing options. Talk to other aspiring business authors. \n\nThese 1-hour meetings will be a chance to ask questions and exchange ideas.",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36023284",
        "name": "Creative Writing for everyone",
        "link": "https://www.meetup.com/creative-writing-for-everyone",
        "description": "Welcome writers! I started this group to meet other writers and talk about all things writing-related. You are welcome to join, no matter what genre you write in or how much experience you have.\n\nIt's a friendly and informal group. \n\nWe hold free weekly discussions on a Monday evening, on zoom. I look forward to seeing you there.\n\nPlease note the zoom link is sent out on Sunday evening by meetup message, so please be sure your settings allow you to receive it. \n\nThe meeting link changes every week, and the meetings require zoom authorisation - you have to sign in to zoom to access it. \n\nPlease contact me if you have any questions.",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "19780637",
        "name": "Write & Shine - morning writing events",
        "link": "https://www.meetup.com/write-and-shine",
        "description": "<p><span>Start your day with a burst of creativity!</span></p>\n<p>Write &amp; Shine morning writing workshops, retreats, events and online courses are open to everyone, whether you’re new to writing, have some experience or simply want more creativity into your working day. The programme is led by writer Gemma Seltzer who says, \"I set up this group because I love meeting and writing alongside fellow writers. I wanted to create a friendly atmosphere for writing, outside of academic or institutional programmes.\"&nbsp;</p>\n<p>Rather than share the work we produce in a Write &amp; Shine workshop, we focus on generating new material and tapping into our imaginations in the morning. The chance for feedback from the tutor and other writers can help improve writing, but for some writers it can damage confidence or hinder creativity. After each workshop, you'll leave with a few pieces to develop in their own time.</p>\n<p>We find inspiration from modern life and the seasons, while exploring the craft of writing. Research shows we’re more creative in the morning. When we wake, we’re incredibly sensitive to the sights and sounds of our environment. Join us to discover why this is the best time to think, dream and imagine.</p>\n<p><span>Learn more at:&nbsp;</span><span><a href=\"https://write-and-shine.com/\" class=\"linkified\">https://write-and-shine.com/</a></span> <br></p>\n<br>",
        "city": "Greater London",
        "state": "",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "25702629",
        "name": "Sutton Writers",
        "link": "https://www.meetup.com/sutton-writers",
        "description": "<p>Sutton Writers is a supportive writing community. Whether you are a budding Shakespeare or Stephen King or want to follow in the footsteps of Agatha Christie or Julia Donaldson – whatever your aspirations, you will be warmly welcomed.</p>\n<p>Our strong membership comprises both published and unpublished writers of diverse talents offering support and friendship with local monthly meetings, workshops and the chance to enter club competitions.</p>",
        "city": "Sutton",
        "state": "N7",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "11249192",
        "name": "London Bridge Writers",
        "link": "https://www.meetup.com/london-bridge-writers",
        "description": "<p>Receive constructive feedback on your writing and listen to the writing of others. Participants range from novices to well-seasoned writers.</p><p><br /></p><p><em>Format</em></p><p>Every Monday from 7pm to 9pm. We hear approximately six readings of ten minutes (~2000 words), then discuss the piece for ten minutes. We share work via googledocs. Email your work to: <a href=\"mailto:london60transmitter@emailitin.com\" target=\"_blank\">london60transmitter@emailitin.com</a> as an attachment (It must be an attachment). A link for access to googledocs will be given at the start of each session to enable people to read along. This enables more considered feedback. Work submitted will be automatically deleted after 10 days.</p><p><br /></p><p><em>Genres</em></p><p>Anything! We have novels, short stories, scripts, poetry etc. With plays and film scripts, you will often find willing participants to read the parts.</p><p><br /></p><p><em>Location</em></p><p>During COVID-19 we have been meeting online for much of the pandemic but recently have been returning to a mix of 'real life' and online meets. If one of our meet-ups listed here says 'George', then this means we are meeting for real at The George Inn on Borough High Street, and there will be no online facility for that session. If the location is listed as 'online', then it will be via Zoom.</p><p><br /></p><p><em>Safe and respectful space</em></p><p>The group is run by volunteers, and we don’t have the capacity to read submitted work in advance. If there is anything in your work that might distress or disturb some readers, for example concerning any kind of abuse, please give a trigger warning before you read. Be specific enough to prepare those who might be affected. If it becomes apparent during a reading that a piece is inappropriate, the moderator will stop the reading. In discussing others’ work, please be mindful of how you express yourself and do not use discriminatory language, even if such words feature in the piece.&nbsp;</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "35852385",
        "name": "The Beehive Poetry Club",
        "link": "https://www.meetup.com/the-beehive-poetry-club",
        "description": "<p>Calling all poets, wannabe poets and poet enthusiasts! We are The Beehive Poetry Club, a gathering of people who have written for years, those who have just started out and all those in between. Where did we get our name? Well we usually meet at the Beehive Café by Bethnal Green tube station who have kindly given us a space for free. As a community we'll be gathering to have a go at writing together, reading some of our poetry as well as socials and a mix of other literary events. Looking forward to welcoming you along!</p><p><br /></p><p><br /></p><p>COMMUNITY VALUES</p><p><br /></p><p>Thank you so much for joining The Beehive Poetry Club. We truly believe that the written word has the power and potential to inspire, to move people, to help us feel. We want to build a community where everybody gets to play and we are each other’s best champions as we explore the written word together. To help this here are some really practical community values, and in coming along to our events you are agreeing to help put our values into practice. These may develop and shape as we expand to help reflect the kind of community we want to be.</p><p><br /></p><p>1. We are all on a journey</p><p>We may have been writing for years, or not even put pen to paper. However, there are always new styles or ways of writing to try. So let us be bold in the exploration of the written word rather than think we have reached perfection.</p><p><br /></p><p>2. We are champions and cheerleaders</p><p>Reading your poetry can be really nerve-racking, especially if it’s your first time. We sometimes write from the seat of emotion and that can be scary to read to people. People might read their work and you think it is the worst piece of poetry you have ever read. We have one rule though, always cheer on, and always applaud. If you’re going to give feedback, always draw out what you love about a piece; a technique, a phrase, an image and always phrase constructive criticism as a suggestion ‘have you thought about using this technique…’ That way if it’s someone’s first time, or fiftieth we can all explore in an encouraging environment.</p><p><br /></p><p>3. We want to be risky in our writing but safe in our content</p><p>We are a community of diverse people. We want everyone to feel valued and welcomed. We all have the power and potential to create this space, and we all play our part in doing so. We want to make sure that welcome extends to the content that we write. Therefore, we don’t want people to bring anything overtly offensive, objectifying, hateful or rude and we will stop people’s readings if this is the case as this would jeopardise the kind of space we want to create. This is not to say that you can’t write poetry that might come under that category, but what you bring to the group needs to help in creating a place of welcome. If you’re not sure, you can always speak to an organiser. We want people to feel they can share their more vulnerable pieces with others. There is a fine line between writing vulnerably and over sharing. It is better to write from things you have processed and journeyed through that you feel would be appropriate to share. This is also to make sure that you are safe as you share your piece, that if people comment on it, that they aren’t commenting on your current experience.</p><p><br /></p><p>4. We want to set a bar of honour</p><p>We want to make sure that practically everything runs smoothly. Therefore to really extend the culture of honour in practical ways, we ask that you turn up on time and that you attend when you say you will. This will also help to build and foster community - if you’re after a community of writers, invest in the events and discussion and there is no doubt that you’ll get out what you put in!</p><p><br /></p><p>5. We want to have fun!</p><p>Exploring the written word together is really fun! We want to make sure we laugh often, and so we always want the atmosphere to be enjoyable. We all have the potential to co-create this as a community, so let’s make sure we all play our part in doing so.</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "35136981",
        "name": "Tell It Better @thelaundrette",
        "link": "https://www.meetup.com/the-laundrette",
        "description": "We are a local coffee house with a creative twist. We, as a business, believe creativity to be the key to life. Our small business is run by a creative writer who is in the process of writing a novel. She has been running writing groups for about 2 years, bringing together people all around London to write.\nThe coffee house, where the workshops will take place, is within a laundrette. Previously owned by family, it has been changed into a homely and welcoming environment.\nWe hope to organise and run many events, some in-house and some in collaboration with other groups. We hoep to welcome many people into our home and in doing so to create a space for creativity. Currently, we stock books from 2 local authors, we have look for creativity in staff, we have built a space where creativity is welcomed and encouraged. ",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "29049983",
        "name": "London Weird and Horror Writers Meetup",
        "link": "https://www.meetup.com/london-weird-and-horror-writers-meetup",
        "description": "<p>Welcome to the London Weird and Horror Writers Meetup.</p>\n<p>We're a casual group interested in writing, discussing and analysing weird and horror fiction. Think Lovecraft, Poe, M.R. James, Aickman, Jackson, Carter, VanderMeer and many more.</p>\n<p>If your reading this, congratulations the groups just starting with no defined structures as yet. The regular meetup will be centered around discussing member's short stories, providng feed back and chatting round the issues that come out of them. The rotation of stories and other activerties are still very much in flux and input will very much be the subject of our intial meetings.</p>\n<p>We'll be meeting in a central London pub and there is a strong social element to the evening, so please stick around for a drink and a chat once the literary discussion is over.</p>\n<p>Look forward to seeing you there.</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "31884519",
        "name": "Royal Borough Writers",
        "link": "https://www.meetup.com/meetup-group-nkevxkxs",
        "description": "We are a Writing Group based in the Royal Borough of Windsor and Maidenhead. We are a friendly, relaxed group - offering support and advice (particularly to severe procrastinators!) The group's activities are reflective of the desires of our members therefore we are open to changes.\n\nAll writers welcome here, amateurs to professionals, in any genre or format.\nWe are currently operating online and in person, meeting twice a month. \n\nNew people are welcome and we're happy for you to attend up to three meetings before deciding if you'd like to become a member. After which, a small admin fee is due.",
        "city": "Maidenhead",
        "state": "B9",
        "country": "gb",
        "isPrivate": true,
        "isNewGroup": false
    },
    {
        "id": "36352142",
        "name": "Bromley Writing Meetup",
        "link": "https://www.meetup.com/bromley-writing-meetup",
        "description": "This meet-up is for writers in Bromley, whether you are published, working on a project, or just getting started.\n\nIt is open to people living in the town of Bromley and nearby surroundings.\n\nThe group is for anyone who enjoys writing: all are welcome. Similarly, any kind of writer can join. Poetry, fiction, non-fiction, memoir, academic...\n\nThe meet-up will have online and in-person events. These will start monthly, and hopefully become more often. If you are interested in hosting a particular meeting, please get in touch.\n\nAt the meetings you can:\n\n\\- discuss your journey as a writer\n\\- swap and critique work\n\\- find accountability buddies and critical friends\n\\- simply get some writing done\\!\n\nIf you're interested in being a host and helping run this group, please send me a message! :)",
        "city": "Bromley",
        "state": "G5",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "33175565",
        "name": "London Writers' Meetup",
        "link": "https://www.meetup.com/london-writers-meetup",
        "description": "The London Writers’ Meetup is a friendly, informal get-together for screenwriters, novelists and playwrights to meet once a month, network and chat about writing. Our lofty aim is to…\n\\- Hold each other accountable to our writing goals\n\\- Share tips about how to develop good writing habits and overcome procrastination\n\\- Share knowledge – about courses we’ve been on\\, books we’ve read\\, about how best to sell ourselves and our work and which publishers\\, producers\\, agents and schemes are currently accepting work\n\\- Support each other through our blocks and crises of confidence\n\\- Discuss our ideas\n\\- And last but not least\\, celebrate our successes and commiserate our failures\nWe’re stronger together, so come along and join us for a drink and a chat.\nDon’t be afraid to come on your own, we will welcome you in.\nWe meet the 2nd Tuesday of the month from 7.30pm via zoom or Google Meet.\nIf you fancy it, just RSVP and come along.\n\nAbout Us\nI'm Katy Segrove - I earn my living as a screenwriter (mostly writing children's animation).\nI'm also a writing coach - I run Pick Up Your Pen.\nMy focus is helping ambitious writers who are struggling to sit down and write (or sit down and sell their writing) - maybe because of self-doubt, or a block - or simply good old fashioned procrastination. Whatever it is, I get writers writing (and selling) every day. \nFind out more here: https://pickupyourpen.com/\nI also have a \\*\\*free\\*\\* 7-day course - perfect for anyone keen to kickstart a writing routine. You get a new lesson each day by email for 7 days.\nIt covers everything from generating ideas to facing your fears to setting a goal and beating procrastination.\n[https://pickupyourpen.com/newsletter/](https://pickupyourpen.com/newsletter/?fbclid=IwAR0dNB1VWA1HUZqgQaA9U8ZoX7oaR05thKdXps4SiTE2Swm4j90Pa1fU0GA)\nLooking for writing tips? I have a blog: https://pickupyourpen.com/tips/ \nI host the meetup with the wonderful screenwriter and novelist Tim Guest - https://trguest.com/",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "4026862",
        "name": "Greenwich Screenwriters Group",
        "link": "https://www.meetup.com/greenwich-screenwriters-group",
        "description": "<p>The Greenwich Screenwriters Group - <a href=\"http://www.facebook.com/groups/GreenwichScreenwriters\">www.facebook.com/groups/GreenwichScreenwriters</a>&nbsp;is a creative writing support group aimed at developing writing skills for that most difficult and brutal arena of writing&nbsp; - SCREENWRITING. <br></p>\n<p>We are interested in people who want to write for the film and television industry - or simply enjoy the challenge of writing as a hobby. Please do not join this group if you are simply interested in the cinema and want to meet up for a social chit chat. This GROUP is all about writing and reading screenplays and developing key associated writing skills - like defining the perfect log-line - and developing stories that hold water and have a fighting chance in the international screenwriting competitions that this group will be writing for.&nbsp; <br></p>\n<p>Other than writers - we would love to see thespian types who enjoy the challenge of reading screenplays around a table and joining in the following discussion sessions. And remember - the only way to develop a screenplay and grow as a writer - is to be able listen to what your story and dialogue sound like when rolled around the mouths of others. It is also about being able to take on the chin constructive criticism - and the UNDERSTANDING - that sometimes a story idea or screenplay is a dead dog and that it is important to be able to move on and develop fresh ideas. <br></p>\n<p>We will also be looking at developing polished short screenplays for the short film industry - which on an amateur and professional level is thriving in the UK and gives the amateur screenwriter the greatest chance of getting something made. <br></p>\n<p>As the group grows - I will hold sessions on software, associated literature, up-and-coming writing competitions and forums where you can park a polished screenplay, so that can be accessed by producers and agents. None of which is cheap: - so you need to get it right. I will also introduce you to professional writers and the occasional director - so that the group can enjoy talks from both amateur filmmakers and industry professionals and thus gain a greater understanding of this most bitter sweet sphere of writing - that is both wonderfully challenging and fulfilling - and equally - horribly, horribly frustrating.&nbsp; <br></p>\n<p>Still interested - then this group will be a perfect outfit to join and become a blessed band of writing brothers and sisters. &nbsp; <br></p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "20244785",
        "name": "London Screenwriting Meetup",
        "link": "https://www.meetup.com/londonscreenwriting",
        "description": "<p>Active screenwriters who gather to read and critique each other's work, exchange advice, motivate each other and make lasting connections. Members are serious about their writing, open to constructive criticism and willing to provide insight to their fellow writers.</p>\n<p><b>Who should join:</b> screenwriters –budding and experienced– who aim to get their work produced. </p>\n<p><b>Why you should join:</b> this is a great place to test your idea, see what's working and what isn't, get advice from other screenwriters and get motivated to advance.</p>\n<p><b>What can you expect:</b> a community of respectful and serious screenwriters who support one another through the tough-love of constructive criticism, who share their knowledge, advice, and experience, and who encourage each other.</p>\n<p><b>Our activities:</b> currently we organize fortnightly Screenplay Critique events to give feedback on the work of the members, and monthly Script Chat events to meet and have a chat with other screenwriters (organized through Facebook). And we are working to orginize new types of meet-ups. &lt;br&gt;</p>\n<p><b>What is expected of you:</b> for our Screenplay Critique, members are expected to read the submissions before attending the event with a focus on providing constructive criticism to the author. Members are expected to be respectful of the authors and their work.<b> &lt;br&gt;</b></p>\n<p><b>Where do we meet:</b> central London, around Bank/Monument. &lt;br&gt;</p>\n<p><b>To submit a script: </b>send a PDF to the email address on <a href=\"http://scr.im/3zna\">http://scr.im/3zna</a> . In order to submit a script, you need to attend a Screenplay Critique event beforehand.</p>\n<p><b>Join our Facebook group:</b> We only accept people from our meet up group and use it as a way to stay in touch and share film news and related media as well as organize get-togethers outside of critiques. Please come along to a meet up and talk to an admin!</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": true,
        "isNewGroup": false
    },
    {
        "id": "35916499",
        "name": "Comedy Writers & Performers",
        "link": "https://www.meetup.com/comedy-writers-and-performers",
        "description": "This group is about all things comedy - writing, performing, networking and collaboration. Writers/performers/producers all welcome, amateurs to professionals. \n\nIn particular I hope to get regular meetings happening where we can come up with ideas for and film sketches with whatever we have at hand - smartphones etc - as I've found this is the most fun and cheap way to make sketches.\n\nDonations appreciated to cover the Meetup fees.\n\nFree and unaffiliated.",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "30012985",
        "name": "Reading Poetry Writing Meetup",
        "link": "https://www.meetup.com/reading-poetry-writing-meetup",
        "description": "For people who enjoy performing and/listening to poetry.\nRegular Poetry Events in Reading:\nDreading Slam at The Rising Sun Arts Centre, Silver Street RG1 2ST on the first Sunday of the Month at 19:30 \n\nPoets Café -Open Mic and Guest Poet Readings Second Friday of Each Month 20:00 in South Street Art Centre Reading RG1 4QU.\n\nFriendly atmosphere. New poets and audience welcome.",
        "city": "Reading",
        "state": "03",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "30020875",
        "name": "SE London Creative Writers",
        "link": "https://www.meetup.com/se-london-creative-writing-group",
        "description": "<p>We are a group of creative writers who meet fortnightly to inspire and learn from each other! We include poets, novelists, playwrights, short story writers, philosophers and non-fiction writers. All are welcome.&nbsp;</p>\n<p>Meetings alternate between: FEEDBACK and WORKSHOPS. During feedback sessions, we provide a platform for detailed and constructive discussion of members' submitted pieces. Workshop sessions involve writing in a collective setting, using prompts and/or new techniques.&nbsp;</p>\n<p>We are a new group which is open to the ideas and collaboration of everyone. We are a sum of our parts. Come along and help to mould us into something amazing!&nbsp;</p>\n<p>Post-meetup socialising is also encouraged!&nbsp;</p>\n<p> <br></p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "18723632",
        "name": "All Good Bookshop Writing Group",
        "link": "https://www.meetup.com/allgoodbookshopwriters",
        "description": "<p>Writer? Interested in meeting to other writers to get thoughts, advice and encouragement? Then you'll want to come and join us.</p><p><br /></p><p>We've been running this fortnightly writing group since 2010, giving feedback, support and a safe space for discussion ever since. We're part of the All Good Bookshop co-operative</p><p><br /></p><p>We run two groups on alternating Wednesdays - one online and one in-person at the All Good Bookshop. The online one is free at 8pm. The in-person one is at 7pm and has a £5 entry fee, which goes towards venue hire and snacks/drinks.</p><p><br /></p><p>The groups usually run for two hours. People can read out their recent work, receive feedback, and also act as part of a support group offering answers to writing questions. We're constructive, considered and do our best to be straightforward.</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "32885244",
        "name": "West Hampstead Writers Group",
        "link": "https://www.meetup.com/west-hampstead-writers-group",
        "description": "<p>Whether you write fiction, non fiction, poetry or a blog, in English or in any other language, let’s meet and write for a two-hour session. &lt;br&gt;It can be hard sometimes to have the self-discipline to write at home without being distracted. We meet multiple times during the week, you can come to all the meetups or just to one, it’s up to you. Depending on the day, the location changes to break the routine. &lt;br&gt;The idea is to create a small community of writers in West Hampstead, a real fellowship to share experiences and encouragement, so even if you are late come say hi when you arrive so we can all get to know you before getting back to our writing. &lt;br&gt;Once the session is finished, we stay a little bit longer to relax and have a drink. And if you want to share your writing, we will be more than happy to give you feedback.</p>\n<p>We now have a shop! We still pay full fees on Meetup, so any profits from the shop go towards maintaining the group here. Show your support for your fellow writers:&nbsp;<a href=\"https://shop.spreadshirt.co.uk/west-hampstead-writers-group/\">https://shop.spreadshirt.co.uk/west-hampstead-writers-group/</a></p>\n<p> <br></p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": true,
        "isNewGroup": false
    },
    {
        "id": "16933542",
        "name": "London Indie Authors - Self-Publishing Better",
        "link": "https://www.meetup.com/london-indie-authors",
        "description": "Do you write, package, self-publish, market and sell your books yourself (Kindle, Kobo, Ingram Spark, Draft to Digital, etc...), in or near London?\n\nWelcome, this is the group for you!\n\nHere at London Indie Authors we discuss both the art and business of self-publishing, covering craft, marketing and sales.\n\nOur meetings:\n\\- 'Book Lab' workshops to optimize covers\\, titles and blurbs \\(marketing focused\\)\\.\nThe first Tuesday of the month at 6:30-8pm in the Queen's Head, Piccadilly: [https://w3w.co/paths.belong.down](https://w3w.co/paths.belong.down?fbclid=IwAR3pSXHDOfRXuIuDuUDORPYJPXpRcqvqmlSpoI-vQXz6elylY0m8-fTyMT0)\n\n\\- 'Write Together' events to write and then chat \\(craft focused\\)\\.\nBi-weekly from 2-4pm in the Painted Hall cafe in Greenwich: [https://w3w.co/faded.feeds.kinds](https://l.facebook.com/l.php?u=https%3A%2F%2Fw3w.co%2Ffaded.feeds.kinds%3Ffbclid%3DIwAR24fZ0rT9MNnHRe2BZYjRhGs_9Q3tGv6B2zGuIC9xfVLAGAHKlyOrvxc14&h=AT05OhHVT549m-moESjdtDCXsVwWG02Q1bKCuq36gvok4BFbim9E5-hZwTvSK0n3iBvHXWLA064ei24BqP0VFRuT9fbnrGiH3doWj_rZHcAHoN4UZBXVZ7wkwmtxC_k6nVKafWxSZyPU1oY-RV6blWQ)\n\n**Members**\nOur members cover a wide range of ages, expertise levels and genres - with full-time, part-time and total beginner self-published authors writing non-fiction, romance, historical, thrillers, literary, memoir, detective, chick-lit, sf & fantasy and more.\n\nWelcome! We look forward to meeting you.\n\nA few free, highly valuable resources include:\n\\- Mark Dawson's Self\\-Publishing Podcast \\- [https://selfpublishingformula.com/spf-podcast](https://selfpublishingformula.com/spf-podcast)\n\\- Six\\-Figure Author Podcast \\- [https://6figureauthors.com/](https://6figureauthors.com/)\n\\- Mark Dawson's Facebook group \\- [https://www.facebook.com/groups/SPFsecretgroup](https://www.facebook.com/groups/SPFsecretgroup)\n\\- 20Booksto50k Facebook group \\- [https://www.facebook.com/groups/20Booksto50k](https://www.facebook.com/groups/20Booksto50k)\n\\- The LIA Facebook group \\- [https://www.facebook.com/groups/londonindieauthors](https://www.facebook.com/groups/londonindieauthors)\n\n(The group follows a strict ethical/Amazon Terms of Service code. No review swaps, review buying, book spamming, stuffing, scamming or black hat tactics of any kind.)",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36242389",
        "name": "Guildford Writing & Literature Meetup",
        "link": "https://www.meetup.com/guildford-writing-literature-meetup",
        "description": "Hey & Welcome all!\nAiming to organise meetups for anyone with an interest in anything related to the sphere of writing, literature, publishing, & poetry in & around Guildford.\n\nIt'll be a nice way to chat about what you're working on, find out what everyone else is up to, and - if you're feeling brave - share a bit about what you've been creating.\n\nThese'll be relaxed hangouts, likely in one of Guildford's many pubs or coffee shops.\n\nOpen to absolutely anyone and everyone & for free :D\nLook forward to seeing you there!",
        "city": "Guildford",
        "state": "N7",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "26726470",
        "name": "WRITERS AND ACTORS LUNCH & SUPPER CLUB",
        "link": "https://www.meetup.com/writers-and-actors-supper-club",
        "description": "<p>Essentially a writers group. Novels, Screenplays and Stage Plays. This group will be about our new and ongoing writing projects. We will meet for lunch or supper and have our work rehearse-read /perfby actors. Once in a while we will have someone's whole play or script directed and performed.</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36004534",
        "name": "Share and Explore Poetry",
        "link": "https://www.meetup.com/share-explore-poetry",
        "description": "This is a group for people to explore poetry together and share the poems we create or encounter.\n\nWhether you're just starting out or have been writing for a while, it's for anyone who enjoys poetry and would like to engage more with this art form.\n\nThe intention is to evolve a small group to provide a supportive environment to create, share and discuss.",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36160889",
        "name": "Indie Romance Authors' Virtual Write-Togethers",
        "link": "https://www.meetup.com/indie-romance-authors-virtual-write-togethers",
        "description": "We meet via Zoom to work on our WIPs. It's an hour of focused writing, with like-minded romance authors.\n\nOur sessions are a safe, quiet space online where we put our butts in the chair and write. Anyone who writes romance is free to join us.",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36375854",
        "name": "Personality Psychology for Fiction",
        "link": "https://www.meetup.com/personality-psychology-for-writers",
        "description": "This group is for everyone who is interested in fiction and personality psychology. If you love talking about your favourite series and analysing the characters - join us!\n\nIn particular, this group would be beneficial for writers who are interested in applying personality psychology to their writing. We will discuss how to use personality theories to build a compelling narrative structure, by exploring existing fictional work. Topics will include: what makes for a believable character, how to create well-rounded protagonists/antagonists etc",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "26931477",
        "name": "Greenwich & Blackheath Writers Group",
        "link": "https://www.meetup.com/greenwich-blackheath-writers-group",
        "description": "Hello! We are a critique group in south-east London for confident writers of fiction since January 2018. And we're really proud to be four-ish years old!! This is not for the beginner, but instead for people actively working on their writing and looking to give and get thoughtful, friendly feedback as part of a supportive community.\nIt works as follows: The writer brings copies of the piece they'd like critiqued and then reads it out loud to the group. The group then discusses the work while the writer listens in silence. We critique two or three pieces of writing each time, so there's a per-session limit per writer of c. 2500 words.\nThe three of us who run the group write fiction and one of us has a novella out, so that's our expertise, but past that we are open to genre [due to our personal tastes, no slash, and please go easy on the horror]). In the past we have had a couple poets, and a couple playwrights, but fiction is our wheelhouse.\nIf you would like to join, we require all potential new members to send a few pages of your work to blackheathwriters@gmail.com. This is important so we can get an idea of what you're working on, and ensure a more-or-less consistent standard of what everyone is contributing to the group. Please be willing to contribute both sides - to bring writing to be critiqued as well as critique that of others.\nOnce we're read your sample, we'll probably arrange a quick private v/c for mutual introductions, explain to you how we operate, answer your questions, and make joining an established group a little less intimidating. Please keep in mind the three of us who run the group have full-time jobs and other stuff going on, so we aren't always very speedy at replying. But we do our best.\nFrom July 2022 we are meeting in person again, so this is important: We charge £3 per session (cash or cheque) to cover our costs, and please also purchase something from the venue - the location of which is confirmed once the three of us who run the group have agreed we think you'll be someone we'd like to work with.\nAny questions, feel free to contact us via the email above, through a meetup message or via our twitter (@seldnwriters). We all work full-time and have various things going on, so we unfortunately don't always reply right away, but we will get back to you; the gmail tends to be the quickest.\nHope to read your stuff soon!",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "31626927",
        "name": "Writebulb",
        "link": "https://www.meetup.com/writebulb",
        "description": "<p>A writing group in the heart of Chelmsford, here to write, improve, and commiserate over tea and biscuits after. :)</p>",
        "city": "Chelmsford",
        "state": "E4",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "28067559",
        "name": "Just Write - Kent & Sussex Writers",
        "link": "https://www.meetup.com/just-write-kent-and-sussex-writers",
        "description": "<p>Hi all,</p>\n<p>Firstly welcome.&nbsp;</p>\n<p>Secondly meet up is quite an expensive platform and we can only afford to limit the group to 50 members due to its prices.&nbsp;</p>\n<p>Therefore we have to be quite strict on participation. We are sorry but we really need active members who are going to come along and support other writers. We can’t as a group of fellow creatives support those who just sit on our platform and do not participate. We do not have the funds.&nbsp;</p>\n<p>We want to be as inclusive and supportive as we can but we need you to do the same. It’s a two way street.</p>\n<p>The group itself is <span>for anyone interesting in writing, all kinds of writing whether its poetry, novel writing, screenplays, flash fiction memoirs, non- fiction etc. It is set up to help and support fellow writers and creatives in a environment where if they wish they can discuss in confidence their current works in progress whatever that may be.</span></p>\n<p>It is to talk and share ideas about writing, share books that help each other progress, find inspiration and just chat about writing. </p>\n<p>It is hoped that once established we can locate and share writing competitions for group members, attend literary festivals where we can meet writers and hear what has worked for them, find courses on writing to help improve our writing, and find out about literary agents. Plus it is also hoped that it may be arranged that we could have bestselling authors or literary agents come and visit and talk to us. If we do manage this obviously this could incur an extra charge for that event. </p>\n<p>All writers dream about being published and this group hopefully can also share ideas regarding that whether its traditionally published, hybrid or being independently published through Kindle and createspace. &lt;br&gt;</p>\n<p>Whatever stage you are at your writing every person who started writing was there once!</p>\n<p>Writing can be a lonely occupation or hobby. This group hopes that it will make it a less lonely place. It is a group that is there for you!</p>\n<p>Please can all writers join with a true likeness photo of themselves - this is to help event hosts recognise you when you come to a meet up so no animals, cartoons or children will be accepted.</p>\n<p>Also please can you answer what type of writing you are doing, have done or would like to do if writing is something that you would like to try out. This is also to help us guide events that may interest writers such as author talks, literary festivals and other such things.</p>\n<p>If critquing or giving feedback on another writer's or creative's work please remember constructive critisicm is always good but destructive critisicm is not and treat a fellow writer or creative how you would like to be treated please! </p>\n<p>Unfortunately due to the cost of the meet up fees and also the hope in securing a good location we do have to charge a small fee per meet up. That is currently set at £1 per meet up. We have no other charges.</p>\n<p>We look forward to welcoming you and really getting on with some good writing and hopefully we can get some good authors to come and visit our group and do some good writers stuff. </p>\n<p>We are always looking out also for good quality and totally free venues.&nbsp;</p>\n<p>Writing isn’t a lucrative venture as people think but it’s art- it’s painting, painting with words to create pictures.</p>\n<p> <br></p>",
        "city": "Tunbridge Wells",
        "state": "G5",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "18346921",
        "name": "Oxford Writing Circle",
        "link": "https://www.meetup.com/oxford-writing-circle",
        "description": "<p>The Oxford Writing Circle is a vibrant community of writers based in Oxford. We are equally open to complete beginners, very experienced writers and everyone in between. While the majority of our current members are writing fiction, many others are poets, non-fiction writers, dramatists, comic artists… all genres are welcome.</p>\n<p>We give our members the opportunity to share their work (this is always optional) and receive feedback; to participate in discussion about other members’ writing; and to socialise with other writers.</p>\n<p>If this sounds interesting, please just come along to one of our events to get an idea of what we’re about!</p>\n<p>Typical events involve a few of the group’s writers each sharing a piece of their work (usually by reading aloud with listeners following along on paper or electronic copies). There is then a facilitated discussion of each piece, aiming to provide helpful feedback and critique. There is no obligation to share your work, or to comment on pieces, though we encourage as much discussion from as many voices as we have time for. We also have themed events - such as writing to a prompt - and more social gatherings. You can find more information on the individual event pages. All events are currently online.</p>\n<p>As well as our facilitated events during the week, we also run a drop-in writers’ brunch (currently online) on Saturday mornings. This is simply a communal writing session, a chance to work on whatever you like amongst like-minded company.</p>\n<br>\n<p><b>Our Community Rules</b></p>\n<p>Please read our guide on how to get the most out of our feedback sessions, available here.&nbsp;<a href=\"https://docs.google.com/document/d/e/2PACX-1vQYioGi0fnuWTszxJCdvVJPG82qoeA87xQinsChnjXoTyffFUsC9ZIhAyQkKEVWaxDgbg6HBewb11cz/pub\">https://docs.google.com/document/d/e/2PACX-1vQYioGi0fnuWTszxJCdvVJPG82qoeA87xQinsChnjXoTyffFUsC9ZIhAyQkKEVWaxDgbg6HBewb11cz/pub</a></p>\n<p><span>Our full Community Rules can be found here:&nbsp;</span><a href=\"https://docs.google.com/document/u/1/d/e/2PACX-1vRafGOfNvI6IzQW8KyejZzM17cWjqBP4VQdLAEXN5baq48vDJuras_5YMEV6sqAAGfUbMzM0ZhqAOBu/pub\">https://docs.google.com/document/u/1/d/e/2PACX-1vRafGOfNvI6IzQW8KyejZzM17cWjqBP4VQdLAEXN5baq48vDJuras_5YMEV6sqAAGfUbMzM0ZhqAOBu/pub</a><br></p>\n<p>In brief, however…</p>\n<p>The OWC aims to be a welcoming space for everyone. We are not perfect, but we strive to be anti-sexist, anti-racist, queer-friendly, trans-inclusive and non-ableist. Our group is generally lovely and people usually communicate constructively with each other, but in the rare event that you are made uncomfortable by the behaviour of another member, or if you feel that the group has acted contrary to the values stated above, we absolutely want to know about it so the group continues to be a fun, productive and safe community. If you have questions, concerns or queries, you are welcome to contact the group organisers (Tiffany Williams, Abigail Vint, Ian Robertson, Sarah Milne Das, Sarah Jones and Sophia Holme). Email us on <a href=\"mailto:oxfordwritingcircle@gmail.com\">oxfordwritingcircle@gmail.com</a>, or message one of us on Facebook or Meetup.</p>\n<br>",
        "city": "Oxford",
        "state": "K2",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36382714",
        "name": "Oxford Women Writers",
        "link": "https://www.meetup.com/oxford-women-writers",
        "description": "This is a group for Oxford Women Writers to support each other and connect over writing. \nThe idea is to: \n\\- have mini writing retreats together in coffee shops or wherever the mood takes us\n\\- keep each other motivated\n\\- run workshops for each other\n\\- talk about writing and books\n\\- make friends along the way \n\\- over time give constructive feedback for each other’s writing",
        "city": "Oxford",
        "state": "K2",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "32230240",
        "name": "MK Creative Writing Meetup Group",
        "link": "https://www.meetup.com/mk-creative-writing-meetup-group",
        "description": "<p>This group is for all writers needing a boost and all would be writers (like me) needing to get started.</p> \n<p>The aim is to meet once a month to discuss ideas, talk about writing, support one another, as well as get those creative juices flowing. Please bring your own work on if you want to discuss it or bounce ideas off of people.</p> \n<p>&lt;br&gt;</p> \n<p>&lt;br&gt;</p> \n<p>&lt;br&gt;</p>",
        "city": "Milton Keynes",
        "state": "B9",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "27965255",
        "name": "London Writing Meetup",
        "link": "https://www.meetup.com/meetup-group-hseqfzdb",
        "description": "<p>It will be a fun, inspirational Poetry group where we can share Poetry, do some writing of Poetry, exchange ideas and enjoy the night.The venue is fantastic and quiet, perfect for Poetry.</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36055528",
        "name": "Chichester Writers' Group",
        "link": "https://www.meetup.com/chichester-writers-group",
        "description": "**What?**\n\nA regular Wednesday evening meet up for people to work on their writing projects in the Chichester/ surrounding community in 2022. Whether it's a novel, academic assignment or lyrics, everyone is welcome to come and work on their project.\n\nThe sessions involve an hour of quiet writing time followed by drinks for anyone who wants to socialise/ discuss projects afterwards. We've introduced workshopping as an additional option for people who would like to get involved - this is optional!\n\nThere's printed signage on the table so you can't miss us/ can avoid the awkward 'is it/ isn't it them' shuffle. We'll use extension cables/ a well socketed area but it is helpful if you can bring a fully charged writing device with you.\n\n**When?**\n\nWednesdays 7pm\n\n**Where?**\n\nCrate & Apple, Chichester (at the end of West Street on the other side of the roundabout).\n\n**Fees**\n\nFirst sessions are free to see if people enjoy the group, and then after that it's £5 per month to be a part of the group. This is to cover the costs of the Meet Up group and support events.\n\n**Parking**\n\nOrchard Street Car Park - PO19 1DD\nSt. Cyriacs Car Park - PO19 1AW",
        "city": "Chichester",
        "state": "P6",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36338151",
        "name": "Word Wanderers",
        "link": "https://www.meetup.com/wordwanderers",
        "description": "A Focused hour creative writing group open to feedback and thoughts! Bring your stories, poems and plays!\n\nWe start writing at 15 past the hour, usually with cameras off and muted, after everyone has had a chance to catch up. We return an hour later, to read our pieces and gain feedback. There is never any pressure to read aloud, and we ask that everyone practice kindness in their feedback! If you have any questions please feel free to DM us.",
        "city": "Oxford",
        "state": "K2",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "31561621",
        "name": "London Free-writing Meetup",
        "link": "https://www.meetup.com/london-free-writing-meetup",
        "description": "<p>Any-one who enjoys writing. Take a pen, a piece of paper and write without excessive thought. This can be a fantastic way to find new story ideas, progression in a novel, a new poem or simply for the pleasure of words flowing onto the page.</p><p>Once upon a time we met in cafes in West London, at the proms and even had small writing parties. For the foreseeable future however , the group will remain online(On zoom). </p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "17982522",
        "name": "Children's Book Authors Writing and Social Club",
        "link": "https://www.meetup.com/childrens-book-authors-writing-and-social-club",
        "description": "<p>We are a London-based group for both established and aspiring children's book authors designed to support and inspire. We host regular writing meet-ups in lovely quiet London locations to help you get those words down.</p>\n<p>These are free to attend - all we ask is that you are quiet for the 2-3 hour writing period. After that, do stay for a drink and a chat to get to know your fellow authors. There's no formal sharing of work, but feel free to talk about your writing project - us children's book writers tend to be a helpful, generous and constructive bunch!</p>\n<p>We hope you'll join us on our trips throughout the year to events such as the Hay Book Festival, the Edinburgh Book Festival and the Bath Children's Literature Festival (a personal favourite). We also plan to organise some week-long writing retreats both in the UK and France so watch this space. Happy writing!</p>",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36381852",
        "name": "Rule Zero Writing Meetup",
        "link": "https://www.meetup.com/rule-zero-writing-meetup",
        "description": "Hey all,\n\nWe are looking to start a writing group at our East London gaming and cocktail bar. Open to writers of all abilities working on, or looking to start, a writing project.\n\nMatt, the coffee guy at the shop, is writing for a number of upcoming contests and has booked a table at the bar for just such an endeavour. This table can be expanded to more tables and served with beer, coffee, cocktails and food! The plan is just to have a couple chill hours where people can drop in and out, make some progress and maybe socialise with a drink after.",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "10848792",
        "name": "Bognor Regis Write Club",
        "link": "https://www.meetup.com/bognor-regis-writers-group",
        "description": "A group for fiction writers who are interested in being published or are published. Everyone will get a chance to read out their latest work and receive positive criticism and support from other members. A monthly theme is set for inspiration, if needed.\nWe meet on the 3rd Monday of the month from 19:00, at the Regis School of Music, 46 Sudley Road, Bognor Regis.\nWe are not a beginners group nor a class teaching creative writing, although we do learn from each other. Our members are by and large people who are creating work with the aim of having it published, and/or have previously had work published.\nFor more info, visit https://bognorwriteclub.com/ or email bognorwriters@gmail.com.",
        "city": "Bognor Regis",
        "state": "P6",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "34731473",
        "name": "The Write Way Up Creative Writing Meet Up Group Farnham",
        "link": "https://www.meetup.com/the-write-way-up-creative-writing-meet-up-group",
        "description": "<p>The group is for those who want to write creatively for your first blog, or for a hobby, or, for your social media, but just haven't started yet, or perhaps you just need to reignite your passion for writing in a fun and creative way.<br>We will create together by using creative prompts, exercises to get us into that inspired and happy writing frame of mind. Online atm but in person, we will meet in inspirational venues.</p>",
        "city": "Farnham",
        "state": "N7",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36071352",
        "name": "20-something Writers - London",
        "link": "https://www.meetup.com/20-something-writers",
        "description": "**What's the purpose of this group?**\n\nTo build the community and connection of young and aspiring novelists, aged between 20-30.\n\nWith the broad collection of writer’s groups in London, some younger people find joining one filled with older and more experienced writers a bit daunting. Therefore, I have created a group exclusively for writers in their 20s to connect in a more close-knit, casual environment.\n\n**Who should join?**\n\nAspiring creative writers from London who want to meet up once a month (probably in a pub or coffee shop) to discuss their own writing, or listen and resonate as others talk about their work.\n\n**What will happen at the in-person events?**\n\n* Connect with like-minded people and writers of a similar age\n* Hear others discuss their writing struggles and triumphs\n* Discuss your own writing (if you want to)\n* Get some encouragement, accountability and inspiration",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36291124",
        "name": "The Severus T. Snape Appreciation Club",
        "link": "https://www.meetup.com/the-severus-snape-appreciation-club",
        "description": "“I can teach you how to bottle fame, brew glory, even put a stopper in death.”\n\nCalling all half blood prince fans! This group is for anyone who is a Severus Snape enthusiast. I wanted an online group for us to meet up monthly to discuss the character, share our fave fanfics, and the occasional Alan Rickman film night! It's a special interest of mine and have annoyed everyone in personal life by talking about it too much so here is a space 😄 Look out for themed events!\n\nDisclaimer: we don't agree with Rowling's transphobia and strongly condemn it. This is a queer positive, disability positive, BPoC & religious minority safe space.\n\nTypes of sessions:\nCharacter analysis time!!\nFanfic writing session\nAlan Rickman interlude (film nights!)\nGeneral Harry Potter chats",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": true,
        "isNewGroup": false
    },
    {
        "id": "34162795",
        "name": "Writing for the Soul of the World in London",
        "link": "https://www.meetup.com/writing-for-the-soul-of-the-world-in-london",
        "description": "That stories have consequences is at the heart of this bimonthly writing salon open to writers of all levels, working across all genres, fiction and nonfiction. We gather from around the world for philosophical conversations on writing in light of the mythopoetic writing theory *Universal Grammar of Story™* developed by Dr. Hazel Denhart. In these salons we contemplate the ancient writer archetype, essential components of storytelling, and how to gracefully navigate writer’s block. We also consider the responsibility we have to our readers and audiences by recognizing that like our grown children our stories must leave us for the wider world where they influence others. Writers are the cultural scouts guiding society along the uncharted edges of an increasingly dangerous social frontier.\nThe salon is free to all with a suggested donation of $5.00 for those with the means to do so to help cover the Meetup and Zoom expenses.\nAll participants can find complementary chapters from Universal Grammar of Story and the companion workbook at the [Invisible Press online store.](https://invisiblepress.com/store/) Scroll down to the bottom of the page for sample copies\nFor more information visit T[he Invisible Press Website.](https://invisiblepress.com/)\n ",
        "city": "London",
        "state": "17",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "36327496",
        "name": "Oxford Goddesses: Creative, Mind and Spiritual meet-up",
        "link": "https://www.meetup.com/oxford-goddesses-creative-mind-and-spiritual-meet-up",
        "description": "Welcome women who yearn to talk about all things creative, mind and spirit! I’d love to bring together a group of likeminded women in the local area. To start with we can chat and get to know each other. Starting topics may include: \ngreat books or podcasts about mind, spirit and creativity\npassions such as writing, reading, art or music\nour own personal spiritual, healing or creative journey\n\nAfter that we could start doing some activities, depending on general consensus such as theatre trips, arts and craft afternoons, book club, writing meet-ups or forest walks.\n\nThe aim is to have fun, feel connected and expand our interests.",
        "city": "Oxford",
        "state": "K2",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "35240311",
        "name": "Brighton Authors’ Group",
        "link": "https://www.meetup.com/brighton-authors-meetup-group",
        "description": "<p>A new community for all Sussex-based authors.<br>Writing books can be a frustrating, lonely business. Just how frustrating and lonely is something only authors can truly understand. Hours spent hunched over a laptop (or avoiding it), trying to connect with a silent, invisible audience. Infrequent bouts of brilliance popping up unreliably among days of self-doubt. The tyranny of the flashing cursor. Then there's the trying to find a publisher, then, when you do, battling with the publisher. The daily fight with what Stephen Pressfield calls the Resistance. And doing it all on your own, while living in your head.</p> \n<p>Unless you do it, you won't get it. But if you do, this probably all sounds very familiar. But what if you didn't have to do it all on your own?</p> \n<p>I’m gauging interest for a new group that will be the antidote to author isolation. It doesn't matter if you write fiction or non-fiction; if you're traditionally published or self-published; or whether you work full time or part time. All that matters is that you are serious about your work and would like to relax and chat with those who get what author life is like.</p> \n<p>We'll probably meet up on Zoom at first but in person as soon as possible. But I can't do it on my own. In fact, that's the point. I need other authors. So, are you in? If you think you might be, sign up and we'll take it from there.</p>",
        "city": "Hove",
        "state": "E2",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    },
    {
        "id": "30823718",
        "name": "Shepperton Wordsmiths Writers' Club",
        "link": "https://www.meetup.com/shepperton-wordsmiths-meetup",
        "description": "<p>Writing doesn't have to be a lonely pursuit!</p><p>Shepperton Wordsmiths is a biweekly writing group meeting every other Tuesday to provide a safe, social, and supportive forum for sharing and improving our writing.</p><p>Sometimes we start with an exercise we set at the previous meeting. Sometimes we start with a brief initial discussion of some technical aspect of writing, style, publication, or production, followed by member readings with group supportive feedback and respectful critique. </p><p>Readings will be voluntary, so no worries if you just want to observe and listen to gain confidence.</p><p>Meeting venues will be the Thames Court Pub, TW17 9LJ, although we sometimes have a boat ride or seasonal party.</p><p>Fee of £3 per Meetup.</p>",
        "city": "Shepperton",
        "state": "N7",
        "country": "gb",
        "isPrivate": false,
        "isNewGroup": false
    }
]